{"events":[{"title":"Earl Sweatshirt in Toronto","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T03:00:00.000Z","location":"Phoenix Concert Theatre","description":"RAPSEASON presents Earl Sweatshirt presents: With special guests Bbymutha and Liv.e (1st of 3). Some Rap Songs Tour Friday April 5, 2019 The Phoenix Concert Theatre 19+ Doors: 8pm Tickets $30.00 @ Ticketweb #RAPSEASON Pre-sale starts Thursday, Januar..."},{"title":"Lemon Bucket Orkestra","date":"2019-04-04T23:30:00.000Z","endTime":"2019-04-05T03:30:00.000Z","location":"The Opera House","description":"After a sold-out Koerner Hall show, the infamous LBO return to the raucous Opera House to kick off their US tour. The award-winning guerrilla-folk party punks will hit 8 cities on their second US tour in the past year, before heading out to Europe to play WOMA..."},{"title":"Toronto Int'l Spring of Horror & Fantasy Film Festival","date":"2019-04-04T21:00:00.000Z","endTime":"2019-04-05T03:59:00.000Z","location":"Imagine Carlton Cinema","description":"Welcome to Toronto's prime destination for genre films in the spring! The 4th annual Toronto Int'l Spring of Horror & Fantasy Film Festival (TISH) will take place at the Carlton Cinema in the heart of Toronto on April 5-7, 2019. Descriptions of all the fil..."},{"title":"163 John St. : FRIDAY SHOWCASE @ THE CORNER","date":"2019-04-04T23:00:00.000Z","endTime":"2019-04-04T04:00:00.000Z","location":"The Corner","description":"It's taking place at the newest, hottest comedy club, THE CORNER! FRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna be ..."},{"title":"946 QUEEN ST. EAST : FRIDAY SHOWCASE @ THE CORNER EAST","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-04T04:00:00.000Z","location":"The Corner East","description":"It's taking place at the newest, hottest comedy club, THE CORNER! FRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna be ..."},{"title":"Abstract Doodle Canvas Workshop","date":"2019-04-04T22:30:00.000Z","endTime":"2019-04-05T00:00:00.000Z","location":"Fresh Paint Studio (Danforth East)","description":"This workshop is for everyone who can appreciate the abstract beauty of freeflowing black and white patterns and designs. In this workshop we will create abstract freeflowing doodle art on canvas using oil paint markers and paint. We will also learn about some..."},{"title":"AfterWerk - Traffic Light Party","date":"2019-04-05T02:30:00.000Z","endTime":"2019-04-04T06:30:00.000Z","location":"Buddies in Bad Times","description":"AfterWerk is hosting a TRAFFIC LIGHT PARTY! We're back at BUDDIES on a FRIDAY Apr 5th. Category is: Traffic Light Party! What’s a traffic light party? It’s a chance to meet your spring fling. Where Green, Yellow or Red to signal if your: SINGLE: Green OPEN: Ye..."},{"title":"Ali Hassan Live Comedy","date":"2019-04-05T01:30:00.000Z","endTime":"2019-04-05T03:00:00.000Z","location":"The Underground Cafe","description":"Join us Friday April 5th at 9:30pm, for a stellar comedy show with Ali Hassan! Ali Hassan is an actor and chef who has performed on stages across Canada, in the U.S. and twice in the Middle East at the Amman Stand-Up Comedy Festival. Ali has graced the Big Scr..."},{"title":"Axes & Ales: The Ultimate Canadian Experience","date":"2019-04-04T22:30:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"The Extension Room","description":"If you’re looking for the ultimate Canadian experience, look no further. Axes & Ales is the place to eat, drink, play and support all things Canadian! Bring your best plaid and get ready for an evening of... Axe & Knife Throwing featured by STRYKE Pong Toss, G..."},{"title":"Baby & Me","date":"2019-04-04T13:30:00.000Z","endTime":"2019-04-04T15:30:00.000Z","location":"Royal Ontario Museum","description":"Meet other parents and caregivers, and enjoy adult learning and conversation in a baby-friendly atmosphere! With a Museum Teacher as your guide, explore a different gallery each week and discover extraordinary objects while your little one marvels at the new s..."},{"title":"BACH BRAHMS VASKS - Sinfonia Toronto concert","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"Glenn Gould Studio","description":"BACH, BRAHMS, VASKS Friday April 5, 2019 8 pm Glenn Gould Studio MARINA THIBEAULT Violist / MARIO CARBOTTA Flutist SINFONIA TORONTO / NURHAN ARMAN Conductor Time travel - an enchanting journey through three centuries of melody Program PETERIS VASKS Viola Conce..."},{"title":"Beam Me Up Disco: Now at The Drake!","date":"2019-04-05T02:00:00.000Z","endTime":"2019-04-04T06:30:00.000Z","location":"Drake Hotel","description":"Beam Me Up’s Disco! Every. Single. Friday. Night. Different spot, same delicious disco flavour! Gotta keep movin’ to the beat! We’re thrilled to be zipping up our boots and putting down roots at one of Toronto’s finest spots - the cultural hub that is the Drak..."},{"title":"Brit Floyd","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"Sony Centre for the Performing Arts","description":"Brit Floyd, the world’s greatest Pink Floyd tribute show, returns to the stage in 2019 with its most ambitious and best production yet, a very special 40th Anniversary retrospective of Pink Floyd’s iconic rock opera, The Wall. Released in November 1979, a semi..."},{"title":"Caught in the Net by Ray Cooney - Scarborough Players' Production","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"Scarborough Village Theatre","description":"Teenagers, Gavin and Vicki, happen to meet surfing the internet. They are attracted to each other and yet are amazed by all the coincidences — each having a father with the same name, same age, and same occupation. Why? Find out in this uproarious farce as the..."},{"title":"Choir! Choir! Choir! & Canadian Cancer Society: A community celebration of song and support","date":"2019-04-04T22:30:00.000Z","endTime":"2019-04-05T00:00:00.000Z","location":"Nathan Phillips Square","description":"The Canadian Cancer Society (CCS) knows that cancer changes people. But they believe that a cancer diagnosis doesn’t have to define who they are. Through their work, they aim to help people live longer and enhance the quality of life for all of those affected ..."},{"title":"CRAM Toronto: Extraordinary Ideas Unleashed","date":"2019-04-04T21:00:00.000Z","endTime":"2019-04-05T03:00:00.000Z","location":"Multiple Venues","description":"CRAM is a brand new free learning festival coming to Toronto! On Friday, April 5, 2019, Toronto’s four universities - OCAD University, Ryerson University, University of Toronto and York University - open their doors to give curious minds from across the city a..."},{"title":"Date Night Comedy with Ted Morris","date":"2019-04-04T22:00:00.000Z","endTime":"2019-04-05T00:00:00.000Z","location":"Burdock","description":"Buy tickets: https://burdockto.com/shows/?show=1883 $8 in advance, $10 at the door Doors at 6 p.m., Show at 6:30 p.m. // Date Night Comedy Spring has sprung and Date Night Comedy is back! April Showers bring the best beer in the city and the coolest, funniest,..."},{"title":"Dinner & Aboriginal Dot Art","date":"2019-04-04T23:00:00.000Z","endTime":"2019-04-05T01:00:00.000Z","location":"Beach United Church","description":"If you're between the ages of 21 and 35, join us for an interactive, fun evening of looking at community connections through Aboriginal dot-painting. We'll build connections and understand the place of faith and creativity in community. It's an opportunity to ..."},{"title":"DUER Performance is Giving Away FREE Pants!","date":"2019-04-04T15:00:00.000Z","endTime":"2019-04-04T22:00:00.000Z","location":"DUER Performance","description":"Everyone's favourite performance denim brand DUER Performance is opening their second retail location along the iconic Queen St W. in Toronto. From Friday through Sunday, the first 25 people to enter our store will receive FREE pants! Yes. That's right. FREE. ..."},{"title":"Ekstasis: Lost Ancient Wisdom, Mystery Rites and Flow States","date":"2019-04-04T23:30:00.000Z","endTime":"2019-04-05T01:30:00.000Z","location":"Alternity","description":"There is a growing cloud of anxiety and disconnection from the natural order of things that hangs over the shiny consumerist veneer of our modern secular age. And it begs the question… why are we experiencing such an epidemic of anxiety in one of the richest a..."},{"title":"ENSO Showcase 2019","date":"2019-04-04T23:00:00.000Z","endTime":"2019-04-05T03:00:00.000Z","location":"Bonafide","description":"ENSO Showcase 2019 is a student-organized event from Ryerson University that showcases the work and performances of young Asian creatives in the local community. ENSO Showcase is built on providing an inclusive platform where Asian-identifying individuals can ..."},{"title":"Family Shabbat Dinner","date":"2019-04-04T21:30:00.000Z","endTime":"2019-04-04T23:30:00.000Z","location":"Makom: Creative Downtwon Judaism","description":"Parents, grandparents & kids! Join us for a fun evening, meet other downtown families, and welcome Shabbat together. Family members of ALL backgrounds, faiths, orientations, and genders ARE WELCOME! 5:30 Gather 5:45 Story, short song-filled service & game 6:30..."},{"title":"Frankenhooker Unicorn Fear is Free Fridays","date":"2019-04-05T00:45:00.000Z","endTime":"2019-04-04T05:45:00.000Z","location":"Kingsway Theatre BAR - The Last Independent","description":"Frankenhooker Unicorn Fear is Free Fridays. All ROCKin' with NO revisionist talkin'. Watch movies the way they were meant to be seen! On the BIG SCREEN and in the BIG FRIGHTFUL SOUND. Fun starts 8:45 pm Friday. Admission is FREE and everyone is welcome. 1. Fra..."},{"title":"FridaysforFuture April 5 Climatestrike","date":"2019-04-04T16:30:00.000Z","endTime":"2019-04-04T18:00:00.000Z","location":"Queen's Park, Toronto, ON M5S, Canada","description":"Friday, April 5, 2019 at 12:30 PM – 2 PM"},{"title":"Garage Baby and Giraffe","date":"2019-04-04T23:30:00.000Z","endTime":"2019-04-05T01:30:00.000Z","location":"Painted Lady","description":"Garage Baby continues it's monthly puck-rock residency with special musical mayhem guests; Giraffe."},{"title":"Garters of the Galaxy Vol.2: A Marvel Burlesque Parody","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T03:00:00.000Z","location":"The Great Hall","description":"Peepshow ASSvengers Assemble! Join the Marvel Burlesque Universe as your favourite characters are reimagined by PeepshowTO in a truly epic burlesque parody that is sure to leave you hulking and levitating out of your seat. Assemble your team and watch villains..."},{"title":"Global Boogie Banquet","date":"2019-04-05T02:00:00.000Z","endTime":"2019-04-04T06:00:00.000Z","location":"Handlebar","description":"Get lit on the dance floor with old and new grooves from around the globe with DJ Oreku. Free entry."},{"title":"Hot Brown Honey","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"St. Lawrence Centre for the Arts","description":"For the Game Changers, Myth Slayers, Poets, Movers, Music Makers, Ground Breakers, Truth Sayers, Shake em up Women, Queens, Queers and Risk Takers! Hot Brown Honey turns up the heat, delivering lashings of sass and a hot pinch of empowerment in the smash-hit t..."},{"title":"Hot Damn its a Queer Slam","date":"2019-04-04T23:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"Buddies In Bad Times Theatre","description":"THIS IS IT! The Championships! All year we've been traveling our show to towns, cities and hamlets to find the best in 2SLGBPTIPIA+ voices. We cannot wait to see who wins the grand prize of a trip to Capturing Fire Slam, the International Queer Summit & Slam i..."},{"title":"How To Beat Up Any Man","date":"2019-04-05T02:00:00.000Z","endTime":"2019-04-05T03:15:00.000Z","location":"JCB Theatre - Second City","description":"Comedian and writer Carol Zoccoli (Winnipeg Comedy Festival, The Debaters, Comedy Central Brazil) tell us how it was like growing up as a woman in Brazil - and her story is told through the men she’s beaten up. How To Beat Up Any Man is a funny and raw tale of..."},{"title":"Kickass Study Strategies for Math & Science! FOR KIDS WITH LDs","date":"2019-04-04T20:30:00.000Z","endTime":"2019-04-04T22:00:00.000Z","location":"The Math Guru","description":"Doing well on a test isn’t just about knowing course content - it’s about developing kickass study skills! This study strategy workshop will provide an overview of all the super important aspects of studying - from getting organized, to taking notes, to rememb..."},{"title":"Kitchen Stuff Plus Warehouse Sale","date":"2019-04-04T18:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"Kitchen Stuff Plus Warehouse","description":"Kitchen Stuff Plus is hosting a  warehouse sale this April 2019 in Toronto. Score up to 90% off furniture and cookware from Cuisinart, Henckel, Kitchen Aid, Umbra, Hamilton, Starfrit, Harman, Oster and more."},{"title":"Millennial Falcon","date":"2019-04-05T02:00:00.000Z","endTime":"2019-04-04T06:30:00.000Z","location":"The Boat","description":"DJs Shandy & Keith (P-P-Party, Yacht Rock, Dance Armstrong, The Groove Stew) have gathered the galaxy's best tunes of the new millennium to force your feet to dance! NO COVER BEFORE 11. OUTKAST BEYONCE ALICIA KEYS JAY Z KANYE SNOOP MADONNA LCD SOUNDSYSTEM AKON..."},{"title":"MLSE Foundation Game Changers Championship Gala","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-04T05:00:00.000Z","location":"Berkeley Church","description":"MLSE Foundation Game Changers proudly presents Championship Gala 2019 in support of MLSE Foundation and MLSE LaunchPad. Championship Gala (formerly known as Toronto Plays) will be hosted in the beautiful Berkeley Church on Friday, April 5, 2019. Come celebrate..."},{"title":"\"MOMENTOS\" Photography Exhibit","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T01:00:00.000Z","location":"El Almacen","description":"Solo exhibition by Afro Latino photographer, Carlos Scott Wilson. Showcasing a glimpse into his unique view of the world with local and international shots. Intermingling woodwork and wax with his creative style of photography. Free to attend. Opening event on..."},{"title":"Neo Waistland","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-04T22:00:00.000Z","location":"227 Sterling Rd","description":"Neo Waistland is a contemporary pop-up shop bringing forth revolutionary thoughts and creations. Join us on a three day exclusive experience of local Fashion, Music, Art & Food. The masterful DJ nomad nala will be spinning opening night April the 5th from 8pm ..."},{"title":"New Exhibition by Katie Bond Pretti","date":"2019-04-04T22:00:00.000Z","endTime":"2019-04-05T01:00:00.000Z","location":"Barbara Edwards Contemporary","description":"April 5 - May 18 Opening Reception: Friday, April 5 6-9pm Exploring synaesthetic translations of the otherworldly and unknown, her works draw inspiration from personal vision quests and sensations of being under surveillance––varied experiences that, collectiv..."},{"title":"No Box For Me. An Intersex Story","date":"2019-04-04T22:30:00.000Z","endTime":"2019-04-04T23:30:00.000Z","location":"TIFF Bell Lightbox","description":"M is 27 years old. Deborah is 25. Both are living in bodies that Western medicine — and often society — deems too taboo to discuss publicly. This beautifully crafted, poetic documentary from Swiss director Floriane Devigne joins these and other brave young peo..."},{"title":"Om Dar-B-Dar Film Screening","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"The Royal Cinema","description":"\"Om Dar-B-Dar\" directed by Kamal Swaroop in 1988 is the first screening in a new South Asian film series at The Royal Cinema. The film, an underground cult classic was chosen for it's experimental, non-linear narrative, it has been described as the antithesis ..."},{"title":"Opening Party Reception: The Art of Abstraction","date":"2019-04-04T23:00:00.000Z","endTime":"2019-04-05T01:00:00.000Z","location":"Winged Canvas Art Hub","description":"Opening Night Party: Fri Apr 5 | 7 - 9 pm (wine & cheese) Opening Reception: Sat Apr 6 | 1 - 3pm (family friendly) Vibrant colours, bold brushstrokes and different perspectives abound in this exhibit. Abstract art inspires our imaginations and sparks our curio..."},{"title":"PAINT PUFF PASS","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"Nameless","description":"Come enjoy the coolest thing since sliced bread. Its like Paint Night but like way better. Explore the creative side you didn't know you had. Expect to indulging in delicious treats, refreshing beverages all while laughing and creating with like minded locals ..."},{"title":"P A R T Y T O W N: April Shower Beer, Bro!","date":"2019-04-05T03:00:00.000Z","endTime":"2019-04-04T04:00:00.000Z","location":"Comedy Bar","description":">>Grab some buds and come celebrate that spring cleaning with PARTYTOWN at the best P A R T Y in town.<< This Canadian comedy award winning show features comedians from Second City, Bad Dog Theatre, and the CBC. Enjoy a high-octane night of comedy made up on t..."},{"title":"Paul Cafcae & The 20 Flight Rockers","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T03:59:00.000Z","location":"The Cavern Bar","description":"20 Flight Rockers is Ontario’s most ambitious rock ’n’ roll party band. We play a diverse repertoire of highly recognizable dance songs from 1950’s to 2010’s as well as original music delivered in an original rockabilly-themed live show, with the flavour of bl..."},{"title":"Phile Magazine x Untitled: HEAVY LOAD w/ Boris - Berghain - Ostgut","date":"2019-04-05T03:00:00.000Z","endTime":"2019-04-04T10:00:00.000Z","location":"500 Keele","description":"Phile Magazine & Untitled present HEAVY LOAD feat. The Canadian Debut of Boris DJs: xx Boris [Berghain / Panorama Bar | Ostgut Ton] xx Known for spinning marathons and being one of Berghain's main residents... Boris [Ostgut Ton] really is the master of all gen..."},{"title":"Possibilities of Dialogue","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-04T18:00:00.000Z","location":"Toronto Centre for the Arts","description":"April 05 - April 07, 2019 8pm - Apr 5 and 6, 2pm - Apr 7 Fee: Standard ticket $28.25, Senior/Student/Arts Worker ticket $18.75 Co-created and performed by TOES FOR DANCE Co-Director David Norsworthy and NYC-based dance artist Marielis Garcia, Possibilities of ..."},{"title":"Practically Petty, Canada's Top Tribute to Tom Petty Live at Drums N Flats","date":"2019-04-05T01:00:00.000Z","endTime":"2019-04-04T04:30:00.000Z","location":"Drums N Flats","description":"Practically Petty always deliver a fantastic night of Tom Petty Music that makes you HAPPY! Canada's Top Tom Petty Band have been paying homage to one of rock's most beloved singer, song writers, the late great Tom Petty. This show will sell out, so don't wait..."},{"title":"QUEER POP: LGBTQ Music & Arts Festival","date":"2019-04-05T02:00:00.000Z","endTime":"2019-04-04T07:00:00.000Z","location":"Club 120","description":"\"QUEER POP: LGBTQ+ Music & Arts Festival\" comes back for a second year and she's BIGGER & QUEERER than ever! AMAZING performances from this year's lineup as well as SEXY dancing from our HOT male/female GoGo Dancers with some of today's top DJ's playing the be..."},{"title":"Roby Lakatos","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T02:00:00.000Z","location":"Koerner Hall","description":"Virtuoso fiddler Roby Lakatos is a scorching player and a musician of extraordinary stylistic versatility. Born into the legendary family of Roma violinists, Lakatos is equally comfortable performing classical, jazz, and Hungarian folk music."},{"title":"Roncesvalles United 17th Annual Wine & Cheese Gala","date":"2019-04-04T22:00:00.000Z","endTime":"2019-04-05T03:00:00.000Z","location":"Roncesvalles United Chruch","description":"Join us for our Annual Wine & Cheese Gala, featuring live entertainment,provided by comedian Carolyn Bennett and world class Jazz musicians, Paul Goudy Jazz Quintet. Enjoy a live auction featuring a professional auctioneer, a silent auction featuring many amaz..."},{"title":"Shiraz: A Romance of India","date":"2019-04-04T23:00:00.000Z","endTime":"2019-04-05T01:00:00.000Z","location":"Revue Cinema","description":"Toronto Silent Film Festival opening night. Canadian premiere of the BFI restoration. World Premiere of a new score, composed and performed by Ensemble Polaris One of the Crown Jewels of early Indian filmmaking up on the big screen. Based on the immortal 17th ..."},{"title":"SOUL FLOWER with DJ General Eclectic","date":"2019-04-05T02:00:00.000Z","endTime":"2019-04-04T06:00:00.000Z","location":"Swan Dive","description":"Expertly selected Classic Psych, Soul & Rock tunes to make your Friday Night!"},{"title":"Spring Mystic Pop-Up Shop","date":"2019-04-04T22:00:00.000Z","endTime":"2019-04-05T01:00:00.000Z","location":"Inner Arts Collective","description":"Celebrate the New Moon with us! Come to the first annual Spring Mystic Pop Up Shop at the Inner Arts Collective! Get a reading from a gifted local diviner, purchase some magical jewelry for yourself or a loved one, discover how to increase your energy and well..."},{"title":"Taoist Tai Chi Open House: Free class April 5 at Knox Presbyterian Church","date":"2019-04-04T13:30:00.000Z","endTime":"2019-04-04T15:30:00.000Z","location":"Knox Presbyterian Church (please ring at back door on north side)","description":"Join us and try Taoist Tai Chi. Gentle movements promote well-being for people of all ages and in all conditions. They also serve as a moving meditation that reduces stress and provides a way to cultivate body and mind."},{"title":"The Invisibles","date":"2019-04-04T22:30:00.000Z","endTime":"2019-04-05T00:30:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"In 1943, Joseph Goebbels declared Berlin “free of Jews.” Though he did come markedly close to his goal, some 1,700 endured in secret. This gripping docu-drama traces the astonishingly-true stories of four young survivors who learned that sometimes the best pla..."},{"title":"The Liveable City?: Work","date":"2019-04-04T23:00:00.000Z","endTime":"2019-04-05T00:30:00.000Z","location":"Art Gallery of Ontario","description":"As Impressionism in the Age of Industry takes viewers on a journey through a period of immense change in 19th century Paris, we invite speakers across various disciplines to enter into conversations around urgent issues facing Toronto today: work, affordable h..."},{"title":"The Period Purse's Spring Blitz","date":"2019-04-04T04:00:00.000Z","endTime":"2019-04-05T03:59:00.000Z","location":"Multiple Venues","description":"The Period Purse is a volunteer-run non-profit organization that strives to achieve menstrual equity by providing marginalized menstruators with access to free menstrual products, and to reduce the stigma surrounding periods through public education and advoca..."},{"title":"TIFF: Carmine Street Guitars","date":"2019-04-05T00:30:00.000Z","endTime":"2019-04-05T02:30:00.000Z","location":"TIFF Bell Lightbox","description":"Director Ron Mann joins us for an introduction and post-screening Q&A; on Friday, April 5 at 8:30pm! Rick Kelly has been making custom guitars at his Greenwich Village shop for decades, using preserved and repurposed wood scavenged from historic New York build..."},{"title":"Violin Virtuoso Zoltan Maga","date":"2019-04-05T00:00:00.000Z","endTime":"2019-04-05T02:30:00.000Z","location":"Roy Thomson Hall","description":"Dazzling music is brought to life through the flair and passion of Hungary’s preeminent violin virtuoso, Zoltán Mága and his fiery orchestra: the Budapest Gypsy Virtuosi. After touring five continents and nearly 100 countries, Zoltán is returning to North Amer..."},{"title":"Where Does This Disco with DJ Digits","date":"2019-04-05T01:30:00.000Z","endTime":"2019-04-04T06:00:00.000Z","location":"Farside","description":"No cover! Fun, silly, and strange pop transmissions received from an alternate-dimension Earth. Mutant disco, Italo, electronic indie pop, psych-pop, and unusual cover versions selected by DJ Digits. featuring the sounds of: St Etienne Mylene Farmer Elle Barba..."},{"title":"Women's Art Association of Canada presents B.A.S.H!","date":"2019-04-04T21:30:00.000Z","endTime":"2019-04-05T00:00:00.000Z","location":"Women's Art Association of Canada","description":"B.A.S.H. is presented by The Women’s Art Association of Canada to honour women in the arts who are over the age of 80. You will see them at work sculpting, playing in the ukulele ladies band, and building a ceramic piece before your eyes! Join us in our lovely..."},{"title":"WONDERWALL","date":"2019-04-04T23:00:00.000Z","endTime":"2019-04-05T02:30:00.000Z","location":"Capital Espresso","description":"An Art Exhibit by an interracial couple exploring growth, publicly as individuals."},{"title":"Earl Sweatshirt in Toronto","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T03:00:00.000Z","location":"Phoenix Concert Theatre","description":"RAPSEASON presents Earl Sweatshirt presents: With special guests Bbymutha and Liv.e (1st of 3). Some Rap Songs Tour Friday April 5, 2019 The Phoenix Concert Theatre 19+ Doors: 8pm Tickets $30.00 @ Ticketweb #RAPSEASON Pre-sale starts Thursday, Januar..."},{"title":"Lemon Bucket Orkestra","date":"2019-04-05T23:30:00.000Z","endTime":"2019-04-06T03:30:00.000Z","location":"The Opera House","description":"After a sold-out Koerner Hall show, the infamous LBO return to the raucous Opera House to kick off their US tour. The award-winning guerrilla-folk party punks will hit 8 cities on their second US tour in the past year, before heading out to Europe to play WOMA..."},{"title":"Toronto Int'l Spring of Horror & Fantasy Film Festival","date":"2019-04-05T21:00:00.000Z","endTime":"2019-04-06T03:59:00.000Z","location":"Imagine Carlton Cinema","description":"Welcome to Toronto's prime destination for genre films in the spring! The 4th annual Toronto Int'l Spring of Horror & Fantasy Film Festival (TISH) will take place at the Carlton Cinema in the heart of Toronto on April 5-7, 2019. Descriptions of all the fil..."},{"title":"163 John St. : FRIDAY SHOWCASE @ THE CORNER","date":"2019-04-05T23:00:00.000Z","endTime":"2019-04-05T04:00:00.000Z","location":"The Corner","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nFRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna be ..."},{"title":"946 QUEEN ST. EAST : FRIDAY SHOWCASE @ THE CORNER EAST","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-05T04:00:00.000Z","location":"The Corner East","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nFRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna be ..."},{"title":"Abstract Doodle Canvas Workshop","date":"2019-04-05T22:30:00.000Z","endTime":"2019-04-06T00:00:00.000Z","location":"Fresh Paint Studio (Danforth East)","description":"This workshop is for everyone who can appreciate the abstract beauty of freeflowing black and white patterns and designs.\nIn this workshop we will create abstract freeflowing doodle art on canvas using oil paint markers and paint.\nWe will also learn about some..."},{"title":"AfterWerk - Traffic Light Party","date":"2019-04-06T02:30:00.000Z","endTime":"2019-04-05T06:30:00.000Z","location":"Buddies in Bad Times","description":"AfterWerk is hosting a TRAFFIC LIGHT PARTY! We're back at BUDDIES on a FRIDAY Apr 5th.\nCategory is: Traffic Light Party! What’s a traffic light party? It’s a chance to meet your spring fling. Where Green, Yellow or Red to signal if your:\nSINGLE: Green\nOPEN: Ye..."},{"title":"Ali Hassan Live Comedy","date":"2019-04-06T01:30:00.000Z","endTime":"2019-04-06T03:00:00.000Z","location":"The Underground Cafe","description":"Join us Friday April 5th at 9:30pm, for a stellar comedy show with Ali Hassan!\nAli Hassan is an actor and chef who has performed on stages across Canada, in the U.S. and twice in the Middle East at the Amman Stand-Up Comedy Festival. Ali has graced the Big Scr..."},{"title":"Axes & Ales: The Ultimate Canadian Experience","date":"2019-04-05T22:30:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"The Extension Room","description":"If you’re looking for the ultimate Canadian experience, look no further. Axes & Ales is the place to eat, drink, play and support all things Canadian! Bring your best plaid and get ready for an evening of...\nAxe & Knife Throwing featured by STRYKE\nPong Toss, G..."},{"title":"Baby & Me","date":"2019-04-05T13:30:00.000Z","endTime":"2019-04-05T15:30:00.000Z","location":"Royal Ontario Museum","description":"Meet other parents and caregivers, and enjoy adult learning and conversation in a baby-friendly atmosphere! With a Museum Teacher as your guide, explore a different gallery each week and discover extraordinary objects while your little one marvels at the new s..."},{"title":"BACH BRAHMS VASKS - Sinfonia Toronto concert","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"Glenn Gould Studio","description":"BACH, BRAHMS, VASKS\nFriday April 5, 2019 8 pm Glenn Gould Studio\nMARINA THIBEAULT Violist / MARIO CARBOTTA Flutist\nSINFONIA TORONTO / NURHAN ARMAN Conductor\nTime travel - an enchanting journey through three centuries of melody\nProgram\nPETERIS VASKS Viola Conce..."},{"title":"Beam Me Up Disco: Now at The Drake!","date":"2019-04-06T02:00:00.000Z","endTime":"2019-04-05T06:30:00.000Z","location":"Drake Hotel","description":"Beam Me Up’s Disco! Every. Single. Friday. Night. Different spot, same delicious disco flavour!\nGotta keep movin’ to the beat! We’re thrilled to be zipping up our boots and putting down roots at one of Toronto’s finest spots - the cultural hub that is the Drak..."},{"title":"Brit Floyd","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"Sony Centre for the Performing Arts","description":"Brit Floyd, the world’s greatest Pink Floyd tribute show, returns to the stage in 2019 with its most ambitious and best production yet, a very special 40th Anniversary retrospective of Pink Floyd’s iconic rock opera, The Wall.\nReleased in November 1979, a semi..."},{"title":"Caught in the Net by Ray Cooney - Scarborough Players' Production","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"Scarborough Village Theatre","description":"Teenagers, Gavin and Vicki, happen to meet surfing the internet. They are attracted to each other and yet are amazed by all the coincidences — each having a father with the same name, same age, and same occupation. Why? Find out in this uproarious farce as the..."},{"title":"Choir! Choir! Choir! & Canadian Cancer Society: A community celebration of song and support","date":"2019-04-05T22:30:00.000Z","endTime":"2019-04-06T00:00:00.000Z","location":"Nathan Phillips Square","description":"The Canadian Cancer Society (CCS) knows that cancer changes people. But they believe that a cancer diagnosis doesn’t have to define who they are. Through their work, they aim to help people live longer and enhance the quality of life for all of those affected ..."},{"title":"CRAM Toronto: Extraordinary Ideas Unleashed","date":"2019-04-05T21:00:00.000Z","endTime":"2019-04-06T03:00:00.000Z","location":"Multiple Venues","description":"CRAM is a brand new free learning festival coming to Toronto!\nOn Friday, April 5, 2019, Toronto’s four universities - OCAD University, Ryerson University, University of Toronto and York University - open their doors to give curious minds from across the city a..."},{"title":"Date Night Comedy with Ted Morris","date":"2019-04-05T22:00:00.000Z","endTime":"2019-04-06T00:00:00.000Z","location":"Burdock","description":"Buy tickets: https://burdockto.com/shows/?show=1883\n$8 in advance, $10 at the door\nDoors at 6 p.m., Show at 6:30 p.m.\n// Date Night Comedy\nSpring has sprung and Date Night Comedy is back! April Showers bring the best beer in the city and the coolest, funniest,..."},{"title":"Dinner & Aboriginal Dot Art","date":"2019-04-05T23:00:00.000Z","endTime":"2019-04-06T01:00:00.000Z","location":"Beach United Church","description":"If you're between the ages of 21 and 35, join us for an interactive, fun evening of looking at community connections through Aboriginal dot-painting. We'll build connections and understand the place of faith and creativity in community. It's an opportunity to ..."},{"title":"DUER Performance is Giving Away FREE Pants!","date":"2019-04-05T15:00:00.000Z","endTime":"2019-04-05T22:00:00.000Z","location":"DUER Performance","description":"Everyone's favourite performance denim brand DUER Performance is opening their second retail location along the iconic Queen St W. in Toronto.\nFrom Friday through Sunday, the first 25 people to enter our store will receive FREE pants! Yes. That's right. FREE.\n..."},{"title":"Ekstasis: Lost Ancient Wisdom, Mystery Rites and Flow States","date":"2019-04-05T23:30:00.000Z","endTime":"2019-04-06T01:30:00.000Z","location":"Alternity","description":"There is a growing cloud of anxiety and disconnection from the natural order of things that hangs over the shiny consumerist veneer of our modern secular age.\nAnd it begs the question… why are we experiencing such an epidemic of anxiety in one of the richest a..."},{"title":"ENSO Showcase 2019","date":"2019-04-05T23:00:00.000Z","endTime":"2019-04-06T03:00:00.000Z","location":"Bonafide","description":"ENSO Showcase 2019 is a student-organized event from Ryerson University that showcases the work and performances of young Asian creatives in the local community. ENSO Showcase is built on providing an inclusive platform where Asian-identifying individuals can ..."},{"title":"Family Shabbat Dinner","date":"2019-04-05T21:30:00.000Z","endTime":"2019-04-05T23:30:00.000Z","location":"Makom: Creative Downtwon Judaism","description":"Parents, grandparents & kids!\nJoin us for a fun evening, meet other downtown families, and welcome Shabbat together.\nFamily members of ALL backgrounds, faiths, orientations, and genders ARE WELCOME!\n5:30 Gather\n5:45 Story, short song-filled service & game\n6:30..."},{"title":"Frankenhooker Unicorn Fear is Free Fridays","date":"2019-04-06T00:45:00.000Z","endTime":"2019-04-05T05:45:00.000Z","location":"Kingsway Theatre BAR - The Last Independent","description":"Frankenhooker Unicorn Fear is Free Fridays. All ROCKin' with NO revisionist talkin'. Watch movies the way they were meant to be seen! On the BIG SCREEN and in the BIG FRIGHTFUL SOUND.\nFun starts 8:45 pm Friday. Admission is FREE and everyone is welcome.\n1. Fra..."},{"title":"FridaysforFuture April 5 Climatestrike","date":"2019-04-05T16:30:00.000Z","endTime":"2019-04-05T18:00:00.000Z","location":"Queen's Park, Toronto, ON M5S, Canada","description":"Friday, April 5, 2019 at 12:30 PM – 2 PM"},{"title":"Garage Baby and Giraffe","date":"2019-04-05T23:30:00.000Z","endTime":"2019-04-06T01:30:00.000Z","location":"Painted Lady","description":"Garage Baby continues it's monthly puck-rock residency with special musical mayhem guests; Giraffe."},{"title":"Garters of the Galaxy Vol.2: A Marvel Burlesque Parody","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T03:00:00.000Z","location":"The Great Hall","description":"Peepshow ASSvengers Assemble!\nJoin the Marvel Burlesque Universe as your favourite characters are reimagined by PeepshowTO in a truly epic burlesque parody that is sure to leave you hulking and levitating out of your seat.\nAssemble your team and watch villains..."},{"title":"Global Boogie Banquet","date":"2019-04-06T02:00:00.000Z","endTime":"2019-04-05T06:00:00.000Z","location":"Handlebar","description":"Get lit on the dance floor with old and new grooves from around the globe with DJ Oreku. Free entry."},{"title":"Hot Brown Honey","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"St. Lawrence Centre for the Arts","description":"For the Game Changers, Myth Slayers, Poets, Movers, Music Makers, Ground Breakers, Truth Sayers, Shake em up Women, Queens, Queers and Risk Takers!\nHot Brown Honey turns up the heat, delivering lashings of sass and a hot pinch of empowerment in the smash-hit t..."},{"title":"Hot Damn its a Queer Slam","date":"2019-04-05T23:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"Buddies In Bad Times Theatre","description":"THIS IS IT! The Championships! All year we've been traveling our show to towns, cities and hamlets to find the best in 2SLGBPTIPIA+ voices. We cannot wait to see who wins the grand prize of a trip to Capturing Fire Slam, the International Queer Summit & Slam i..."},{"title":"How To Beat Up Any Man","date":"2019-04-06T02:00:00.000Z","endTime":"2019-04-06T03:15:00.000Z","location":"JCB Theatre - Second City","description":"Comedian and writer Carol Zoccoli (Winnipeg Comedy Festival, The Debaters, Comedy Central Brazil) tell us how it was like growing up as a woman in Brazil - and her story is told through the men she’s beaten up. How To Beat Up Any Man is a funny and raw tale of..."},{"title":"Kickass Study Strategies for Math & Science! FOR KIDS WITH LDs","date":"2019-04-05T20:30:00.000Z","endTime":"2019-04-05T22:00:00.000Z","location":"The Math Guru","description":"Doing well on a test isn’t just about knowing course content - it’s about developing kickass study skills! This study strategy workshop will provide an overview of all the super important aspects of studying - from getting organized, to taking notes, to rememb..."},{"title":"Kitchen Stuff Plus Warehouse Sale","date":"2019-04-05T18:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"Kitchen Stuff Plus Warehouse","description":"Kitchen Stuff Plus is hosting a  warehouse sale this April 2019 in Toronto.\nScore up to 90% off furniture and cookware from Cuisinart, Henckel, Kitchen Aid, Umbra, Hamilton, Starfrit, Harman, Oster and more."},{"title":"Millennial Falcon","date":"2019-04-06T02:00:00.000Z","endTime":"2019-04-05T06:30:00.000Z","location":"The Boat","description":"DJs Shandy & Keith (P-P-Party, Yacht Rock, Dance Armstrong, The Groove Stew) have gathered the galaxy's best tunes of the new millennium to force your feet to dance! NO COVER BEFORE 11.\nOUTKAST BEYONCE ALICIA KEYS JAY Z KANYE SNOOP MADONNA LCD SOUNDSYSTEM AKON..."},{"title":"MLSE Foundation Game Changers Championship Gala","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-05T05:00:00.000Z","location":"Berkeley Church","description":"MLSE Foundation Game Changers proudly presents Championship Gala 2019 in support of MLSE Foundation and MLSE LaunchPad.\nChampionship Gala (formerly known as Toronto Plays) will be hosted in the beautiful Berkeley Church on Friday, April 5, 2019. Come celebrate..."},{"title":"\"MOMENTOS\" Photography Exhibit","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T01:00:00.000Z","location":"El Almacen","description":"Solo exhibition by Afro Latino photographer, Carlos Scott Wilson. Showcasing a glimpse into his unique view of the world with local and international shots. Intermingling woodwork and wax with his creative style of photography. Free to attend. Opening event on..."},{"title":"Neo Waistland","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-05T22:00:00.000Z","location":"227 Sterling Rd","description":"Neo Waistland is a contemporary pop-up shop bringing forth revolutionary thoughts and creations. Join us on a three day exclusive experience of local Fashion, Music, Art & Food.\nThe masterful DJ nomad nala will be spinning opening night April the 5th from 8pm ..."},{"title":"New Exhibition by Katie Bond Pretti","date":"2019-04-05T22:00:00.000Z","endTime":"2019-04-06T01:00:00.000Z","location":"Barbara Edwards Contemporary","description":"April 5 - May 18\nOpening Reception: Friday, April 5 6-9pm\nExploring synaesthetic translations of the otherworldly and unknown, her works draw inspiration from personal vision quests and sensations of being under surveillance––varied experiences that, collectiv..."},{"title":"No Box For Me. An Intersex Story","date":"2019-04-05T22:30:00.000Z","endTime":"2019-04-05T23:30:00.000Z","location":"TIFF Bell Lightbox","description":"M is 27 years old. Deborah is 25. Both are living in bodies that Western medicine — and often society — deems too taboo to discuss publicly. This beautifully crafted, poetic documentary from Swiss director Floriane Devigne joins these and other brave young peo..."},{"title":"Om Dar-B-Dar Film Screening","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"The Royal Cinema","description":"\"Om Dar-B-Dar\" directed by Kamal Swaroop in 1988 is the first screening in a new South Asian film series at The Royal Cinema. The film, an underground cult classic was chosen for it's experimental, non-linear narrative, it has been described as the antithesis ..."},{"title":"Opening Party Reception: The Art of Abstraction","date":"2019-04-05T23:00:00.000Z","endTime":"2019-04-06T01:00:00.000Z","location":"Winged Canvas Art Hub","description":"Opening Night Party: Fri Apr 5 | 7 - 9 pm (wine & cheese)\nOpening Reception: Sat Apr 6 | 1 - 3pm (family friendly)\nVibrant colours, bold brushstrokes and different perspectives abound in this exhibit. Abstract art inspires our imaginations and sparks our curio..."},{"title":"PAINT PUFF PASS","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"Nameless","description":"Come enjoy the coolest thing since sliced bread.\nIts like Paint Night but like way better.\nExplore the creative side you didn't know you had.\nExpect to indulging in delicious treats, refreshing beverages all while laughing and creating with like minded locals ..."},{"title":"P A R T Y T O W N: April Shower Beer, Bro!","date":"2019-04-06T03:00:00.000Z","endTime":"2019-04-05T04:00:00.000Z","location":"Comedy Bar","description":">>Grab some buds and come celebrate that spring cleaning with PARTYTOWN at the best P A R T Y in town.<<\nThis Canadian comedy award winning show features comedians from Second City, Bad Dog Theatre, and the CBC. Enjoy a high-octane night of comedy made up on t..."},{"title":"Paul Cafcae & The 20 Flight Rockers","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T03:59:00.000Z","location":"The Cavern Bar","description":"20 Flight Rockers is Ontario’s most ambitious rock ’n’ roll party band.\nWe play a diverse repertoire of highly recognizable dance songs from 1950’s to 2010’s as well as original music delivered in an original rockabilly-themed live show, with the flavour of bl..."},{"title":"Phile Magazine x Untitled: HEAVY LOAD w/ Boris - Berghain - Ostgut","date":"2019-04-06T03:00:00.000Z","endTime":"2019-04-05T10:00:00.000Z","location":"500 Keele","description":"Phile Magazine & Untitled present HEAVY LOAD feat. The Canadian Debut of Boris\nDJs:\nxx Boris [Berghain / Panorama Bar | Ostgut Ton] xx\nKnown for spinning marathons and being one of Berghain's main residents... Boris [Ostgut Ton] really is the master of all gen..."},{"title":"Possibilities of Dialogue","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-05T18:00:00.000Z","location":"Toronto Centre for the Arts","description":"April 05 - April 07, 2019 8pm - Apr 5 and 6, 2pm - Apr 7\nFee: Standard ticket $28.25, Senior/Student/Arts Worker ticket $18.75\nCo-created and performed by TOES FOR DANCE Co-Director David Norsworthy and NYC-based dance artist Marielis Garcia, Possibilities of ..."},{"title":"Practically Petty, Canada's Top Tribute to Tom Petty Live at Drums N Flats","date":"2019-04-06T01:00:00.000Z","endTime":"2019-04-05T04:30:00.000Z","location":"Drums N Flats","description":"Practically Petty always deliver a fantastic night of Tom Petty Music that makes you HAPPY! Canada's Top Tom Petty Band have been paying homage to one of rock's most beloved singer, song writers, the late great Tom Petty.\nThis show will sell out, so don't wait..."},{"title":"QUEER POP: LGBTQ Music & Arts Festival","date":"2019-04-06T02:00:00.000Z","endTime":"2019-04-05T07:00:00.000Z","location":"Club 120","description":"\"QUEER POP: LGBTQ+ Music & Arts Festival\" comes back for a second year and she's BIGGER & QUEERER than ever!\nAMAZING performances from this year's lineup as well as SEXY dancing from our HOT male/female GoGo Dancers with some of today's top DJ's playing the be..."},{"title":"Roby Lakatos","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T02:00:00.000Z","location":"Koerner Hall","description":"Virtuoso fiddler Roby Lakatos is a scorching player and a musician of extraordinary stylistic versatility. Born into the legendary family of Roma violinists, Lakatos is equally comfortable performing classical, jazz, and Hungarian folk music."},{"title":"Roncesvalles United 17th Annual Wine & Cheese Gala","date":"2019-04-05T22:00:00.000Z","endTime":"2019-04-06T03:00:00.000Z","location":"Roncesvalles United Chruch","description":"Join us for our Annual Wine & Cheese Gala, featuring live entertainment,provided by comedian Carolyn Bennett and world class Jazz musicians, Paul Goudy Jazz Quintet. Enjoy a live auction featuring a professional auctioneer, a silent auction featuring many amaz..."},{"title":"Shiraz: A Romance of India","date":"2019-04-05T23:00:00.000Z","endTime":"2019-04-06T01:00:00.000Z","location":"Revue Cinema","description":"Toronto Silent Film Festival opening night. Canadian premiere of the BFI restoration. World Premiere of a new score, composed and performed by Ensemble Polaris\nOne of the Crown Jewels of early Indian filmmaking up on the big screen.\nBased on the immortal 17th ..."},{"title":"SOUL FLOWER with DJ General Eclectic","date":"2019-04-06T02:00:00.000Z","endTime":"2019-04-05T06:00:00.000Z","location":"Swan Dive","description":"Expertly selected Classic Psych, Soul & Rock tunes to make your Friday Night!"},{"title":"Spring Mystic Pop-Up Shop","date":"2019-04-05T22:00:00.000Z","endTime":"2019-04-06T01:00:00.000Z","location":"Inner Arts Collective","description":"Celebrate the New Moon with us! Come to the first annual Spring Mystic Pop Up Shop at the Inner Arts Collective!\nGet a reading from a gifted local diviner, purchase some magical jewelry for yourself or a loved one, discover how to increase your energy and well..."},{"title":"Taoist Tai Chi Open House: Free class April 5 at Knox Presbyterian Church","date":"2019-04-05T13:30:00.000Z","endTime":"2019-04-05T15:30:00.000Z","location":"Knox Presbyterian Church (please ring at back door on north side)","description":"Join us and try Taoist Tai Chi. Gentle movements promote well-being for people of all ages and in all conditions. They also serve as a moving meditation that reduces stress and provides a way to cultivate body and mind."},{"title":"The Invisibles","date":"2019-04-05T22:30:00.000Z","endTime":"2019-04-06T00:30:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"In 1943, Joseph Goebbels declared Berlin “free of Jews.” Though he did come markedly close to his goal, some 1,700 endured in secret. This gripping docu-drama traces the astonishingly-true stories of four young survivors who learned that sometimes the best pla..."},{"title":"The Liveable City?: Work","date":"2019-04-05T23:00:00.000Z","endTime":"2019-04-06T00:30:00.000Z","location":"Art Gallery of Ontario","description":"As Impressionism in the Age of Industry takes viewers on a journey through a period of immense change in 19th century Paris, we invite speakers across various disciplines to enter into conversations around urgent issues facing Toronto today: work, affordable h..."},{"title":"The Period Purse's Spring Blitz","date":"2019-04-05T04:00:00.000Z","endTime":"2019-04-06T03:59:00.000Z","location":"Multiple Venues","description":"The Period Purse is a volunteer-run non-profit organization that strives to achieve menstrual equity by providing marginalized menstruators with access to free menstrual products, and to reduce the stigma surrounding periods through public education and advoca..."},{"title":"TIFF: Carmine Street Guitars","date":"2019-04-06T00:30:00.000Z","endTime":"2019-04-06T02:30:00.000Z","location":"TIFF Bell Lightbox","description":"Director Ron Mann joins us for an introduction and post-screening Q&A; on Friday, April 5 at 8:30pm!\nRick Kelly has been making custom guitars at his Greenwich Village shop for decades, using preserved and repurposed wood scavenged from historic New York build..."},{"title":"Violin Virtuoso Zoltan Maga","date":"2019-04-06T00:00:00.000Z","endTime":"2019-04-06T02:30:00.000Z","location":"Roy Thomson Hall","description":"Dazzling music is brought to life through the flair and passion of Hungary’s preeminent violin virtuoso, Zoltán Mága and his fiery orchestra: the Budapest Gypsy Virtuosi. After touring five continents and nearly 100 countries, Zoltán is returning to North Amer..."},{"title":"Where Does This Disco with DJ Digits","date":"2019-04-06T01:30:00.000Z","endTime":"2019-04-05T06:00:00.000Z","location":"Farside","description":"No cover! Fun, silly, and strange pop transmissions received from an alternate-dimension Earth. Mutant disco, Italo, electronic indie pop, psych-pop, and unusual cover versions selected by DJ Digits.\nfeaturing the sounds of:\nSt Etienne\nMylene Farmer\nElle Barba..."},{"title":"Women's Art Association of Canada presents B.A.S.H!","date":"2019-04-05T21:30:00.000Z","endTime":"2019-04-06T00:00:00.000Z","location":"Women's Art Association of Canada","description":"B.A.S.H. is presented by The Women’s Art Association of Canada to honour women in the arts who are over the age of 80.\nYou will see them at work sculpting, playing in the ukulele ladies band, and building a ceramic piece before your eyes! Join us in our lovely..."},{"title":"WONDERWALL","date":"2019-04-05T23:00:00.000Z","endTime":"2019-04-06T02:30:00.000Z","location":"Capital Espresso","description":"An Art Exhibit by an interracial couple exploring growth, publicly as individuals."},{"title":"CELEBRATION by Olivier Meyrou - YSL Documentary: The Canadian Premiere","date":"2019-04-06T20:00:00.000Z","endTime":"2019-04-06T22:00:00.000Z","location":"Fox Theatre","description":"Toronto based fashion events startup Archival Toronto is brining another exciting piece of fashion cinema to the city. After 12 years, Celebration by Olivier Meyrou will finally be making its Canadian premiere. ABOUT CELEBRATION by Olivier Meyrou Banned by Yve..."},{"title":"Chronologic","date":"2019-04-07T02:00:00.000Z","endTime":"2019-04-06T06:30:00.000Z","location":"The Garrison","description":"The famous Goin' Steady DJs return to The Garrison on:\n\r\nSATURDAY, APRIL 6, 2019 for...\n\r\n((( CHRONOLOGIC )))\n\r\na dance party through the ages.\n\r\nPop and Antipop from Since the End of History\n\r\ni.e. Music from 1890 to 2019, played in chronological order...\n\r\nT..."},{"title":"Designer Pop Up Sale","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Shine PR","description":"APRIL 6, 2019 | 11 AM - 5PM\nShine PR / Shine Influencers Office\r\n777 Richmond St W, Unit 2024\r\nToronto\n\n#SHOPMYEIVEY\r\nDESIGNER FASHION UP TO 90% OFF\n\r\nShop curated closets from Toronto’s finest sellers on Eivey and join the sustainable shopping movement at thi..."},{"title":"Olivia O'Brien","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-07T03:59:00.000Z","location":"Velvet Underground","description":"Doors: 7pm Show: 8pm This is a LEGAL AGE 19+ event.\n\r\nSale Dates and Times:\n\r\nPublic Onsale : Fri, 21 Dec 2018 at 10:00 AM\n\r\nLive Nation Presale / LEGAL AGE 19+ : Thu, 20 Dec 2018 at 10:00 AM Password: CHILL\n\r\nSpotify Presale / LEGAL AGE 19+ : Wed, 19 Dec 2018..."},{"title":"Slow Art Day 2019","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Multiple Venues","description":"It’s not what you look at that matters, it’s what you see.\r\nHenry David Thoreau\nSlow Art Day is a global event with a simple mission: help more people discover for themselves the joy of looking at and loving art.\nWhy slow?\nWhen people look slowly at a piece of..."},{"title":"The Geeky Craftorium","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-06T22:00:00.000Z","location":"See Scape","description":"See-Scape and Toronto Cemetery Tours bring you:\nThe Geeky Craftorium\nHandmade items to satisfy all your nerdy needs!!\nOn Saturday April 6th, both floors of See-Scape will be packed will local vendors selling you their crafty creations, all with a nerdy flair!\n..."},{"title":"Thorrablót 2019","date":"2019-04-06T22:00:00.000Z","endTime":"2019-04-07T01:00:00.000Z","location":"Latvian Canadian Cultural Centre","description":"Come and enjoy wonderful Icelandic food, musical entertainment, a chance to bid on lots of great items in our Silent Auction and Live Auction and be a part of the incredible camaraderie and fun of Þorrablót. You won’t want to miss this event. We always sell ou..."},{"title":"163 John St. : SATURDAY SHOWCASE @ THE CORNER","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-06T04:00:00.000Z","location":"The Corner","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nSATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna b..."},{"title":"2019- From drawing to Painting: Workshop 1 -Realistic Drawing","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"LucSculpture Art School","description":"In this series of 3 workshops, you will learn the basics of drawing, composition to create unique style and painting to finish the artworks.\nThe first workshop will focus on elements of drawing: Aspect of the Line and edges, using positive and negative shapes...."},{"title":"2019-Jewellery Making Workshop @ LucSculpture","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T16:00:00.000Z","location":"LucSculpture Art School","description":"Create your own wire art and jewellery in one weekend workshop! All materials are included, but if you have any of your favorite beads, you can bring them in! In this class, you will learn the skills to work with the wires, have an understanding of the differe..."},{"title":"5th Annual Rockin' For The Cure with I MOTHER EARTH","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-06T06:00:00.000Z","location":"Phoenix Concert Theatre","description":"BIG PARTY COMING!!!!!\nSaturday, April 6th/2019, we present our 5th Annual Rockin For The Cure Anniversary show with I Mother Earth live at the Phoenix Concert Theatre!\nTickets on sale now @ https://www.ticketscene.ca/events/22510"},{"title":"946 QUEEN ST. EAST : SATURDAY SHOWCASE @ THE CORNER EAST","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-06T04:00:00.000Z","location":"The Corner East","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nSATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna b..."},{"title":"After the Snow:  Etobicoke Centennial Choir's Spring concert","date":"2019-04-06T23:30:00.000Z","endTime":"2019-04-07T01:30:00.000Z","location":"Humber Valley United Church","description":"Etobicoke Centennial Choir (ECC) welcomes the rebirth of spring with a joyous concert of music that celebrates the wonder and diversity of creation. We will first melt away the winter blues with Antonin Dvorak’s lyrical Mass in D Major, a beautiful choral comp..."},{"title":"Akin Creative: Life Drawing at Allan Gardens Conservatory","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-06T18:00:00.000Z","location":"Allan Gardens Conservatory","description":"Calling all plant enthusiasts and artists! Join us on Saturday, April 6th from 12-2pm for life drawing at Allan Gardens Park and Conservatory. We will meet at 12pm at the building's front entrance.\nFREE! Open / Drop In (no registration required)\nHaving trouble..."},{"title":"Albanian Film Association Comedy Fundraiser","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-07T02:30:00.000Z","location":"Blua","description":"The Albanian Film Association is putting on a comedy fundraiser show! And you don’t need to be an Albo either, to have a good laugh!\nHosted by:\nBorana Makri & Nora Marku\nAnd featuring a line up of Toronto’s finest comics who have appeared on CBC, Just For Laug..."},{"title":"Awkward Easter Pet Photos","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"Pet Uno","description":"Let's face it: this Easter, you're probably going to put bunny ears on your pets anyway. You might as well capture the moment in an awkward photoshoot for charity!\nFor a $25 donation to Fetch & Releash, you and your pet will get:\n🐰 A 5-minute private photosho..."},{"title":"Best Of: A Stand Up Comedy Showcase","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-07T00:30:00.000Z","location":"Comedy Bar","description":"'The Best Of' returns with an allstar lineup of the countries top stand up comedians. Featuring: Todd Graham(CBC The Debators), Hisham Kelati(JFL42), Sandra Battaglini(Just For Laughs) Rebecca Reeds (Winnipeg Comedy Gala), and Faisal Butt(Canada's Top Comic). ..."},{"title":"Breaking the Cycle 2019","date":"2019-04-06T22:00:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"Hart House at University of Toronto","description":"UNITY Charity Chapters presents the 15th Annual Breaking the Cycle event!\nThis year we’re changing it up with a 7 to Smoke breakdance battle, artist showcases, and an art gallery, for the first time in Breaking the Cycle history!\nTell a friend to bring a frien..."},{"title":"Break Up With Your Bag","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T22:00:00.000Z","location":"Timbuk2","description":"For the past 13 years we have been helping reduce, reuse, repair, recycle and re-imagine all Timbuk2 products by helping place gently used bags in the hands of those who need them, and reducing the amount of bags that end up in landfills.\nSo this weekend come ..."},{"title":"Calligraphy Workshop","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"Queen Gallery","description":"Grab your ink and reed pens!\nPrepare your paper!\nRoll up your sleeves!\nIt’s calligraphy time!\nJoin us on April 6th (7-9 pm) for our third Calligraphy workshop with Tina Rouhandeh. Our highly popular workshop will teach you how to prepare your reed pen, hold th..."},{"title":"Canada's Finest","date":"2019-04-07T01:00:00.000Z","endTime":"2019-04-07T02:30:00.000Z","location":"Comedy Bar","description":"Empire Comedy Live presents a celebration of some of Canada's very finest stand ups!\nFeaturing\nKate Davis, Nile Seguin, & Graham Chittenden\n$15 at the door or online\nhttps://comedybar.ca/show.php?Event_ID=11803"},{"title":"Canyun, Lava Lava, Beams, Naomi Floods","date":"2019-04-07T01:00:00.000Z","endTime":"2019-04-06T05:00:00.000Z","location":"Handlebar","description":"In celebration of our new release 'Leaving Hollowland,' we will be playing some music with some of our favourite music people at one of our favourite music places. Peep the deets...\n👽🤖👽🤖👽🤖👽😽👽🤖👽🤖👽🤖👽🤖👽\nNaomi Floods - Freak-folk looper\n👽\nhttps:/..."},{"title":"Cocktails and Brushstrokes Paint and Sip","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T01:30:00.000Z","location":"Lindy Hop Revolution","description":"BYOB Nude Male Model Painting Experience! This is not your typical flowers or landscape painting class, you'll be painting a LIVE NUDE male model. Our models are professionals who will be posing as you paint their exquisite bodies. This is for a fun girls nigh..."},{"title":"Code Samurai Spring 2019 Hackathon","date":"2019-04-06T13:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Pierre Elliott Trudeau High School","description":"Turing Fusion Labs is a Canadian Not for Profit Company whose mandate is to inspire young people to explore the world of technology and coding.\nWe are hosting a “Hackathon” for people aged 10-15 years old, called Code\nSamurai on April 6th 2019 at Pierre Elliot..."},{"title":"Comedy for Dummies - FREE COMEDY","date":"2019-04-06T22:00:00.000Z","endTime":"2019-04-07T00:00:00.000Z","location":"The Piston","description":"A FREE monthly stand-up comedy show featuring some of Toronto's best comics! Hosted by Carolina DG and DJ'd by Mark Gonzaga (Beam Me Up Disco)! This month we welcome headliner Ben Miner (SiriusXM)! Lotto spots also offered to comics vying for stage time!"},{"title":"Curious Minds x Suresh Doss: A Taste of the Sri Lankan Diaspora","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T17:00:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"**FINAL COURSE**\nToronto's Sri Lankan community has had an extraordinary impact on the city's dining scene over the last 30 years. Drawing on some of his most popular CBC food reports, and his own roots, Suresh will celebrate the second generation Sri Lankan c..."},{"title":"Deer Me! Recognizing Wildlife as Individuals - Free Talk and Tour","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T17:00:00.000Z","location":"Centre for Urban Ecology, Humber Arboretum","description":"Get ready for National Wildlife Week in Canada with this free exploration of white-tailed deer at the Humber Arboretum.\nFirst, join Humber College Sustainability Research Analyst Farheen Kadwa for a talk on her B.Sc thesis project. For years, researchers have ..."},{"title":"DIALOGUE 2019 - CARRY ON!","date":"2019-04-06T13:00:00.000Z","endTime":"2019-04-06T23:00:00.000Z","location":"St. Patrick's Catholic Church","description":"Dialogue 2019 is an opportunity for Young Adults (age 18-39)\nand Redemptorist Priests to gather and “Dialogue”\nabout real issues that are faced in life, faith and culture.\nAs a young adult, you have a unique perspective that we want to hear!\nDo you need to be ..."},{"title":"Discover The 6: High Park","date":"2019-04-06T15:45:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"High Park Club","description":"Discover The 6: High Park\nGet active. \nGet social. \nGet to know your city. \nDiscover The 6 is a scavenger-hunt/race style event.\nParticipants will work in teams of 4-6 (complete with fun team names and themed costumes) to discover clues, solve puzzles, and com..."},{"title":"Drunken Cinema: Road House - 30th Anniversary Screening!","date":"2019-04-07T01:30:00.000Z","endTime":"2019-04-07T03:59:00.000Z","location":"Revue Cinema","description":"*BACK BY POPULAR DEMAND! Revue Cinema partners with Drunken Cinema to screen one of the craziest bar-room brawling films ever made!\nPain don’t hurt…and neither does enjoying a drinking game to one of the greatest action films of all time with a great crowd! Dr..."},{"title":"Easter Eggstravanganza at the Toronto Humane Society!","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Toronto Humane Society","description":"On Saturday, April 6th the Toronto Humane Society will be hosting an Easter Eggstravaganza at their shelter. There will be 3 yoga classes to choose from, you can stretch and relax while enjoying our hoppy friends. Children as young as 5 can participate, but th..."},{"title":"FAETE: Rites Of Spring Fetish Dance Party","date":"2019-04-07T02:00:00.000Z","endTime":"2019-04-06T07:00:00.000Z","location":"Remix Lounge","description":"Sat April 6 - FAETE @ Remix Lounge\nCome out to experience the fun, the music, and the magic of the popular fetish event. It's your Faete.\nDJ's Lazarus, Prospero, and Hangman will having you dancing all night.\nSpring is coming! Join us to celebrate the return o..."},{"title":"Friends in Art and Life","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Heliconian Hall","description":"Join three friends Susan Power, Kye Marshall and Catherine Maunsell at their shared art show. The three of them have followed different paths to the visual arts but as members of the Toronto Heliconian Club and as long time friends,they have come together to s..."},{"title":"Funny People","date":"2019-04-07T01:30:00.000Z","endTime":"2019-04-07T03:00:00.000Z","location":"Theatre Centre Cafe","description":"Funny People produced and hosted by Anasimone George is BACK! Now at the Theatre Centre Cafe. Featuring: Desiree Walsh, Nikki Yee, Asaf Gerchek, Anubha Momin, and headlined by: Joe Vu!"},{"title":"Get Crafty with the Easter Bunny","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T17:00:00.000Z","location":"Cloverdale Mall","description":"Bring the family and join us as we welcome the Easter Bunny to Cloverdale. Craft your very own Easter wreath* to take home.\n*One craft activity per child, while supplies last. Located near Laura Secord."},{"title":"Ghost Fleet","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-07T00:30:00.000Z","location":"TIFF Bell Lightbox","description":"People normally think of slavery as a part of history. But in the global fishing industry, a modern form of slavery takes place far out at sea where no one can bear witness. Ghost Fleet follows a Thai human rights activist, Patima Tungpuchayakul, who has led a..."},{"title":"Good and Gooder Makers Craft Market - Spring 2019","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"The Assembly Hall","description":"A fun, modern maker’s market featuring a curated selection of local makers selling handmade goods. Featuring 30+ artisans, makers, and small shop owners from all over the GTA and surrounding areas. Live music by Brent Miller Live.\nApril 6 2019 10AM-3PM\nThe Ass..."},{"title":"GRAND CANYON Grand Opening Fete!","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-06T06:00:00.000Z","location":"GRAND CANYON","description":"Blood Pact Theatre, in association with The Storefront Arts Initiative, proudly unveils their brand-new venue: GRAND CANYON, and is celebrating with a Grand Opening Fête! This is a FREE EVENT and open invitation to the entire community to meet and mingle, whil..."},{"title":"Hedwig and the Angry Inch","date":"2019-04-07T01:30:00.000Z","endTime":"2019-04-06T04:30:00.000Z","location":"TIFF Bell Lightbox","description":"Sing out. Rock out. Wig out. 🤘\n\r\nHedwig recounts their transformation from Hansel, a boy from former East Germany, to their current female persona, and their ongoing pursuit of their former protégé and ex-lover Tommy Gnosis, who has become a hugely successful..."},{"title":"In Ascend: Michael Adamson & Nicole Katsuras","date":"2019-04-06T20:00:00.000Z","endTime":"2019-04-06T23:00:00.000Z","location":"SAMARA Contemporary","description":"SAMARA Contemporary is pleased to present In Ascend, a new exhibition of paintings by Toronto-based artists Michael Adamson and Nicole Katsuras, curated by Rafi Ghanaghounian. Adamson and Katsuras explore the depths of abstraction within their respective bodie..."},{"title":"Jane's Party Album Release Show at The Horseshoe Tavern w/ Side Hustle","date":"2019-04-07T01:00:00.000Z","endTime":"2019-04-07T03:30:00.000Z","location":"The Horseshoe Tavern","description":"Though they’ve been playing together since 2006, the members of Toronto-based pop-rock quartet Jane’s Party - Devon Richardson, Tom Ionescu, Jeff Giles, and Zach Sutton – feel like they’re just starting to gather steam.\nReady to take off after years roving Tor..."},{"title":"Jazz & Reflection: The Barry Livingston Group","date":"2019-04-06T20:30:00.000Z","endTime":"2019-04-06T21:15:00.000Z","location":"Beach United Church","description":"Add some music to your Saturday afternoon at Jazz & Reflection, featuring amazing music by the Barry Livingston Group:\nBarry Livingston - piano, compositions\nColleen Allen - soprano saxophone, flute\nSuba Sankaran - voice\nKobi Hass - bass\nPaul Fitterer - drums\n..."},{"title":"Jests in Time","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"Alliance Francaise de Toronto","description":"No matter who we are or where we come from, we all love to laugh. For centuries, we have revelled in the humour of light-hearted jests and gags as vehicles to express our amusement and joy. But what happens when comedy takes a dark turn – when we use humour to..."},{"title":"Keep The Faith - Bon Jovi Tribute Live at Drums N Flats","date":"2019-04-07T01:30:00.000Z","endTime":"2019-04-06T04:30:00.000Z","location":"Drums N Flats","description":"Keep the Faith are Canada's Premiere Tribute to Rock and Roll Hall of Fame Inductees BON JOVI!\nA non-stop hit parade of Bon Jovi Music all night long, performed by incredibly talented musicians who share a passion for recreating the ultimate Bon Jovi Concert E..."},{"title":"Krystal Beth/Spacelord/Conan Troutman/The Damnations/TopzZ","date":"2019-04-07T01:00:00.000Z","endTime":"2019-04-06T08:00:00.000Z","location":"Bovine Sex Club","description":"Music for the Masses Presents - 4am last call - Sat Apr 6 at The Bovine\n- Krystal Beth performing the music of Kiss (Featuring members of Indian Handcrafts)\n- Spacelord performing the music of Monster Magnet\n- Conan Troutman performing the music of Kyuss\n- The..."},{"title":"Landscape Design Class","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Design Department","description":"Meredyth Hilton knows gardens – she’s green and gifted! Plus, she’s an excellent teacher. You can learn from today’s hottest garden expert and, in a five week course, prepare your own landscape design!\nThis five week course is fun, and enables students to expl..."},{"title":"Learn to play Australian Rules Football with the Toronto Dingos FC","date":"2019-04-06T18:15:00.000Z","endTime":"2019-04-06T20:30:00.000Z","location":"Ballsports Polson Pier","description":"Want to play the best sport in the world? Learn the fast paced sport of Australian rules football with the Toronto Dingos AFL Football Club. No previous experience necessary! Come on down to join us for a kick if you are interested in learning a new sport whil..."},{"title":"Literally Dead Comedy","date":"2019-04-06T22:30:00.000Z","endTime":"2019-04-07T00:30:00.000Z","location":"Comedy Bar","description":"A comedy show featuring Toronto's top comedians! Prizes to be won from Greenhouse Juice and Yoga Tree!"},{"title":"Lou-Lou's Flower Truck 2019 Opening Weekend","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"Multiple Venues","description":"The first weekend of 2019 for Lou-Lou's Flower Truck, selling beautiful blooms on the streets of Toronto from a 1966 pickup truck.\nSaturday, APRIL 6: Yorkville \r\nSunday, APRIL 7: Rosedale"},{"title":"Mindfulness through Art","date":"2019-04-06T13:30:00.000Z","endTime":"2019-04-06T15:30:00.000Z","location":"Sketch @ Artscape Youngplace","description":"Be a part of this formative workshop held in the beautiful Artscape Youngplace building. Your child will be introduced to mindfulness practices and indulge in creative self-expression in an exuberant art studio experience!\nFor more info and to register, click ..."},{"title":"Money Management for Kids","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T16:00:00.000Z","location":"Jones Library","description":"Meet expert Maya Corbic for a workshop on financial literacy and management for parents and children. Suited for parents and older, school-age children."},{"title":"Monkey Toast: The Improvised Talk Show - April Edition","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"Social Capital Theatre","description":"We hope that you'll join us for our April show as we welcome special guests, from the hit CBC Podcast, The Secret Life of Canada, Leah-Simone Bowen and from The Nation Post and CBC's At Issue, journalist, Andrew Coyne!\nMonkey Toast is a six-time Canadian Comed..."},{"title":"Murder at the ROM Scavenger Hunt","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T19:30:00.000Z","location":"Royal Ontario Museum","description":"A curator has been murdered and a trail of clues left behind, connected to secrets in the collections. As you solve clues, you’ll begin to piece together a tale of greed, lust, pride and revenge. There are multiple suspects, one victim and you, the sleuths, mu..."},{"title":"Neilson Park Creative Centre's Spring Handmade Art and Fine Craft Sale","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Neilson Park Creative Centre","description":"Visit NPCC’s Handmade Spring 2019 sale! The sale is from 10 am to 4 pm. Shop directly from local artists and artisans for fine arts and crafts. Demonstrations by artists in our six resident art groups in painting, quilting, rug crafting, spinning and weaving, ..."},{"title":"Oculus Go Hackathon 2019","date":"2019-04-06T12:00:00.000Z","endTime":"2019-04-07T00:00:00.000Z","location":"Lighthouse Labs","description":"Aquent DEV6 and Facebook Developer Circles - Toronto will be hosting an Oculus Hackathon on April 6, 2019 at Lighthouse Labs Toronto! The day will begin at 8AM and end at 8PM. Get your team together and join us for a fun day of learning, competition, and netwo..."},{"title":"\"OFF THE BEATEN PATH\" solo exhibition by photographic artist LORI RYERSON","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Urban Gallery","description":"Thurs.April 4 to Sat.April 27, 2019\n\"My photography is usually the result of serendipity. I look for an alignment of things that convey a story, for the narrative in abandoned urban landscapes. I try to capture what silence looks like. These are the stories I ..."},{"title":"Perfect 10 Presents: Saturday At Comedy Bar - April 6th","date":"2019-04-06T14:30:00.000Z","endTime":"2019-04-06T04:30:00.000Z","location":"Comedy Bar","description":"‘Saturday At Comedy Bar’ returns April 6th. With humble beginnings in 2008 'Perfect 10 Comedy' has just celebrated their 10 Years at the famed Comedy Bar with some of Canada's Funniest Pro Comedians!\nONLY $10 ($15 door)\nhttps://comedybar.ca/show.php?Event_ID=1..."},{"title":"Primitive Power Training GRAND OPENING","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T22:00:00.000Z","location":"Primitive Power Training","description":"Whether you’re looking to evolve or just looking for a Saturday plan - stop by Primitive Power Training on Saturday to learn about why we’re the best muscle gain / toning personal training studio in Vaughan and enjoy all the extra amenities. Hope to see you th..."},{"title":"Rock for Venezuela","date":"2019-04-06T22:00:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"Sneaky Dee's","description":"A charity show benefitting @venezolanosplv who are providing crucial help with the humanitarian crisis in Venezuela.\nFeaturing .carbonated., Gelax, People Walking By and Kobura\nPresented by A-Minor\nTickets $12 door/ $10 advance here: https://bit.ly/2Tsd8xx\nDoo..."},{"title":"Sash & Bustle Annual Accessory Event!","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Sash and Bustle","description":"At this one day only event, S&B; will be transformed in to a magical accessory land! From veils to jewelry, shoes to boleros, flowers crowns to hair pieces, we will have everything your heart desires. All items will be 10% off at this event! Everyone is welcom..."},{"title":"Saturday Family Clay","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"LucSculpture School & Studios","description":"Every Saturday is a family art day at LucSculpture. Call us and book a spot for your family and friends to make clay sculpture and hand built ceramics. We will fire the clay pieces for you! Reunite the family doing art and it is fun for everyone!\nTime: Every S..."},{"title":"Shane Pendergast Plays The Local","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"The Local","description":"Singer-songwriter Shane Pendergast of Prince Edward Island will play two sets of original and traditional maritime folk music from 2-4 PM on April 6th."},{"title":"Sheldon Holder Live w/ AFO at Alchemy Food and Drink","date":"2019-04-07T02:00:00.000Z","endTime":"2019-04-06T06:00:00.000Z","location":"Alchemy Food & Drink","description":"The Band will be playing from 10 pm onward. We will play 3 sets for the night. We play until last orders!\nNo cover.\nKitchen open 12PM - 12AM"},{"title":"SHINE Gentle Yoga in Nature at Kortright","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T15:00:00.000Z","location":"Kortright Centre for Conservation","description":"This program is ideal for seniors and older adults: a fun and gentle yoga practice that honours where your body is today and helps to mold it for tomorrow.\nOur Gentle Yoga series is designed specifically for those individuals who want to improve their activity..."},{"title":"Slay! A Murder Mystery with Drag Queens - Our 2 Year Anniversary show!","date":"2019-04-07T03:00:00.000Z","endTime":"2019-04-07T03:59:00.000Z","location":"Bad Dog Comedy Theatre","description":"It's our two year anniversary! So... we go back to where it all started, when a \"Mayor got Murdered!\"\nLast year we revisited the sleepy town a year later, and ANOTHER mayor got murdered!\nThis year, the election for mayor is on again... and it's not looking goo..."},{"title":"Slow Art Day","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Onsite Gallery","description":"Onsite Gallery is pleased to participate in the annual international event, Slow Art Day.\nEvery hour on the hour (12:00 p.m., 1:00 p.m., 2:00 p.m., 3:00 p.m. and 4:00 p.m.), one artwork in our current exhibition, How to Breathe Forever, will be selected for fo..."},{"title":"Slow Art Day 2019","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"Power Plant","description":"Slow Art Day is a global event with a simple mission: Help more people discover for themselves the joy of looking at and loving art.\n\r\nHeld each year on the second Saturday in April, Slow Art Day has more than 100 institutions participating around the world, e..."},{"title":"Slow Art Day 2019","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Hart House","description":"Slow Art Day is a global event with a simple mission: help more people discover for themselves the joy of looking at and loving art.\nFor Slow Art Day, we are hosting group activities for you to engage with the Hart House Permanent Collection. All activities ar..."},{"title":"Slow Art Day - Tour with Lisa Steele","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"InterAccess","description":"How can slow viewership apply to the experience of time-based media? Join artist Lisa Steele for a slow viewing of Daniel Young & Christian Giroux’s exhibition Film Path / Camera Path with under-titles. Steele will lead a critical and durational viewing of the..."},{"title":"SolidColour Spring Show","date":"2019-04-06T12:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Peter Mackendrick Gallery","description":"Join local abstract landscape artists Karen Taylor, Lisa Hickey and Kate Taylor for the SolidColour Spring Show at Wychwood Barns.\nAs always, there will be art to suit all sizes of wall (and wallet), painting demonstrations, and of course, cookies.\nPeter Macke..."},{"title":"Sophisticated Funk","date":"2019-04-07T02:00:00.000Z","endTime":"2019-04-06T06:00:00.000Z","location":"Farside","description":"No cover! Joining the musical dots - soul, hip-hop, house, latin, electronica, jazz and beyond all on vinyl."},{"title":"Spring-Bazaar - the Danish way","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T18:30:00.000Z","location":"The Danish Lutheran Church","description":"Come and experience a unique Danish Bazaar, that offers:\nReal Danish Smørrebrød (1000 open sandwiches are served)\nBig Silent Auction\nBake Booth and Delicatessen\nImported Danish Goods & Candy\nJewellery Booth\nDanish Needlework\nTombola, White Elephant\nEaster deco..."},{"title":"Spring Breakaway Ice Hockey Tournament","date":"2019-04-06T13:00:00.000Z","endTime":"2019-04-06T23:00:00.000Z","location":"Canlan Ice Sports","description":"WHAT:\n5 on 5 Ice Hockey Tournament. All games will be refereed. All teams play a minimum of 3 games (12-15-15 run-time). Potential to play more based on tournament record. This is a 2 day tournament. All teams will play games on both Saturday and Sunday.\nSKILL..."},{"title":"Spring Celebration of Sales Event - FREE ADMISSION","date":"2019-04-06T13:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"ETOBICOKE OLYMPIUM","description":"Spring is in the air and so are red hot deals. Over 30 local vendors with items for everyone. Access to 2nd floor by elevator. Tons of great items. FREE admission and tons of FREE parking\nHope to see you there!"},{"title":"Spring has sprung at Hillcrest with Spring Sweets Pop-up Market","date":"2019-04-06T13:30:00.000Z","endTime":"2019-04-07T01:00:00.000Z","location":"Hillcrest - Centre Court","description":"Hillcrest’s Centre Court will blossom into a spring spectacle on April 6 and 7 with its Spring Sweets pop-up market. It will feature 12 food vendors providing visitors with a sweet experience. Vendors include All you Knead, Paletta America, Vapz Tastebudz, Ros..."},{"title":"Spring Tune-Up Football Tournament","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-07T00:00:00.000Z","location":"Varsity Stadium","description":"WHAT:\nSTU is a 5 on 5 turf Flag Football Tournament. This is a co-ed tournament (minimum of 2 of each gender on the field at all times). All teams play a minimum of 4 x 30 minute games. Games will be self-officiated like all SSC league games.\nThis tournament i..."},{"title":"Spring Tune-Up Ultimate Tournament","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-07T00:00:00.000Z","location":"Varsity Stadium","description":"WHAT:\nSTU is a 4 on 4 Ultimate Speedpoint Tournament. This is a co-ed tournament (minimum of two 2 of each gender on the field at all times). All teams play 4 x 30 minute games. Like all TSSC Leagues, this tournament is self-officiated.\nThis tournament is bein..."},{"title":"Teen Volunteer and Job Fair","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Don Mills Library","description":"Find out about volunteer and job opportunities. Talk to representatives from local agencies and learn how you can make a difference. Discover ways you can earn your community service hours, get a part-time job or summer employment.\nPlease call 416-395-5710 to ..."},{"title":"THE 4TH OF ITS KIND SPRING FLING CRAFT AND FOODIE AFFAIR","date":"2019-04-06T13:30:00.000Z","endTime":"2019-04-06T18:30:00.000Z","location":"Legion Hall 11","description":"Free. Not for profit community event.\n50 vendors. Food and craft. Free gift for the first 300.\nGrand prizes, giveaways. Parking. ATM. WIFI.\n700 expected."},{"title":"The Baby Show","date":"2019-04-06T13:00:00.000Z","endTime":"2019-04-06T22:00:00.000Z","location":"Enercare Centre, Exhibition Place, Toronto","description":"Find everything pregnancy, baby and toddler for the modern parent at Toronto’s premium early parenting show. The Baby Show features workshops, seminars and demos from Canada’s leading parenting experts. Shop products from top brands as well as local and handma..."},{"title":"THE GROOVE with Brother Wayne","date":"2019-04-07T02:00:00.000Z","endTime":"2019-04-06T06:00:00.000Z","location":"Swan Dive","description":"🎶Motown🎶Soul🎶Rock🎶Pop🎶\nCome get yer groove on!\n*FREE*"},{"title":"The Red Nose Cabaret","date":"2019-04-07T00:30:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"Sweet Action Theatre","description":"The Red Nose Cabaret returns on Saturday, April 6th for our season 3 finale with your hosts, Philip & Lucinda!\nHelp us warm our new home at Sweet Action Theatre located at Artscape Youngplace (180 Shaw Street - Unit #106)\nDoors: 8:00pm\nShow 8:30-10:00pm\n$15.00..."},{"title":"The Song Shul's Shabbat Hachodesh","date":"2019-04-06T13:00:00.000Z","endTime":"2019-04-06T15:30:00.000Z","location":"Bialik Hebrew Day School","description":"The Song Shul's Parshat Tazria — SHABBAT HACHODESH\nNo registration/ticket required to attend this service.\nCantor Simon Spiro and the amazing Toronto Festival Singers begin the month of Nissan with the most superb a cappella Shabbat morning music. There is no ..."},{"title":"The Strokes Dance Party","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T06:00:00.000Z","location":"Sneaky Dee's","description":"THE STROKES DANCE PARTY\n\r\nDust off that leather jacket and mess up your hair, it’s time to go party like the cool kids at our The Strokes dance party! We’ll be playing all the dance-rock tracks to take you back to those hazy neon nights behind the bar back in ..."},{"title":"The Temptress","date":"2019-04-06T20:15:00.000Z","endTime":"2019-04-06T22:00:00.000Z","location":"Revue Cinema","description":"Toronto Silent Film Festival presents The Temptress 1926\nA director once said of Garbo that she had a rapport with an audience…that she could let them know she was thinking things, and thinking them uncensored. The Temptress shows us that even at the young age..."},{"title":"The ThrowDown Dance Convention","date":"2019-04-06T14:30:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Toronto Centre for the Arts","description":"UrbanArts presents the ‘ThrowDown’ Dance Convention– a 1-day annual urban dance platform aimed at promoting the importance of accessible and inclusive dance programs, highlighting the importance of physical literacy, offering new and exciting opportunities for..."},{"title":"TIFF: Sgaawaay K'uuna, Edge of the Knife","date":"2019-04-06T19:30:00.000Z","endTime":"2019-04-06T22:00:00.000Z","location":"TIFF Bell Lightbox","description":"Co-director Gwaai Edenshaw joins us for an introduction and post-screening Q&A; on Saturday, April 6 at 3:30pm!\nArriving more than a century after British Columbia's first-ever feature film, In the Land of the Head Hunters — Edward S. Curtis' controversial but..."},{"title":"Todd Graham Live Comedy","date":"2019-04-07T01:30:00.000Z","endTime":"2019-04-07T03:00:00.000Z","location":"The Underground Cafe","description":"Join us Saturday Apr 6 for a hilarious stand-up comedy show with the only and only Todd Graham!\nDoors open 8:30, showtime is 9:30, just $15 admission!\nAdv tix here: https://www.universe.com/events/todd-graham-live-comedy-tickets-toronto-7JGSM6\nTodd Graham has ..."},{"title":"Tommy Thompson Park Hike","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Donlands station","description":"Hey folks! Wild Ones Wilderness is going on another hike on Saturday April 6th. Where we are meeting is at Donlands Subway Station at 12:00pm and will be taking the 83 bus to Leslie & Commissioner St and we will be hiking Tommy Thompson Park. With the summer w..."},{"title":"Toronto Lit Up: How to Become an Accidental Genius","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Mabel's Fables Children's Bookstore","description":"Join Orca Book Publishers and the Toronto International Festival of Authors in celebrating the release of Elizabeth MacLeod and Frieda Wishinsky’s How to Become an Accidental Genius through Toronto Lit Up!\nPrizes, fun and stories. Refreshments will be served. ..."},{"title":"Use Nature to Support Well-Being at Toronto Botanical Garden","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Toronto Botanical Garden","description":"Many people face challenges such as stress, anxiety and trauma that can degrade their quality of life. Horticultural therapy supports emotional wellness and provides a catalyst for meaningful change. This indoor/outdoor workshop invites participants to explore..."},{"title":"Vienna Boys Choir","date":"2019-04-06T19:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Koerner Hall","description":"The “breathtaking” choir is “totally disciplined voices tempered by a singular sense of ease and consistency” (Washington Post).  The Vienna Boys Choir has delighted music lovers for six centuries with their purity of tone, charm, and crowd-pleasing repertoire..."},{"title":"Visionville Warehouse Sale","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Visionville Optical Lab","description":"Designer demo and secondhand eyewear in excellent condition, at warehouse prices!\n\r\nMajor fashion branded frames and sunglasses starting at $29\n\r\nON SITE ~ prescription Rx lenses starting from $39\n\r\nWe are located in North York near Sheppard West Station: 3975..."},{"title":"VOICES IN VERSE II","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"Agincourt Library","description":"Join the Scarborough Poetry Club for VOICES IN VERSE II: Celebrating Nature with poetry for National Poetry Month 2019"},{"title":"When Stan Met Ollie-Shorts Programme","date":"2019-04-06T17:30:00.000Z","endTime":"2019-04-06T19:30:00.000Z","location":"Revue Cinema","description":"Toronto Silent Film Festival presents: 1000 Laffs Comedy Shorts Programme\nBefore there was even a first “another nice mess”, Stan Laurel and Oliver Hardy each spent a decade as cinematic soloists until destiny (with a little help from the Hal Roach Studios) un..."},{"title":"With It 60s Mod Soul Record Dance Party","date":"2019-04-07T02:00:00.000Z","endTime":"2019-04-06T06:30:00.000Z","location":"The Piston","description":"Monthly all vinyl record dance party\n60s Mod Soul R&B; R&R; Garage Beat Surf Funk\nGuest DJs from Toronto, New York, Montreal, Ottawa\nDJ Nico + Guest DJs\nSponsors: Kops Records\n10pm, $10, 19+\nfacebook.com/getwithitparty"},{"title":"Women of Comedy","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T01:15:00.000Z","location":"Social Capital Theatre","description":"Comedy Nuggets brings you a professional line up of women stand-up comedians, including: Hannah Lawrence (Edinburgh Fringe Festival, NXNE Festival) Moniquea Marion (Toronto Sketch Fest, Toronto Fringe, Big City Improv Festival) Ashley Cooper (JFL42, Brantford ..."},{"title":"Women Own Your Badassery: Design Your Path To Success & Fulfillment","date":"2019-04-06T12:30:00.000Z","endTime":"2019-04-06T08:00:00.000Z","location":"CSI Annex","description":"This full-day workshop is designed for women only who are professional, in a leadership role, business owners or aspiring leaders.\nAn essential part of growth is shedding the weight collected when we begin to carry things we are convinced are necessary to our ..."},{"title":"Middleditch and Schwartz in Toronto","date":"2019-04-07T23:30:00.000Z","endTime":"2019-04-08T03:59:00.000Z","location":"The Danforth Music Hall","description":"Comedians Thomas Middleditch from Silicon Valley and Ben Schwartz of Parks and Recreation have teamed up for a hilarious evening of laughs as they drop by Toronto for the night. All Ages Event  Doors - 5:30pm Sale Dates and Times: Public Onsale : Fri, 14 D..."},{"title":"Toronto Art Crawl SPRING POP UP","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"The Great Hall","description":"Ring in Spring at the Toronto Art Crawl SPRING POP UP, taking place at The Great Hall, Sunday April 7th, 2019!\n- Shop directly from the hands of 50 SUPER talented local artists and designers,\n- Choose from original art, fashion, jewelry, home decor, vintage, p..."},{"title":"163 John St. : THE DANGER ROOM @ THE CORNER","date":"2019-04-08T01:00:00.000Z","endTime":"2019-04-07T04:00:00.000Z","location":"The Corner","description":"THE DANGER ROOM\nHOSTS: DAN GUIRY & MORGAN O'SHEA\n'The Danger Room' is marathon style show with a variety of professional and amateur comedians testing their most dangerous and explicit material. Audience members are encouraged to boo and heckle comedians durin..."},{"title":"2019-Intuitive Art Workshop","date":"2019-04-07T17:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Luc Sculpture","description":"Unleash your creativity! Let go of your mind and create something uniquely our own. Natasha will lead you through some warmups and visualizations to awaken your senses and then you will immerse yourself in painting. This will be a safe and supportive environme..."},{"title":"2019 Swimming Trials Afterparty","date":"2019-04-08T02:30:00.000Z","endTime":"2019-04-07T06:00:00.000Z","location":"Tequila Jacks","description":"Hey Torontonians,\nThis year the Canadian Swimming Nationals will be held here in Toronto and you know what that means?\nA massive party afterwards!!! Come get down with world class athletes and Olympians 🎉\nWe are going to be hosting an Afterparty at Tequila Ja..."},{"title":"946 QUEEN ST. EAST : SUNDAY BEST @ THE CORNER EAST","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-07T04:00:00.000Z","location":"The Corner East","description":"Every Sunday at The Corner Comedy Club EAST, TAMARA SHEVON will be hosting SUNDAY BEST! A lineup of Canada’s best comedians.\nThere's gonna be 2 shows, 8PM & 10PM, each with a different set of comics. Credits include Just For Laughs, JFL 42, CBC, Comedy Network..."},{"title":"AMAZE - a night of magic and mystery featuring The Sentimentalists","date":"2019-04-07T23:30:00.000Z","endTime":"2019-04-08T02:30:00.000Z","location":"The Rec Room","description":"Welcome to Amaze - the first magic and mentalism night at The Rec Room of its kind. Join world-renowned mentalists The Sentimentalists, stars and foolers of Penn & Teller’s Fool Us, accompanied by the up-and-coming duo of Beyond Mental Borders, and The Wandere..."},{"title":"And a Scotch Egg - Magic, Monsters, & The Occult","date":"2019-04-07T23:00:00.000Z","endTime":"2019-04-08T00:30:00.000Z","location":"Comedy Bar","description":"And a Scotch Egg is everything you love about British comedy panel shows, brought to you live on stage at Comedy Bar!\nThis month Team Cultist will face off against Team Cryptid in a battle of wit and wisdom to see who gets to bring about the end of the world! ..."},{"title":"Aries New Moon Cacao Ceremony Soundbath Meditation","date":"2019-04-07T23:30:00.000Z","endTime":"2019-04-08T02:00:00.000Z","location":"The House of Yoga","description":"Let us journey into a night of Sacred Cacao, Sound Healing and intentional meditation as we work with the energy of the New Moon in Aries and plant our seeds for the coming lunar cycle.\nNew moons are potent times to shed the old, plant seeds of the new and man..."},{"title":"Arts & Culture Volunteer Fair","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T19:00:00.000Z","location":"Harbourfront Centre","description":"Interested in volunteering? Join us to learn about arts and cultural organizations looking for people just like YOU!\nAre you interested in building your resume, creating professional contacts or meeting new & interesting people? Then volunteering within Toront..."},{"title":"Beaches Life 2nd Annual Wellness & Beauty Show","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Ashbridge's Bay Yacht Club","description":"Come and meet local business owners face-to-face, discover the wide range of Wellness & Beauty products they offer and get a personal consultation.\nThe Event features live demonstrations and fashion shows. Free admission. Free parking."},{"title":"Between Worlds","date":"2019-04-07T18:00:00.000Z","endTime":"2019-04-07T19:30:00.000Z","location":"Innis Town Hall","description":"Presented by Toronto Jewish Film Society.\nA quiet understated Israeli drama that challenges our notions of faith, truth, understanding and, possibly, acceptance. Tickets: $15, $10 for ages 18-35."},{"title":"Black Sheep Comedy's Stand Up @ People's Pint Brewing Company, April Edition","date":"2019-04-07T23:00:00.000Z","endTime":"2019-04-08T01:30:00.000Z","location":"People's Pint Brewing Company","description":"Join Black Sheep Comedy @ People's Pint for the best stand-up comedy show and craft beer in The Junction!\nSip a complimentary 12oz beer while watching an insanely talented lineup.\nHeadliner Jeff Elliott! As seen on CBC’s Winnipeg andHalifax Comedy Festivals, I..."},{"title":"Celebrate your love with Toronto Bridal Brunch","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T19:00:00.000Z","location":"The Globe and Mail Centre","description":"Celebrate your love with your #bridalsquad at Toronto’s one of a kind luxury bridal show and brunch. Join us on Sunday, April 7th, 2019 at The Globe and Mail Centre from 10 a.m. to 3 p.m. for an unforgettable day of mingling, brunching, and celebratory snapsho..."},{"title":"Colin Fowlie - Party Music Release show","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T03:00:00.000Z","location":"Painted Lady","description":"Colin is releasing his full length album \"party music'! Colin strives for lyrical depth and compelling stories in his songs, fusing elements of folk, rock, blues, and Americana/Canadiana.\nBrooklyn Doran at 8:00 PM\nClaire Coupland Music at 9:PM\nColin Fowlie at ..."},{"title":"Dinosaurs for Grown-Ups","date":"2019-04-07T14:30:00.000Z","endTime":"2019-04-07T19:30:00.000Z","location":"ROM","description":"Do you ever feel like the kids in your life know more about T. rex and Triceratops than you do? Discover the basics of dinosaurs, evolution, and fossils with ROM Educator Kelly Hodgins in this full-day workshop where you will explore the James and Louise Temer..."},{"title":"Diverse Dishes","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-08T01:00:00.000Z","location":"Kitchen 24","description":"Diverse Dishes is a cooking event, hosting unique cooking classes in Toronto. The event will take place on April 7th, 2019 at Kitchen 24 in North York, Toronto. This event is for those who are curious about cooking and always strive to learn more about what co..."},{"title":"DIY Natural Deodorant Workshop by Make This Universe","date":"2019-04-07T16:00:00.000Z","endTime":"2019-04-07T19:00:00.000Z","location":"Milk Glass Co.","description":"Ever wanted to make your own DIY Skincare products at home, but not sure where to start? Trying to transition to a Zero Waste lifestyle by creating your own natural deodorant, but can't find the right ingredients? Or, are you just tired of trying natural deodo..."},{"title":"Douglas Fairbanks: When the Clouds Roll By","date":"2019-04-07T19:15:00.000Z","endTime":"2019-04-07T21:30:00.000Z","location":"Royal Cinema","description":"Toronto Silent Film Festival -Day 3\nIt's the 100th anniversary of the founding of United Artists so a celebration of one of the founders, Douglas Fairbanks is in order!\nWe’re all familiar with the classic image of Douglas Fairbanks as the swashbuckling hero of..."},{"title":"Etobicoke Beer Run","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Big Rock Brewery","description":"WHEN DOES THE EVENT START?\n\r\nCome join us for a pre-race warmup at 11:00am but the first wave pre-party starts at 11:10am!\n\r\nWHERE DO I START THIS BEER RUN THING?!\n\r\nDon’t worry we got you covered! Put it into your GPS so you can get there on time! Yeah!\n\r\nBig..."},{"title":"in/progress magazine launch","date":"2019-04-07T19:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"University College","description":"Join us for the launch of in/progress, an arts-literary based magazine. Our magazine is a platform for sharing creative narratives. Through artworks, poetry, and short-story, we explore our current expressions of art-making and reveal the unique memories, hist..."},{"title":"JARRED DUNN: The Art of the Piano","date":"2019-04-07T23:30:00.000Z","endTime":"2019-04-08T01:30:00.000Z","location":"Gallery 345","description":"The Art of the Piano: Jarred Dunn\nSunday, April 7, 2019 at 7:30 pm\nTickets: $25/$10 Student (Cash only at the door)\nReserve tickets at info@gallery345.com\nPurchase advance tickets on Eventbrite\nProgram\nBeethoven Sonata Op. 110\nChopin Nocturne Op. 48 nr. 1\nChop..."},{"title":"Job search workshop","date":"2019-04-07T16:30:00.000Z","endTime":"2019-04-07T17:45:00.000Z","location":"Make Lemonade","description":"Learn how to connect to your dream job and stop dreading Mondays! Workshop will take place at Make Lemonade - 326 Adelaide St W on Sunday, April 7th 2019 at 12:30pm. Buy your tickets here: https://www.eventbrite.ca/e/job-search-workshop-tickets-58617457393"},{"title":"Jodhpur Kingdom: Gender, Class and Caste","date":"2019-04-07T14:30:00.000Z","endTime":"2019-04-07T19:30:00.000Z","location":"ROM","description":"Examine the socio-cultural realities of gender, class and caste depicted in the spectacular royal arts of Jodhpur, Rajasthan. From gendered architecture and elaborate furniture to textiles and jewellery, find out who would have made and used these objects. How..."},{"title":"Kids Workshop: Italian Easter Bread Making","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T15:30:00.000Z","location":"Cucinato Studio","description":"Easter egg painting, bread to take home, hot chocolate and LOTS of fun!!\nYour little chef will learn how to make their very own traditional Italian Easter Bread!\nAlso known as Pane di Pasqua, this fluffy and eggy bread is served during Easter time in Italian c..."},{"title":"LEGENDS OF TIME: Exhibition and Sale of Paintings By Oleh Nedoshytko","date":"2019-04-07T18:30:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Taras Shevchenko Museum","description":"The Taras Shevchenko Museum is pleased to announce Legends of Time –an exhibition and sale of paintings by the Ukrainian artist, Oleh Nedoshytko, who will introduce over 20 of his recent works. Opening with a reception on Sunday, April 7, 2019 from 2:30 to 5:3..."},{"title":"National Initiative for Eating Disorders 7th Annual Honouring the Journey Event","date":"2019-04-07T19:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"Adath Isreal Congregation","description":"Join NIED for our 7th Annual 'Honouring the Journey' event. This event is dedicated to inspiring, honouring, commemorating, and celebrating caregivers. Our panel of caregivers will share their experiences of grappling, wrestling, caring, and loving their loved..."},{"title":"Nite Comfort: Syngja, Spectral Tambours","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T03:30:00.000Z","location":"Handlebar","description":"This episode brings an exciting visit from Montréalers Syngja, and a beautiful new ambient percussion/concrete project from Robin Buckley and Jakob Thiesen, Spectral Tambours.\nSYNGJA 10pm\nExperimental and psychedelic, Syngja’s music is both haunting and timele..."},{"title":"Photography Workshop for Women","date":"2019-04-07T13:00:00.000Z","endTime":"2019-04-07T16:00:00.000Z","location":"Lovt Studio","description":"Do you have a camera and have no idea where to start? This workshop is an intensive on how to use your DSLR, designed for true beginners! So you shoot on Automatic, and want to learn how to use the Manual settings but feel overwhelmed on where to even start an..."},{"title":"Puppy Love Yoga","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T15:00:00.000Z","location":"The Redwood Studio","description":"It's Yoga with puppies! We provide the puppies and mats and you help socialize the little guys. Special GROUP DISCOUNT. Book at least 4 spots and enter code TEN at checkout for 10% OFF. Because puppies!"},{"title":"PupsYoga Classes","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T17:30:00.000Z","location":"PupsYoga Toronto","description":"Whether you’re a beginner or an experienced yogi, you’ll find our PupsYoga classes are the best way to relieve stress and get a dose of pure love from our little puppies.\nAn experienced instructor will guide you through a relaxing yoga session while our puppie..."},{"title":"Rayannah & Ponteix : Album Release","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T02:00:00.000Z","location":"Small World Music Centre","description":"Western Canadian francophone artists Rayannah (MB) and Ponteix (SK) will share three tour dates this spring to celebrate the release of their respective albums, “Nos repaires (Our Haunts)” and “Bastion”. The Trille Or-nominated acts will present their latest l..."},{"title":"Richard Goode","date":"2019-04-07T19:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"Koerner Hall","description":"“It is virtually impossible to walk away from one of Mr. Goode’s recitals without the sense of having gained some new insight, subtle or otherwise, into the works he played or about pianism itself.” (The New York Times) Richard Goode will perform an all Ludwig..."},{"title":"Sistema Spirit Gala","date":"2019-04-07T23:00:00.000Z","endTime":"2019-04-08T02:00:00.000Z","location":"The Spoke Club","description":"The Sistema Spirit Gala is a party and fundraiser featuring amazing live music from jazz and world musicians Neil Brathwaite and Ruth Mathiang. Ticket price includes music, food, and beverages and 100% of the proceeds support bringing more students into Sistem..."},{"title":"Skinner's Dress Suit","date":"2019-04-07T17:00:00.000Z","endTime":"2019-04-07T18:40:00.000Z","location":"Royal Cinema","description":"Toronto Silent Film Festival continues with the newly restored by Universal Pictures, this Rom-Com is a snappy comedy of errors, delightfully brimming with wit and sass that puts it right up there with the best. Reginald Denny & Laura La Plante richly deserved..."},{"title":"Spring has sprung at Hillcrest with Spring Sweets Pop-up Market","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T23:00:00.000Z","location":"Hillcrest - Centre Court","description":"Hillcrest’s Centre Court will blossom into a spring spectacle on April 6 and 7 with its Spring Sweets pop-up market. It will feature 12 food vendors providing visitors with a sweet experience. Vendors include All you Knead, Paletta America, Vapz Tastebudz, Ros..."},{"title":"Sweat & Sip  with Camp Fuel","date":"2019-04-07T18:30:00.000Z","endTime":"2019-04-07T20:30:00.000Z","location":"Elle Fitness","description":"Sweat, sip & be social! We'll Hiit it up with a super sweaty fitness class and then hang around after, get to know each other over beer provided by Glutenberg Beer & Temple Vodka.\nYour sweat session will be a full body workout. We'll bounce between strength tr..."},{"title":"Tassles & Tea: Create Your Own Pasties!","date":"2019-04-07T22:00:00.000Z","endTime":"2019-04-07T23:30:00.000Z","location":"Kink Toronto","description":"Interested in a crafternoon of breast positivity and sassy pasties? Get your craft on during this Make Your Own Nipple Pasties workshop.\nLuna Matatas will walk you through designing, creating and applying pasties. You'll make up to two pairs of pasties to take..."},{"title":"The Cleaners","date":"2019-04-07T20:00:00.000Z","endTime":"2019-04-07T21:30:00.000Z","location":"TIFF Bell Lightbox","description":"Viewers meet five “digital scavengers,” among thousands of people outsourced by Silicon Valley companies, whose job is to delete “inappropriate” web content. A typical cleaner must observe and rate thousands of often deeply disturbing images and videos every d..."},{"title":"The Femme! Experience","date":"2019-04-07T18:30:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Dancemakers","description":"House of Joy presents the Femme! Experience - a 90-minute fusion movement class.\n* Honour your sexy soulfulness\n* Unleash yourself to the sounds of live djembe drumming by Walter Maclean\n* Explore movement as a form of creativity, celebration, self-expression ..."},{"title":"The Song Shul's first Women's Seder","date":"2019-04-07T18:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Rinx Entertainment Centre","description":"The Song Shul's Women's Seder\nAliza Spiro leads Toronto’s first WOMEN’S SEDER, shining new light on the Pesach experience.\nNot a “Feminist Seder” — it’s a Women’s Seder! Song-filled and jam-packed with exciting insights about the contribution of women to the s..."},{"title":"Toronto Arrows Rugby Football Club's First Official Home Game","date":"2019-04-07T18:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"York Alumni Stadium","description":"The Toronto Arrows Rugby Club, Canada’s first professional rugby union team was added to Major League Rugby for the 2019 season. Come watch the Toronto Arrows first home game and cheer them on as they play against the Nola Gold Rugby team."},{"title":"Toronto Homeless Outreach","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T17:00:00.000Z","location":"Canadian Tire at Bay St and Dundas St W","description":"Rallying all citizens of Toronto! Have fun and help out Toronto's homeless while meeting like-minded Torontonians followed by a group lunch at Yonge and Dundas!\nWe will be meeting at Canadian Tire at 65 Dundas St W, at 11:00 AM on Sunday April 7 to purchase gi..."},{"title":"Toronto Lettering Crew 2019 Meetup","date":"2019-04-07T17:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Paper Plus Cloth","description":"Lettering Lovers! - Join us April 7th for the first TLC Meetup of the year!\nSpring is slowly making its way in and what better way to celebrate than a meetup with fellow creatives?\nWe are excited to be hosting TLC @torontoletteringcrew first meetup of the year..."},{"title":"Toronto R&b Sounds","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T03:00:00.000Z","location":"The Baby G","description":"Join us for a dreamy evening of rare, live performances from Toronto's rising R&B; artists at The Baby G.\nHere is what previous guests have had to say:\n\"It was such a beautiful and authentic experience. So inspiring to see all the talented singers/artist. Beyo..."},{"title":"Tristana & Ashtanga Yoga Fundamentals Workshop","date":"2019-04-07T05:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"The Basement Yoga & Fitness Studio","description":"Sunday, April 7, 1- 4pm\nTristana and Ashtanga Yoga Fundamentals Workshop with Mark Morra\nThe foundation of Ashtanga Yoga was described in Yoga Mala by PattabhiJois as Tristana: Breath, Asana, and Dristi. When practiced simultaneously, Ashtanga becomes a moving..."},{"title":"Unclutter Emotions with Master Teresa","date":"2019-04-07T18:00:00.000Z","endTime":"2019-04-07T19:30:00.000Z","location":"New Age Healing Centre","description":"Rare opportunity to experience group Chi healing with Master Teresa with over 20 years experience. She will demonstrate how to practice Chi Gong; how to project Chi and balance your emotions.\nShe has special ability to scan and read your from a distance. So th..."},{"title":"WrestleMania 35 Viewing Party with Dinner!","date":"2019-04-07T22:00:00.000Z","endTime":"2019-04-08T03:59:00.000Z","location":"Law Office of Caryma Sa'd","description":"Are you ready for the most important wrestling event of the year? Come join us at the Law Office of Caryma Sa’d Downtown Toronto. We are hosting a private event with DINNER\nBUFFET. (including non-alcoholic drinks)\nWrestleMania 35 will be the thirty-fifth annua..."},{"title":"Alternative Film Festival Spring Edition","date":"2019-04-08T22:30:00.000Z","endTime":"2019-04-08T23:30:00.000Z","location":"2469 Dundas St. West","description":"Jenell Diegor and Asian On A Mission Productions presents the Alternative Film Festival. Due to technical difficulties, we had to reschedule the original screening from March 18 to April 8. Please join us in watching Don't Feed These Animals, Cheetah, Rebel Wi..."},{"title":"Escape the Upside Down","date":"2019-04-08T23:00:00.000Z","endTime":"2019-04-09T03:00:00.000Z","location":"DevHub Toronto","description":"Ever wanted to experience the world of Stranger Things in real life? Now you can! On April 8th come to a one of a kind escape room event: “Escape The Upside Down”. In teams of 8, you will compete against other teams to see who can complete their escape room fi..."},{"title":"Fleetwood Mac in Toronto","date":"2019-04-09T00:00:00.000Z","endTime":"2019-04-09T03:59:00.000Z","location":"Scotiabank Arena","description":"Sale Dates and Times:\n\r\nPublic Onsale : Mon, 12 Nov 2018 at 10:00 AM\n\r\nA limited number of LaneOne VIP Packages will also be available, including amazing seats with premium benefits such as transportation, preferred entrance and more. https://www.laneone.com/e..."},{"title":"Trampoline Hall Monday April 8th Emily M. Keeler and Charles Yao Curate","date":"2019-04-08T23:40:00.000Z","endTime":"2019-04-09T02:40:00.000Z","location":"Garrison","description":"The next Trampoline Hall is on Monday, April 8th, 2019 at The Garrison.\nAll speakers chosen by Emily M. Keeler + Charles Yao.\nChantal Braganza - \"La Cucina Futurista\"\nLaura Fisher - The Porky Feast\nAnupa Mistry - The Bind\nSet by Ansel Schmidt & Nilou Ghaemi. T..."},{"title":"163 John St. : DO OR DIE OPEN MIC @ THE CORNER","date":"2019-04-09T00:00:00.000Z","endTime":"2019-04-09T03:00:00.000Z","location":"The Corner","description":"HOSTS: JOEY HARLEM & JEREMY DOBSKI\nThe Corner Comedy Club weekly Open Mic\nMonday Nights at 8PM - 11PM\nAmateurs, Pros and Room Regulars get up on stage and try out something new!\nDURATION: 180 MINUTES\n$5 TICKETS\nTICKETS AVAILABLE @ thecornercomedy.com\nSIGN UP E..."},{"title":"33rd Annual World Dentistry Summit","date":"2019-04-08T13:00:00.000Z","endTime":"2019-04-08T22:00:00.000Z","location":"Holiday Inn","description":"Welcome at the CDE & CPD accredited 33rd Annual World Dentistry Summit | April 08-09, 2019 | Toronto, Canada. The subject of the social occasion is around “Modern dental excellence with compassionate care\"and major highlights are Dentist, Dental, Scaling, Orth..."},{"title":"Affordable Improv for Newbies. Promise you'll leave with the BIGGEST smile","date":"2019-04-08T22:30:00.000Z","endTime":"2019-04-09T01:00:00.000Z","location":"CSI Annex","description":"You'll learn to let go and re-discover your playful and creative side\nIt's a chance to be a kid again from speaking gibberish to doing your best impression of your grandma.\nSpend a few hours with others in a safe space to gradually come out of your shell.\nNo p..."},{"title":"Barista Workshop and Introduction to Latte Art","date":"2019-04-08T22:30:00.000Z","endTime":"2019-04-09T00:30:00.000Z","location":"1690 Queen St W, Toronto, ON M6R 1B3, Canada","description":"Have you ever wished you could create gourmet coffee beverages like the Barista does at your local coffeehouse? This hands on tasting workshop will teach you the secrets to pulling the perfect shot of Espresso and techniques to help you create mouth watering m..."},{"title":"Boards & Beers Game Night","date":"2019-04-08T23:00:00.000Z","endTime":"2019-04-09T02:00:00.000Z","location":"Dominion Pub & Kitchen","description":"We are back at Dominion Pub and Kitchen on Queen East!\nIn fact we will be here the 2nd Monday every month.\nAs usual, we are bringing all the games and rules.\nCome learn new games and make new friends!\n$6 for unlimited play all night!\nDominion is providing us t..."},{"title":"Christine Jakel","date":"2019-04-09T00:00:00.000Z","endTime":"2019-04-09T02:00:00.000Z","location":"Painted Lady","description":"Christine Jakel brings her folk/alternative vibes to the Painted Lady. With songs ranging from tales of heartbreak to fun tunes that’ll have you snapping along, listeners can expect to be taken on a journey at her live show."},{"title":"Digital Psychology and Emotional Design Training Week","date":"2019-04-08T13:00:00.000Z","endTime":"2019-04-08T21:00:00.000Z","location":"193 Augusta Ave","description":"Upgrade your qualifications and skills, through a series of 3-workshops on how to apply psychology and emotional design neuroscience to websites, apps and digital campaigns.\nPractical design psychology\nOur training is science-based with a focus on practical ap..."},{"title":"DJ Jason Parker Quinton","date":"2019-04-09T00:00:00.000Z","endTime":"2019-04-09T03:59:00.000Z","location":"Handlebar","description":"No cover! $6 pint special.\nDJ Jason Parker Quinton presents a vinyl odyssey through the classics you rarely hear out, to the best songs of all time, all the while stoking the dancefloor and cultivating a vibe. Populist crowd pleasing musicology with a hip-hop ..."},{"title":"Focus Group","date":"2019-04-09T01:30:00.000Z","endTime":"2019-04-09T02:30:00.000Z","location":"Bad Dog Comedy Theatre","description":"Join some of Toronto's best improvisers as they watch the strangest, most unintentionally comedic videos the internet has to offer and turn them into the greatest, intentionally comedic scenes they have to offer!\nThis month's cast:\nLisa Amerongen! Conor Bradbu..."},{"title":"History on Film Series - Operation Finale - 2018 Movie","date":"2019-04-08T22:00:00.000Z","endTime":"2019-04-09T00:00:00.000Z","location":"Brentwood Library","description":"Director Chris Weitz's historical thriller is based on the story of how a group of Israeli secret agents arrested notorious SS officer Adolf Eichmann - the man who masterminded the \"Final Solution\" - in Argentina. Oscar Isaac plays the legendary Mossad agent P..."},{"title":"ICFF Youth Festival 2019","date":"2019-04-08T14:30:00.000Z","endTime":"2019-04-08T16:30:00.000Z","location":"TIFF Bell Lightbox","description":"The ICFF Youth program is aimed at students aged 8-18, and works in close collaboration with the Toronto Catholic District School Board (TCDSB) and York Catholic District School Board (YCDSB), inviting 4000 students from over 40 schools to see unique, challeng..."},{"title":"Imperfect Journey, part of the film series Resistance & Revolution: The Cinema of Haile Gerima","date":"2019-04-08T22:00:00.000Z","endTime":"2019-04-09T00:00:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Film\nImperfect Journey\nDir. Haile Gerima\n1994 | 88 min\nIn this BBC commissioned film, Haile Gerima and Polish journalist Ryszard Kapuscinski travel around Ethiopia talking to people about their political and psychic recovery of the Ethiopian people after the a..."},{"title":"Jeopardy Rejects Support Group - a trivia night","date":"2019-04-08T23:30:00.000Z","endTime":"2019-04-09T01:30:00.000Z","location":"Tequila Bookworm","description":"A theme-less trivia night for all the Jeopardy hopefuls out there. No cover, $6 Collingwood beer special and weekly prizes."},{"title":"Mental Health in the Black Community","date":"2019-04-08T09:00:00.000Z","endTime":"2019-04-08T23:00:00.000Z","location":"Mechanical Engineering Building","description":"The Black Medical Students Association Mental Health Series will be focusing on the social determinants of mental health in the Black Canadian population. Our speakers are highly qualified healthcare professionals and researchers with a great depth of knowledg..."},{"title":"Mixology and Bitters 101 at Toronto Botanical Garden","date":"2019-04-08T23:00:00.000Z","endTime":"2019-04-09T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Join Phil and Maria from Kinsip House of Fine Spirits as they walk you through basic techniques of mixology and bitters usage that will have you mixing up cocktails to impress your guests. Learn when to shake and when to stir and how to up your cocktail game!"},{"title":"Our2030: Pop-Up Lab","date":"2019-04-08T21:00:00.000Z","endTime":"2019-04-09T01:00:00.000Z","location":"Centre for Social Innovation - Regent Park","description":"Interested in tackling important social and environmental issues and preparing yourself for a career in the Age of Disruption? Are you working on a project or idea relating to the UN Sustainable Development Goals (SDG), and want to access resources to accelera..."},{"title":"Poetry Workshops","date":"2019-04-08T22:00:00.000Z","endTime":"2019-04-09T00:00:00.000Z","location":"House of Anansi Press","description":"April is National Poetry Month! To celebrate, we are hosting two poetry workshops at the Anansi Bookshop.\nThe workshops are for writers of all levels, from first-timers to seasoned artists. We will work with prompts to produce poetry to be shared and taken hom..."},{"title":"Steve Poudrier","date":"2019-04-08T23:00:00.000Z","endTime":"2019-04-08T06:00:00.000Z","location":"Wayla","description":"“Steve Poudrier, a Quebec-based artist launching his first art exhibition “Emotions” in Toronto”\nA formal launch of his exhibition will be held on 8th April 2019 ay WAYLA at\nand you can get a glimpse of Steve’s work at\nhttps://stevepoudrierartiste.com/"},{"title":"Wisdom At Work with Chip Conley - Presented in partnership with BoomersPlus","date":"2019-04-08T20:00:00.000Z","endTime":"2019-04-08T21:30:00.000Z","location":"Toronto Region Board of Trade","description":"Stepping down never means slowing down for Chip Conley. After selling his successful boutique hotel chain, Chip took on a mentorship role for the young founders of Airbnb. But as he helped grow the Silicon Valley start-up into a global tech leader, he learned ..."},{"title":"Ben & Jerry's Free Cone Day 2019","date":"2019-04-09T15:00:00.000Z","endTime":"2019-04-09T20:00:00.000Z","location":"Ryerson University","description":"Free Cone Day is coming on April 9th! Since 1979, it’s our way to celebrate and say thanks to our awesome fans for another year of support, and we've kept it up every year since, spreading the peace, love & FREE ice cream around the world! You'd better sta..."},{"title":"High Minded: Samsara","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T00:42:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"It’s legal now. A screening series for the high minded, featuring the biggest-thinking, most visually profound and psychedelic documentary cinema. A trance-inducing and visually intoxicating instant-classic, Samsara takes us to spiritual centres, industrial co..."},{"title":"Awaken Your Feminine Presence - A Workshop for Women","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T01:00:00.000Z","location":"Source Centre for Health & Wellness","description":"The Feminine is a source of Strength, Power, & Beauty.\nIn a world so badly and clearly out of balance, we need to make way for the presence of the Feminine in our lives. Many of us women are longing for this.\nAre you yearning, like me, for a world where the Fe..."},{"title":"Batsheva Dance Company - Venezuela","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-10T02:00:00.000Z","location":"Sony Centre for the Performing Arts","description":"Batsheva’s Ohad Naharin is known worldwide for his adventurous vision and distinctive choreographic voice. He is widely considered to be one of the great dance pioneers of his generation. Under Naharin’s direction for the past 27 years, Batsheva has become one..."},{"title":"Boneshaker Reading Series","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T00:30:00.000Z","location":"Bloor Gladstone Library","description":"Authors Michael Fraser and Lillian Necakov read from their work."},{"title":"CFE Film Series: Kanehsatake: 270 Years of Resistance","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T02:00:00.000Z","location":"Ryerson School of Image Arts","description":"Synopsis:\nIn July 1990, a dispute over a proposed golf course to be built on Kanien’kéhaka (Mohawk) lands in Oka, Quebec, set the stage for a historic confrontation that would grab international headlines and sear itself into the Canadian consciousness. Direct..."},{"title":"Copenhagen","date":"2019-04-09T23:30:00.000Z","endTime":"2019-04-10T01:30:00.000Z","location":"Young Centre for the Performing Arts","description":"Two tiny particles colliding can cause a nuclear reaction. It is 1941, nations race to perfect The Bomb, and two scientists meet in occupied Denmark for a conversation that will change the course of history. Michael Frayn (Noises Off, Democracy) invites us to ..."},{"title":"Dave Williams / Defying Limits","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T00:00:00.000Z","location":"North York Central Library Auditorium","description":"Meet astronaut Dave Williams, as he speaks on stage about his book, Defying Limits, and the challenges, surprises and unforgettable moments from his career as one of Canada’s most accomplished astronauts.\nIn Defying Limits, Dave shares the events that have def..."},{"title":"Film Screening: Yeh Freedom Life/This Freedom Life by Priya Sen","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T00:30:00.000Z","location":"Toronto Media Arts Centre","description":"SAVAC is pleased to invite you to attend the screening of Yeh Freedom Life/This Freedom Life, the latest film by Delhi-based filmmaker Priya Sen. Filmed over the course of a year in Ambedkar Nagar, a dense, largely working class area in South Delhi, Yeh Freedo..."},{"title":"Gay AF - LGBTQ Standup Comedy Show","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-10T01:15:00.000Z","location":"Comedy Bar","description":"Gay AF (Gay And Funny) is a monthly showcase for gay male comedians that puts the G in LGBTQ. Hosted and produced by Vong Show & Robert Watson, Gay AF is unapologetically gay and unapologetically funny. Gay AF takes place the second Tuesday of every month star..."},{"title":"Hot Breath Karaoke","date":"2019-04-10T01:00:00.000Z","endTime":"2019-04-09T06:00:00.000Z","location":"Handlebar","description":"No cover!\nToronto has no shortage of karaoke nights, but Hot Breath Karaoke is truly a standout. This cult transplant from London, England and has become one of the city's funnest Tuesday night parties and it's probably the only place you might find yourself s..."},{"title":"Intro to Google Analytics","date":"2019-04-09T17:00:00.000Z","endTime":"2019-04-09T20:00:00.000Z","location":"Camp Tech","description":"Want to know the secret to making your website better than your competition's? It's not the code, it's not your online marketing, it's not even your design. Successful businesses spend time analyzing their web traffic stats, sources, page performance and so mu..."},{"title":"Jewels of India - Designs for a Contemporary World","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T00:00:00.000Z","location":"Royal Ontario Museum","description":"Celebrate the rich history of adornment in India, and how these and traditional influences translate to modern South-Asian inspired jewelry design with award-winning designer Reena Ahluwalia. Explore the long history of jewellery design in India through the hi..."},{"title":"Lake Ontario Evening on Rouge National Urban Park","date":"2019-04-09T22:00:00.000Z","endTime":"2019-04-10T00:30:00.000Z","location":"Gladstone Ballroom","description":"A wilderness area in Canada’s largest urban center? That’s right! Only one hour from downtown Toronto, Rouge National Urban Park is an easily accessible wilderness get-away that encompasses wetlands, meadows, mature trees, and historic farms. Join us at this f..."},{"title":"Lee Airton on Gender: Your Guide: A Gender-Friendly Primer on What to Know, What to Say, and What to Do in the New Gender Culture","date":"2019-04-09T21:00:00.000Z","endTime":"2019-04-09T22:00:00.000Z","location":"Rotman School of Management","description":"Join Gender and the Economy Speaker Series at Rotman for a discussion on \"Your Guide: A Gender-Friendly Primer on What to Know, What to Say, and What to Do in the New Gender Culture\" (Adams Media, 2018)\nSPEAKER: Lee Airton, Assistant Professor - Gender and Sex..."},{"title":"Life Without Basketball","date":"2019-04-09T22:30:00.000Z","endTime":"2019-04-10T00:00:00.000Z","location":"TIFF Bell Lightbox","description":"Bilqis Abdul-Qaadir broke records and barriers on her way to becoming the first Division I basketball player to play wearing a hijab. When a controversial ban on religious headgear ends her chances at playing professionally, she is forced to re-examine her fai..."},{"title":"Marketing Hall of Legends: A Fireside Chat","date":"2019-04-09T21:30:00.000Z","endTime":"2019-04-10T00:30:00.000Z","location":"Revival","description":"The Marketing Hall of Legends was created to honour Canadians who have dedicated their lives to the pursuit of excellence in the field of marketing and to inspire and build marketing leaders as well as future legends. AMA Toronto is broadening the property to ..."},{"title":"Mind-Altering Film Screening & live talk with Jordan Peterson & Norman Doidge","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T01:30:00.000Z","location":"Isabel Bader Theatre","description":"Tickets: https://mailchi.mp/d3c603b1642b/film-talk-norman-doidge-jordan-peterson\nABOUT THE DIVIDED BRAIN DOCUMENTARY\nThe Divided Brain is a mind-altering wakeup call that challenges our understanding of how we see the world and ourselves. Renowned psychiatrist..."},{"title":"#MPAHT Presents: Chelsea's Story","date":"2019-04-09T22:00:00.000Z","endTime":"2019-04-10T01:00:00.000Z","location":"Westin Harbour Castle","description":"PLEASE JOIN US on Tuesday, April 9th, 2019 at The Westin Harbour Castle, Toronto for a powerful play based on the real experience related to Human Tracking of a 15-year old girl by Sean McGrath F.R.S.A. performed by JM Drama Alumn such as Abbi Longmire.\n📅: Tu..."},{"title":"No Worries Comedy Hour and a bit","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-10T01:30:00.000Z","location":"Duffy's Tavern","description":"Stand up comedy show with a dollop of Toronto’s favourite comedians and hosted by Australian comic Marcus Gomes. Every 2nd and 4th Tuesday of the month at Duffy’s tavern and it’s free (pwyc). Bring your friends, bring your parents, bring all your worries and h..."},{"title":"Pay What You Can't- A Davidson/Woods Spectacular","date":"2019-04-10T01:30:00.000Z","endTime":"2019-04-10T03:00:00.000Z","location":"Comedy Bar","description":"Well the Day of Finnish Language is coming on April 9th!!! And I for one am #firedup!! And as someone who's never been there nor do I speak the language, but do love me some Angry Birds (the movie not the game), I always celebrate. So I thought why not celebra..."},{"title":"Players' Championship - Pinty's Grand Slam of Curling","date":"2019-04-09T13:00:00.000Z","endTime":"2019-04-10T02:00:00.000Z","location":"Ryerson's Mattamy Athletic Centre","description":"The sixth event and final major of the Pinty’s Grand Slam of Curling season returns to Ryerson’s Mattamy Athletic Centre in Toronto running April 9-14, 2019. This marquee tournament features 12 of the top men’s teams and 12 of the top women’s teams from around..."},{"title":"PowerPoint Basics 2","date":"2019-04-09T17:00:00.000Z","endTime":"2019-04-09T19:00:00.000Z","location":"Brentwood Library","description":"Using PowerPoint 2013, learn how to add and edit tables, charts, SmartArt and more. Basic keyboarding and mouse skills required. Register in person at the Information Desk or by calling 416-394-5240."},{"title":"Self-Publishing: What You Need to Know","date":"2019-04-09T22:00:00.000Z","endTime":"2019-04-09T23:30:00.000Z","location":"Spadina Road Library - Toronto Public Library","description":"This seminar provides aspiring authors with the knowledge they need to successfully navigate the self-publishing world. Gain a solid foundation upon which to evaluate what is being offered, and the company offering it, to make informed decisions.\nWorkshop is r..."},{"title":"Stand Up, Stand Out! Relationship Marketing in the Digital World!","date":"2019-04-09T13:00:00.000Z","endTime":"2019-04-09T20:00:00.000Z","location":"Montgomery's Inn","description":"Women Disrupting Business Presents:\nStand Up, Stand Out!\nRelationship Marketing in a Digital World\nIf you want to build a thriving, sustainable business and get profitable results, you need to build relationships.\nIf you are an entrepreneur, speaker, trainer, ..."},{"title":"Swipe Right Night","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-09T04:00:00.000Z","location":"3030 Dundas West","description":"Join us for Toronto’s most interactive singles club night for young adults. At Swipe Right Night, spend a fun night mingling over DRINKS and APPETIZERS, GAMES, enjoy a hilarious COMEDIAN and then dance the night away to music from a top-40 DJ. We will also hav..."},{"title":"Tim Moxam Album Release w/ special guest Kelly Sloan","date":"2019-04-09T22:00:00.000Z","endTime":"2019-04-10T00:00:00.000Z","location":"Burdock","description":"Buy tickets: https://burdockto.com/shows/?show=1835\n$12 in advance, $15 at the door\nDoors at 6 p.m., Show at 6:30 p.m.\n// Tim Moxam\nTim Moxam’s quietly dazzling folk/pop practically begs for adjectives, that is until its mesmerizing mood takes hold. Then the o..."},{"title":"Tinder Tales Celebrates 100 Shows","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-10T02:00:00.000Z","location":"Gladstone Melody Bar","description":"Tinder Tales is celebrating its 100th Toronto show! Join us at our home base Gladstone Hotel for an evening of (real) ridiculous dating stories from Toronto storytellers and comedians. Hosted by Lori Lane Murphy with:\nMarito Lopez\nEmily Ferrier\nPatrick Fishman..."},{"title":"The Claypool Lennon Delirium","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T03:59:00.000Z","location":"The Danforth Music Hall","description":"19+ Event/Valid Photo ID Required Doors - 7:00pm Support: Uni Sale Dates and Times: Public Onsale : Fri, 14 Dec 2018 at 10:00 AM Embrace Presents Presale (19+) : Thu, 13 Dec 2018 at 10:00 AM VIP Package Presale : Wed, 12 Dec 2018 at 10:00 AM VIP Packa..."},{"title":"163 John St. : DIRTY WEDNESDAY @ THE CORNER","date":"2019-04-11T00:00:00.000Z","endTime":"2019-04-10T04:00:00.000Z","location":"The Corner","description":"A weekly showcase of some of the dirtiest/uncensored comics in Toronto & It's taking place at the newest, hottest comedy club, THE CORNER! Two shows NOW! @ 8 & 10 PM, comedians credits include Just For Laughs, JFL 42, CBC, Comedy Network + more. Everything Dir..."},{"title":"2019 Drop In Figure Drawing","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T01:30:00.000Z","location":"LucSculpture","description":"Come to LucSculpture on Wednesday night, 6:30 pm– 9:30 pm, for a drop-in figure drawing Toronto sessions! We have a different model each week and occationally a special costume event, too. Enjoy the relaxing atmosphere!\nDrop-in: $20, session passes (12 session..."},{"title":"946 QUEEN ST. EAST : THE RENEGADE SHOW @ THE CORNER EAST","date":"2019-04-11T00:00:00.000Z","endTime":"2019-04-10T04:00:00.000Z","location":"The Corner East","description":"Every Wednesday at The Corner Comedy Club EAST, the young killer Kyle Lucey will be hosting THE RENEGADE SHOW! A lineup of Canada’s best comedians showcasing dark and twisted material.\nFeaturing comedians from Just For Laughs, CBC, Sirius XM, and The Comedy Ne..."},{"title":"A Kink in the Relationship","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T01:30:00.000Z","location":"Good For Her","description":"Kinks and fetishes are a hard-wired part of some people’s sexuality, but what do you do when the person you are in a relationship with has sexual interests that deviate radically from yours? This workshop will address the challenges that couples face when one ..."},{"title":"Battle of the Bands TO","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-10T04:00:00.000Z","location":"Revival Bar","description":"Tickets are now on sale for Battle of the Bands TO, a 1-night fundraising competition, taking place Wednesday, April 10, 2019, at Revival Bar. Performing on the same stage that has welcomed artists such as Justin Timberlake, Black Eyed Peas, Kid Rock, Sara McL..."},{"title":"COLOURED BODIES:   MATERIAL MOVES by Dori Vanderheyden","date":"2019-04-10T16:00:00.000Z","endTime":"2019-04-10T22:00:00.000Z","location":"Propeller Art Gallery","description":"Dori Vanderheyden’s work layers and enfolds themes of sexuality, the body and colour as a way to evoke questions of what it means to be a human in the universe at this time. The evocative qualities of light emitting fluorescent plexiglass were considered as a ..."},{"title":"Cover Me Urban","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T02:00:00.000Z","location":"The Rec Room","description":"The neighbourhoods of Toronto come to life in an electric celebration of urban sights and sounds in support of the homeless youth at Youth Without Shelter (YWS). Enjoy street foods from around the world prepared by Toronto chefs, as well as wine, beer and stre..."},{"title":"Dante Matas and ZINNIA at Burdock","date":"2019-04-11T01:00:00.000Z","endTime":"2019-04-10T06:00:00.000Z","location":"Burdock","description":"Music starts at 9, $10 cover.\nDante Matas: Dante Matas and his band, The Infernal Racket, are an indie pop group from Toronto. In 2018 they released the album “A Colourful Headache” and toured the east coast of Canada. Live, they combine their melodic, hook-fi..."},{"title":"Draw by Night Toronto","date":"2019-04-10T23:30:00.000Z","endTime":"2019-04-11T03:00:00.000Z","location":"Station Bar & Kitchen","description":"Draw by Night is Toronto's biggest social drawing event and we're hosting a Brain Splittin' party! Come out and join other designers, illustrators and art enthusiasts for a night of drawing, drinks and games.\nYour ticket buys you entry and a free drink at the ..."},{"title":"Eating Insects Dinner","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T01:30:00.000Z","location":"Cookie Martinez","description":"Welcome back to the new Eating Insects Series. This series has been a work of love, looking for new recipes of how to integrate insects in our diet, getting rid of the Yuk perception of eating insects. I will be preparing for a four-course dinner menu.\nThe men..."},{"title":"Embiria presents Intro to Calligraphy","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T00:30:00.000Z","location":"Drake Commissary","description":"Do you want to discover how to do calligraphy for greeting cards or upcoming wedding DIY's? Looking to improve your writing for your planner? Kickstart your new found hobby with this popular class led by the talented Sylvia of @viacalligraphy at the beautiful ..."},{"title":"Excel Basics 1","date":"2019-04-10T22:00:00.000Z","endTime":"2019-04-11T00:00:00.000Z","location":"Brentwood Library","description":"Learn to open, create and edit a simple table using Microsoft Excel 2013. Basic keyboarding and mouse skills required.\nRegister in person at the Information Desk or by calling 416-394-5240."},{"title":"FIRST WIVES FIGHT CLUB","date":"2019-04-10T23:30:00.000Z","endTime":"2019-04-11T03:00:00.000Z","location":"Winter Garden Theatre","description":"First Wives Fight Club is a drag-musical-parody-90s-classics-mash-up written by Peaches Christ and Varla Jean Merman. Come explore your deepest, campiest, revenge-comedy fantasies with an all star cast of RuPaul's Drag Race Superstars: Toronto's own: Brooke Ly..."},{"title":"Free ANIMATION & DANCE Film Festival - Thur. April 11th, 7pm. Carlton Cinemas","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T01:00:00.000Z","location":"Carlton Cinemas","description":"A showcase of the best of Short Films from around the world today: Thursday April 11th. 7pm. Carlton Cinemas in downtown Toronto. Best of ANIMATION & DANCE Short Films.\nAn event for everyone!\nSee the full program and info for each film and filmmaker https://fe..."},{"title":"Freelance Finances","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T00:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Taxes, HST, GST, revenue, expenses...when you work for yourself, your business finances ARE your personal finances, and if you're not careful, things can get very messy!\nThis workshop is where you start to learn how to run your sole-proprietorship finances. Yo..."},{"title":"Hacking Success, Her Way featuring Ann Kaplan Mulholland & Tosca Reno","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T02:00:00.000Z","location":"The Albany Club","description":"Project Her Inc. is proud to present Hacking Success, Her Way. This event will give rising women entrepreneurs access to the stories and insights of business powerhouses who have cracked the glass ceiling—with a vengeance. Intimate stories of tragedy and resil..."},{"title":"House of Kings: Colour Me Now!","date":"2019-04-11T01:00:00.000Z","endTime":"2019-04-10T05:00:00.000Z","location":"Glad Day Bookshop (Church)","description":"Welcome to Colour Me Now, the first House of Kings BIPOC Show - our first show that isn’t run by white people! Come bask in the melanin glory, unique stories and explosive performances from this STACKED lineup of Kings, Queens and Gender Performers who leave y..."},{"title":"InkWell Workshops - Fiction with Kathy","date":"2019-04-10T18:00:00.000Z","endTime":"2019-04-10T20:00:00.000Z","location":"Routes Community Centre","description":"InkWell Workshops offers free, drop-in creative-writing workshops to people living with mental-health or addictions issues led by award-winning professional writers with lived experience of mental illness. Explore the basics of writing fiction in a fun, relaxe..."},{"title":"Navigating the Media","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T00:00:00.000Z","location":"Diane Frankling Co-operative Homes","description":"Please join Professor Megan Boler (Social Justice Education, OISE/University of Toronto) and the Navigating News Research Team: Andrea Vela Alarcon, Kate Jackson, Gordon Katic, Michael Primrose for an informative and thought provoking discussion. The panel pro..."},{"title":"Pink Craft Day","date":"2019-04-10T19:30:00.000Z","endTime":"2019-04-10T21:00:00.000Z","location":"Jones Library","description":"Come to Jones Branch and make a pink t-shirt badge to wear for Pink Day. Show your support for anti bullying on April 11th by wearing your signature pink badge. (no pins involved)"},{"title":"Rise & Fall of the Gooderham & Worts Empire Whisky Pairing Dinner","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T01:30:00.000Z","location":"Boku Noodle Bar","description":"Talk Whisky & History with Canadian Whisky Ambassador Spencer Gooderham\nWednesday, April 10\n7:00pm - 9:30pm\n$84 Including Tax & Gratuity\nDelight in a four-course meal prepared by Executive Chef David Caban, inspired by the four grains in whisky production – ba..."},{"title":"Roll Red Roll","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T00:00:00.000Z","location":"TIFF Bell Lightbox","description":"“Why didn’t anyone stop it?” Roll Red Roll goes beyond the headlines to unpack the factors that led to a sexual assault at a high-school football party in Steubenville, Ohio, and shaped its aftermath — from peer pressure, victim blaming, and the deeply ingrain..."},{"title":"Shane Pendergast at Free Times Cafe","date":"2019-04-11T00:00:00.000Z","endTime":"2019-04-11T02:00:00.000Z","location":"Free Times Cafe","description":"Growing up in a musical family, Shane was surrounded by traditional Maritime, French Acadian, and Celtic music. Now 20 years old, he contributes to those traditions by writing his own Maritime folk songs. In the summertime, Shane returns to his Island home to ..."},{"title":"Slime Time! at Albert Campbell District Library","date":"2019-04-10T20:00:00.000Z","endTime":"2019-04-10T21:00:00.000Z","location":"Albert Campbell District Library","description":"Exciting, free SLIME event for kids at Albert Campbell District Library on Wednesday, April 10 at 4-5pm! Make your own squishy slime to take home! Using safe, grocery store ingredients that we provide, we will make slime and have fun together!\nFor school-age c..."},{"title":"Spring Job Fair","date":"2019-04-10T17:30:00.000Z","endTime":"2019-04-10T19:30:00.000Z","location":"Milliken Mills Library","description":"JVS Employment Source Markham is hosting a job fair for full-time and part-time positions in Customer Service, Administration, Technology, Finance, Insurance, Hospitality, Healthcare, Sales, and more!\nOn-site interview with employers like:\n- York University\n- ..."},{"title":"Spring Sample Sale","date":"2019-04-10T13:00:00.000Z","endTime":"2019-04-10T22:00:00.000Z","location":"90 Tycos Drive","description":"Spring is here! That means it's time for another fantastic sale on designer men's and women's clothing, denim, intimates, sleep and lounge wear and more! Don't miss it!"},{"title":"Terrarium Workshop","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T00:30:00.000Z","location":"Design Department","description":"Design Department has exquisite terrariums and in this class guests will create their own personalized custom terrarium with expert guidance by expert gardener/designer Meredyth Hilton. Sip and tasted too, with beverage and treats!\nIncluded in the class:\n- One..."},{"title":"The Ernestine Affair","date":"2019-04-10T22:00:00.000Z","endTime":"2019-04-11T02:30:00.000Z","location":"The Carlu","description":"Ernestine’s Women’s Shelter would like to welcome you to the 25th annual Ernestine Affair! On April 10, 2019, Ernestine’s will welcome 500 friends and supporters to the annual awards and fundraising gala. The event has grown from a lively but modest badminton ..."},{"title":"Urban Field Speaker Series: Ivan Navarro","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T01:00:00.000Z","location":"Prefix Institute of Contemporary Art","description":"The Chilean artist speaks about the relationship between his sculptural installations and his experience of being raised under the dictatorship of Augusto Pinochet. Moderated by Tamara Toledo, director and curator of Sur Gallery. Presented in partnership with ..."},{"title":"Wednesday Afternoon at the Movies: For Your Eyes Only, 1981","date":"2019-04-10T18:00:00.000Z","endTime":"2019-04-10T20:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Join us for a series of cinematic classics, new releases, foreign films and documentaries.\nApril 10, 2019 showing - For Your Eyes Only (1981) - Agent 007 is assigned to hunt for a lost British encryption device and prevent it from falling into enemy hands. Sta..."},{"title":"YSDN Graduation Showcase","date":"2019-04-10T22:00:00.000Z","endTime":"2019-04-11T03:00:00.000Z","location":"FREE","description":"The York University / Sheridan College Program in Design is hosting its annual grad show! YSDN is known for being a leader in Toronto's graphic design programs, and its annual grad show attracts hundreds of visitors each year. This year's show, In Real Life, i..."},{"title":"AGO Massive XV","date":"2019-04-12T01:00:00.000Z","endTime":"2019-04-11T05:00:00.000Z","location":"Art Gallery of Ontario","description":"Thursday April 11, 2019 9:00 PM - 1:00 AM Art Gallery of Ontario #AGOMassive AGO Massive is Toronto's ultimate contemporary art party, this year with creative direction by Director X! To celebrate AGO Massive’s 15th year, we are inspired by the anniversary’s t..."},{"title":"Images Festival 2019","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T03:00:00.000Z","location":"Multiple Venues","description":"Images showcases artistic excellence in contemporary moving image culture through screenings, exhibitions and performances, providing artists with a supportive forum in which to present their work and make professional connections with the media arts community..."},{"title":"163 JOHN ST. : THURSDAY SURPRISE SHOW @ THE CORNER","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-11T04:00:00.000Z","location":"The Corner","description":"PAUL THOMPSON'S SURPRISE SHOW Paul Thompson hosts a surprise line up of special guests. Featuring comics making their first appearance at The Corner as well as comics visiting Toronto from New York, Los Angeles, United Kingdom, and all over the world. TWO SHOW..."},{"title":"401 Art Hunt","date":"2019-04-11T21:00:00.000Z","endTime":"2019-04-11T23:00:00.000Z","location":"401 Richmond","description":"Art Hunt, a scavenger hunt is back this year at 401 Richmond!\nOur building-wide event takes place on Thursday, April 11, 2019 from 5-6pm. Folks will be given a series of clues, taking them around the basement and first floor of the building to discover the sec..."},{"title":"946 QUEEN ST. EAST : THE BANANAS SHOW @ THE CORNER EAST","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-11T04:00:00.000Z","location":"The Corner East","description":"Every Thursday at The Corner Comedy Club EAST, JOEY HARLEM & JEREMY DOBSKI will be hosting THE BANANAS SHOW! A lineup of Canada’s best comedians showcasing their fun and weird material.\nFeaturing comedians from Just For Laughs, CBC, Sirius XM, and The Comedy N..."},{"title":"Anansi Poetry Bash","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Henderson Brewing Co","description":"Join us in launching House of Anansi Press and Groundwood Books' spring 2019 poetry books by Shannon Bramer (Climbing Shadows), Karen Solie (The Caiplie Caves), Erín Moure (The Elements), Michael Redhill (Twitch Force), and Kayla Czaga (Dunk Tank).\nEnjoy readi..."},{"title":"Andrea Spaziani's The Right Eye of Clint","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Dancemakers Centre for Creation","description":"A new solo work that deals with notions of the West and with Western film tropes. Choreography & Performance: Andrea Spaziani; Music Score: Matt Smith (aka Prince Nifty); Outside Eye: Danny Grossman. Tickets: $15/$20 on line and at the door"},{"title":"An Intimate Sip & Shuck - Oyster and Wine Experience","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"110 Charles Street East","description":"Join us for the April edition of our Intimate Sip & Shuck event - a hands-on shucking experience + wine social event\nAbout this Event\nJoin us on Thursday, April 11th from 7-9 PM for an intimate evening spent sipping wine and slurping oysters in style!\nEnjoy fr..."},{"title":"Art Pour","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T02:00:00.000Z","location":"Jam Factory","description":"Art Pour is an event for those who enjoy indulging their senses, engaging\ntheir palate, and are intrigued by the art behind hosting and hospitality.\nAttending guests will learn more about what goes into hosting their own dinner party by expanding their knowled..."},{"title":"A Toast and Thyme Pop Up Dinner","date":"2019-04-11T22:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"The Depanneur","description":"Join us for Toast + Thyme's first pop-up dinner!\nMore details on Instagram: @toastandthymeto\nMenu:\nRoasted Butternut Squash Soup $6\nwith Ginger Coconut Cream and Purple Potato Chips\nToasts! $13\nall toasts served on house-baked sourdough and come with a side of..."},{"title":"Beauty In Lines Exhibition - Jude Ifesieh","date":"2019-04-11T22:30:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Visions Gallery","description":"Opening Reception 6:30-9:00 pm.\nThe distinctive paintings of Nigeria-born Jude Ifesieh merge simple, colourful strokes and dots into complex images that burst with healing energy, fertility and fresh possibilities."},{"title":"Beer and Cheese Night with BeerXca","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Muddy York Brewing Co.","description":"Have you ever wondered why beer and cheese taste so good together? Have you ever wanted to learn how to pair them yourself?\nJoin Certified Master Beer Sommeliers® Heather and Maddie from Beerx.ca as they take you on a taste adventure through five Muddy York Br..."},{"title":"Black Sheep Comedy's TESTING: ATTENTION PLEASE!","date":"2019-04-12T01:00:00.000Z","endTime":"2019-04-12T03:30:00.000Z","location":"120 Diner","description":"Black Sheep Comedy presents TESTING. ATTENTION PLEASE! Join us for a night of stand up featuring new and experienced comics. The comedian voted as audience favourite will win a HUGE(ly underwhelming) cash prize AND a surprise item to commemorate their victory!..."},{"title":"Blast From the Past - Sibling Day Edition","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T01:30:00.000Z","location":"Comedy Bar","description":"Sibling Day comes but once a year and we're here to celebrate those bratty kid sisters, grumpy older brothers and annoying middle children (and only children, and of course those friends we have adopted as siblings, we see you too).\nInspired by childhood show-..."},{"title":"Bon Villan Video Release Party with Most People and Rachel Romu","date":"2019-04-12T01:00:00.000Z","endTime":"2019-04-11T05:00:00.000Z","location":"The Piston","description":"We're back and thrilled to announce the release of our next single and accompanying video \"All The Way\". To celebrate we're throwing a release party at The Piston April 11th and hope you'll all come party with us. We'll be playing alongside Most People and Rac..."},{"title":"Book Launch, Alexa Conradi's Fear, Love and Liberation in Contemporary Quebec","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Another Story","description":"In response to rapid and unsettling social, economic, and climate changes, fearmongering now features as a main component of public life. Right-wing nationalist populism has become a hallmark of politics around the world. No less so in Quebec. Alexa Conradi ha..."},{"title":"Collage Workshop with Danielle Cole","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:30:00.000Z","location":"918 Bathurst St","description":"This is a hands-on workshop where you will be shown strategies for creating collages that are seamlessly built. We will go beyond the glue stick, learning techniques for gluing fine and large pieces of collage without causing the material to bubble or tear. Da..."},{"title":"Contemporary Ceramic Art Exhibition","date":"2019-04-11T14:00:00.000Z","endTime":"2019-04-11T21:00:00.000Z","location":"Craft Ontario","description":"'The Body Has Reasons Which Reason Knows Not Of', ceramic work that explores various themes surrounding tacit knowledge, and the body’s ability to bounce back, grow, resist, and remember. Exhibition is on from April 11 to May 12, 2019 - Opening reception, Apri..."},{"title":"Digital Product Management for  Creating and Managing Best-In-Class Products","date":"2019-04-11T22:15:00.000Z","endTime":"2019-04-12T00:00:00.000Z","location":"BrainStation Toronto","description":"MUST RSVP THROUGH EVENT PAGE HERE: http://bit.ly/2TxIXqd\nMore than ever before, savvy product management has a huge impact on company success. But what does that entail in the digital economy? Join us as local experts share what it takes to successfully lead p..."},{"title":"Emerging Writers Salon","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:30:00.000Z","location":"Hart House","description":"The Hart House Literary and Library Committee invites all emerging writers from any background—especially students—to connect, engage, support, and learn from each other. This year’s salon features talented student writers, and our featured alumna, Doyali Isla..."},{"title":"Foie Week","date":"2019-04-11T15:45:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Biff's Bistro","description":"Join us from April 11 – 21 to experience a specialty menu you won’t soon foieget!\nWith dishes like Foie Gras Poêlé, served with a Niagara peach flapjack and peanut marzipan, or our Heritage Chicken & Foie Gras Pot au feu in a delicious black truffle broth, wit..."},{"title":"Four Old Legs","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T02:00:00.000Z","location":"The Citadel: Ross Centre for Dance","description":"Citadel + Compagnie presents the world premiere of Canadian dance luminary James Kudelka’s Four Old Legs, running April 12-13 & 17-20, 2019 at 8pm, and on April 14 at 4pm, at the Citadel: Ross Centre for Dance. Citadel + Compagnie’s resident choreographer and ..."},{"title":"Free Expression and National Interests: The Case of China","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Ryerson University","description":"As U.S. cultural influence slips, China is ramping up its use of cultural, educational and diplomatic initiatives to influence and control expression and its image in Canada and elsewhere.\nJoin a panel of experts to explore current Chinese government initiativ..."},{"title":"Gardening Blogger Emma Biggs at Toronto Botanical Garden","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Emma Biggs, garden blogging teenager, knows a lot about growing tomatoes. She will discuss how to fit many tomatoes into a small space, ways to prune and train them, and how to start and save seeds. Emma has grown more than 100 tomato varieties and will share ..."},{"title":"Gardening in the Shade - Toronto Master Gardener Workshop","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T00:00:00.000Z","location":"Brentwood Library","description":"Say yes! To a lush and lively shade garden: (1) Types of shade and how to identify them; (2) Why shade is an opportunity; (3) Bringing more light into the garden; (4) Improving soil to enhance plant vigor; (5) Choosing the right plants for your garden; (6) Per..."},{"title":"Gianna Lauren and Joshua Van Tassel","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T02:30:00.000Z","location":"Enoch Turner Schoolhouse","description":"Join ambient singer-songwriter Gianna Lauren from Halifax with electro-acoustic composer Joshua Van Tassel for a special evening at Enoch Turner Schoolhouse in Toronto, ON.\nHosted by Enoch Turner Schoolhouse, and booked by Side Door.\nTickets $20.00. Visit the ..."},{"title":"Great Dramas Series - Madame Bovary - 2014 Movie","date":"2019-04-11T17:00:00.000Z","endTime":"2019-04-11T19:00:00.000Z","location":"Brentwood Library","description":"Bored in her marriage to a country doctor and stifled by life in a small town, the restless Emma Bovary pursues her dreams of passion and excitement, whatever they may cost.\nBased on the novel by Gustave Flaubert.\n2014 Movie. 118 minutes. Rated 14A. Ratings no..."},{"title":"Healing: A Collection of New Paintings by Sonya Spilkin","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Liberty Market Lofts Gallery","description":"“Healing” explores processes of recovery, mending, and regeneration while working through the challenges and celebrating the milestones which accompany them.\nCreated as a response to and as a way of coping with recovery from an accident, Spilkin addresses ways..."},{"title":"Inspirations Studio Spring Sale and Open House","date":"2019-04-11T16:00:00.000Z","endTime":"2019-04-11T21:00:00.000Z","location":"Inspirations Studio","description":"Please join us for our 25th Annual Spring Open House and pottery sale. Come support the makers at our studio and storefront for women who have been impacted by poverty, homelessness, mental health and addiction. Join us for tea and check out gifts that give ba..."},{"title":"Life - four billion years in the making","date":"2019-04-11T15:00:00.000Z","endTime":"2019-04-11T17:00:00.000Z","location":"Royal Ontario Museum","description":"Discover the ROM's newest permanent gallery project dedicated to the story of the dawn of life. This new space will bring visitors on a journey from the origin of life itself, close to 4 billion years ago, to the dawn of dinosaurs, roughly 200 million years ag..."},{"title":"Lighthouse Labs Toronto Demo Day","date":"2019-04-11T22:00:00.000Z","endTime":"2019-04-12T00:00:00.000Z","location":"Shopify","description":"It's time for our new grads to show off what they've learned in just 10 weeks!\nDemo Day is back! Our new Web grads are about to start their careers as professional web developers; but first they want to show you what they've learned to build in just 10 weeks w..."},{"title":"Mindbender Supreme, Ekelle, Peppermint","date":"2019-04-12T01:00:00.000Z","endTime":"2019-04-11T06:00:00.000Z","location":"Handlebar","description":"It's finally here! The official album release party of MINDBENDER Supreme and PEPPERMINT's new double album JOURNEY INTO SOUND: New Colours; New Dimensions; New Values.\nPlease bring your SEXY selves out to a night of innovative live MUSIC and also to celebrate..."},{"title":"Mockingbird: An Improv Comedy Mockery","date":"2019-04-12T01:30:00.000Z","endTime":"2019-04-12T02:30:00.000Z","location":"Social Capital Theatre","description":"Toronto's best improvisers perform in this daring and innovative improv comedy show. Talented and hilarious improvisers recreate and exaggerate an entire long form set, which leads to high energy performances and unexpected moments."},{"title":"Neighbourhood Trust What's Next?","date":"2019-04-11T22:30:00.000Z","endTime":"2019-04-12T00:30:00.000Z","location":"Lakeshore Arts","description":"Join Lakeshore Arts as the physical space for the Neighbourhood Trust comes to a close, how do we continue to come together and discuss the neighbourhood’s pressing issues?\nArtist Hiba Abdallah will lead a panel discussion alongside local community members who..."},{"title":"PUNK 'TILL YER DRUNK! with DJ Ol' Nerdy Bastard","date":"2019-04-12T02:00:00.000Z","endTime":"2019-04-11T06:00:00.000Z","location":"Swan Dive","description":"Punk Rock & Cheap drinks!\n*FREE*"},{"title":"Secret RSVP Live-Matched Movies & Travel Singles Games Night","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:30:00.000Z","location":"Firkin on Bloor","description":"Don't enjoy the awkward, run-of-the-mill speed dating and singles events? Tired of endless swiping dating app games? We don't blame you.\nSecret RSVP, the world's 1ST LIVE-MATCHED singles events experience, launched in Toronto to a sold-out crowd of close to 60..."},{"title":"TAGGED Film Screening","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T03:00:00.000Z","location":"Ryerson University - Rogers Communications Centre","description":"Tagged is a film that highlights the murder of a promising young black youth and the continuous grief of a family and community riddled with pain as they deal with the loss while battling to dispel stereotypes and tags that suggest that black youths who died b..."},{"title":"Throwback Thursday","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T03:00:00.000Z","location":"Station Bar & Kitchen","description":"Relive some memories with a night of Throwback Live music with Lynn Moffat and with DJ Sarah Jane Reigler !!\n90\"s and 2000's hits with Fun , food & drinks"},{"title":"Toast","date":"2019-04-11T22:30:00.000Z","endTime":"2019-04-12T02:30:00.000Z","location":"477 Richmond Street West","description":"Toast is the newest cooking class series in Toronto focused on providing a unique and memorable culinary experience. Our master classes educate and entertain, by showcasing classic and modern cuisines. Our professional chefs and mixologists bring a wealth of k..."},{"title":"Trials & Tribulations of Growing Tomatoes at Toronto Botanical Garden","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Emma Biggs, garden blogging teenager, knows a lot about growing tomatoes. She will discuss how to fit many tomatoes into a small space, ways to prune and train them, and how to start and save seeds. Emma has grown more than 100 tomato varieties and will share ..."},{"title":"Wonk Prom","date":"2019-04-12T00:30:00.000Z","endTime":"2019-04-11T04:00:00.000Z","location":"Steam Whistle Brewing","description":"Are you a wonk? Do you have a passion for public policy, politics and change-making?\nRyerson Leadership Lab invites you to attend Wonk Prom 2019 and join friends from across the country for a night of networking, music and celebration.\nWhen: Thursday, April 11..."},{"title":"ALKALINE Live in Concert Toronto 2019","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T07:00:00.000Z","location":"Chandni Victoria Banquet & Convention Centre","description":"Rodeo Promo & The 6 Lifestyle presents ALKALINE Live in Concert!!! April 12th 2019 Dancehall Superstar ALKALINE returns live with his full band to heat up the city. The Vendetta boss plans to create history with his planned Canadian tour. DOORS OPEN 10 PM Host..."},{"title":"Buy Good. Feel Good. Expo 2019","date":"2019-04-12T21:00:00.000Z","endTime":"2019-04-12T21:00:00.000Z","location":"Enercare Centre","description":"Our choices matter!\n\"Buy Good. Feel Good.\" Expo is coming back to Toronto for its sixth edition.\nShop North America's largest collection of ethically sourced products and support businesses that make the world a better place.\nOver 150 exhibitors. 200,000+ Live..."},{"title":"CN Tower Climb Toronto 2019","date":"2019-04-12T10:00:00.000Z","endTime":"2019-04-12T13:30:00.000Z","location":"CN Tower","description":"WWF'S CN TOWER CLIMB FOR NATURE\nSaturday, April 13 and Sunday, April 14, 2019\nClimbing the CN Tower is a rare and exhilarating opportunity to take 1,776 meaningful steps towards a future where nature and wildlife thrive. Register today to climb, enjoy the brea..."},{"title":"Dr. Jane Goodall in Toronto","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T00:30:00.000Z","location":"Ryerson University","description":"See Dr. Jane Goodall live in Toronto.\n\r\nEquipped with little more than a notebook, binoculars, and a passionate interest in wildlife, Jane Goodall ventured into the forests of Tanzania nearly 60 years ago to begin her groundbreaking research on chimpanzees. Si..."},{"title":"Droeloe in Toronto","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Velvet Underground","description":"Embrace Presents\r\nDROELOE \r\nw/ FYTCH + TAILS\n\r\nDoors: 10pm\r\n19+ Event\n\r\nDROLOE\nhttps://www.facebook.com/droeloemusic\nhttps://twitter.com/DROELOEMUSIC\nhttps://www.instagram.com/droeloemusic/\n\r\nFYTCH\nhttps://www.facebook.com/FytchMusic\nhttps://twitter.com/fytcho..."},{"title":"Pop-Up Neon Gallery","date":"2019-04-12T15:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Junction House","description":"A FREE neon pop-up exhibit is headed to Toronto for just one weekend in April, showcasing signs and art pieces from the collections of Neon Museum Toronto and Neon Demon – including the famed 12-ft. Hard Rock Museum guitar. The three-day gallery is part of a p..."},{"title":"Steve Martin and Martin Short in Toronto","date":"2019-04-12T23:30:00.000Z","endTime":"2019-04-13T03:59:00.000Z","location":"Sony Centre for the Performing Arts","description":"Featuring the Steep Canyon Rangers and Jeff Babko.\n\r\nSale Dates and Times:\n\r\nPublic Onsale : Mon, 3 Dec 2018 at 10:00 AM\n\r\nFront Of The Line by American Express : Thu, 29 Nov 2018 at 10:00 AM\n\r\nPresale Offers : Thu, 29 Nov 2018 at 10:00 AM\n\r\nOfficial Platinum ..."},{"title":"The Toronto Pancakes & Booze Art Show","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Revival","description":"As the Toronto's premier pop-up art show, The Pancakes & Booze Art Show provides art lovers an opportunity to explore more than 400 pieces of artwork created by some 80+ artists local to Toronto's unparalleled art scene. Alongside an immensely wide variety of ..."},{"title":"163 John St. : FRIDAY SHOWCASE @ THE CORNER","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-12T04:00:00.000Z","location":"The Corner","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nFRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna be ..."},{"title":"946 QUEEN ST. EAST : FRIDAY SHOWCASE @ THE CORNER EAST","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-12T04:00:00.000Z","location":"The Corner East","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nFRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna be ..."},{"title":"All About Women Show","date":"2019-04-12T15:00:00.000Z","endTime":"2019-04-13T00:00:00.000Z","location":"International Centre","description":"​The All About Women Show features three fun-filled days of shopping, learning, and exploring with over 240 fabulous exhibitors carrying the latest products and services tailored to women of all ages. For one special weekend only, explore a women’s world broug..."},{"title":"ALTAER","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Christie Pits Pub","description":"Featuring DJs Mistress McCutchan and Deadspiderman, spinning goth, postpunk, and other dark alternatives. There will also be a CD swap - bring a CD, take a CD. Make CD mixes to share!\nNo cover, 19+ in the lower level at Christie Pits Pub."},{"title":"April Exhibitions Opening at Xpace Cultural Centre","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"XPACE (Lansdowne)","description":"Join us for the opening of our April exhibitions!\nThis event is FREE!\nMAIN SPACE\nRecess curated by Jaycee Tu\nRowena Katigbak, Eric Oh, Lina Wu, Yuma Yanagisawa, Cristine Yunyk.\nApril 12th - May 11th, 2019\nAs a child in school, a typical day often revolves arou..."},{"title":"BIG SOUND Live at THE GREAT HALL","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T07:00:00.000Z","location":"The Great Hall","description":"Toronto's Biggest Motown & Classic Soul Revue: the Big Sound is back with a spring edition of feel good.\nAs per always 30 musicians banging out the greatest soul hits of all time as faithfully as we can and DJ Wes Allen dishing up the biggest dance floor bange..."},{"title":"Brooklynn Bar Comedy - April 12th","date":"2019-04-13T00:30:00.000Z","endTime":"2019-04-13T02:30:00.000Z","location":"Brooklynn Bar","description":"After the last Eight successful monthly Brooklynn Comedy Nights, we are pumped for another. We’ve put together some of the best Pro Comedians in the city with help from 'Perfect 10\nComedy' for a VIP comedy show April 12th. Dance party to follow! | ONLY $10 the..."},{"title":"Carol Zoccoli: How To Beat Up Any Man","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-13T03:15:00.000Z","location":"John Candy Box Theatre - The Second City","description":"Comedian and writer Carol Zoccoli (Winnipeg Comedy Festival, CBC's The Debaters, Comedy Central Brasil) tells us how it was growing up as a woman in Brazil - and her story is told through the men she’s beaten up. How To Beat Up Any Man is a funny and raw tale ..."},{"title":"Celebrating the Poets of Palestine","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"Knife Fork Book","description":"Knife Fork Book presents: Celebrating the Poets of Palestine\nwith Marcello Di Cintio\nJoin acclaimed author Marcello Di Cintio at Knife Fork Book on April 12 for a reading from his book Pay No Heed to the Rockets from 7 to 9 PM.\nMarcello Di Cintio’s book Pay No..."},{"title":"Clarkson Society of Artists 2019 Art Show & Sale","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Visual Arts Mississauga’s Riverwood Gallery","description":"Annual exhibition of 38 artists offering a creative collection of original oil, acrylic, watercolour and mixed media pieces. Featured artist is Christine van Driel, who paints mostly in acrylics and oils."},{"title":"C'mon Angie!","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"The Assembly Theatre","description":"C’mon Angie! by Amy Lee Lavoie is a thrilling, timely, and exceedingly human new Canadian drama about consent and sexual assault that the Georgia Straight calls, \"visceral, important, life-changing theatre.\"\nApril 12-27, 8:00pm (Tuesdays - Saturdays)\n$20 - $35"},{"title":"Cooking with Paul: Vodka and Mushrooms","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Tartu College","description":"Friday, April 12 at 7pm, an interactive workshop \"Cooking with Paul: Vodka and Mushrooms\" will take place at Tartu College.\nEstonia has a long history of producing and enjoying vodka. The first announcement of vodka productions on Estonian soil is from as earl..."},{"title":"CREATE Showcase","date":"2019-04-12T22:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Ryerson School of Performance","description":"On April 12th 2019, emerging artists from School of Performance will hold the 8th annual showcase dedicated to displaying original works of students and inspiring career development with guest speakers in the entertainment industry. The event is not only a sho..."},{"title":"Design Forces","date":"2019-04-12T12:30:00.000Z","endTime":"2019-04-12T14:00:00.000Z","location":"Toronto International Design Centre","description":"FRESH FROM HIGH POINT MARKET!\nKimmberly Capone Interior Design brings back High Point's finest moments to Canada through an in-depth presentation!\n8:30 am: full breakfast by Chef Tawfik - please email tidc@internationalcentre.com with any dietary restrictions ..."},{"title":"DIRT NAP with DJ Davey D","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Swan Dive","description":"Scratchy-ass retro & classic rock gems spun by the one & only king of garage sale vinyl, DJ Davey D!"},{"title":"Dirty Pop: A Boy Band Bash!","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:30:00.000Z","location":"Clinton's Tavern","description":"On Friday April 12 we're celebrating all our favourite boy bands at DIRTY POP! Backstreet Boys, One Direction, and everything in between - we've got all your boy band needs covered. Let's drink, dance, and scream-sing along to all the songs we never realized w..."},{"title":"DJ Misty and The Blue Demon","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Handlebar","description":"Friday April 12 - 10pm - FREE\nFOR ONE NIGHT ONLY BACK FROM THE FM DIAL... THE DEMON’S LAIR!\nIt’s been a minute but after co-hosting The Demon’s Lair on CKLN 88.1fm for 5 awesome years, DJ’s Misty and The Blue Demon are getting behind the decks together again!\n..."},{"title":"Documentary: Listen up: the lives of Quincy Jones","date":"2019-04-12T18:00:00.000Z","endTime":"2019-04-12T20:00:00.000Z","location":"Toronto Reference Library, Hinton Learning Theatre, 3rd floor","description":"An unconventional style of documentary reveals the life of the legendary musician, arranger, composer and producer."},{"title":"Far. The Story of a Journey Around the World","date":"2019-04-12T22:00:00.000Z","endTime":"2019-04-13T00:08:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Embark on an unforgettable journey to China, Pakistan, India and beyond with a young couple travelling the world on an epic 50,000 km hitchhike. Travelling for over three years with hardly any money, and refusing to take any planes, the charismatic duo makes t..."},{"title":"Fauxcella -  A music festival for the rest of us.","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T18:30:00.000Z","location":"Round","description":"Juicy Moon Presents: FAUXChella a music festival for the rest of us.\nAre you jealous of your friends going to Coachella this year? Well dont worry too much there is Fauxchella a night parodying the festival, right here in Toronto. Get into the summer spirit be..."},{"title":"Future Fierce: Drag Pageant","date":"2019-04-12T23:30:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"The Redwood Theatre","description":"Future Fierce: Drag Pageant is a pageant that consists of drag queens who get to compete for their chance to be crowned Miss Future Fierce of Toronto!\nA total of 5 drag performers will compete in 3 segments: an intro with a slayin' futuristic look, a talent po..."},{"title":"Game of Thrones Trivia Night","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"H Bar","description":"Rev yourselves up before the season premiere of Game of Thrones with a little GoT trivia night! As always, it’s free to play but we do suggest booking your teams in well in advance, as space is sure to go fast!\nFriday, April 12th @ 8PM\nWin a $50 bar tab\n$5.50 ..."},{"title":"Hiromi","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"Toronto Centre for the Arts","description":"Since bursting onto the music scene in 2003, Hiromi has electrified audiences and critics east and west, with a creative energy that encompasses and eclipses the boundaries of jazz, classical and pop parameters, taking improvisation and composition to new heig..."},{"title":"How To File A Simple Tax Return","date":"2019-04-12T18:00:00.000Z","endTime":"2019-04-12T19:30:00.000Z","location":"Riverdale Branch, Toronto Public Library","description":"A representative from the Canada Revenue Agency (CRA) will facilitate the Teaching Taxes course. The course will help you understand why you pay taxes and how taxes are used. It also teaches the basics of taxation, right and responsibilities as a taxpayer and ..."},{"title":"ICFF Monthly Screening - The Place","date":"2019-04-13T01:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"TIFF Bell Lightbox","description":"Italian Film - English Subtitles\nA mysterious man sits everyday at the same table of the same restaurant, continuously receiving visitors. Each of his clients wants something, driven by a deep desire, a desire that is difficult to realize, if not impossible. T..."},{"title":"INTERACTIVE SINGLES NIGHT FOR TORONTO PROFESSIONALS!","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Old School","description":"IT'S TIME FOR A NEW KIND OF SINGLES EVENT!\nJoin us for a light-hearted, relaxed and interactive singles evening!\n- Are you ready to get your head out of your app, and connect in person, in a fun, genuine and relaxed environment?\n- Are you ready to have playful..."},{"title":"Iyengar: The Man, Yoga, and the Student's Journey","date":"2019-04-13T01:00:00.000Z","endTime":"2019-04-13T02:45:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Hailed as \"the Michelangelo of yoga\" and considered to be one of the most important masters in the world, B.K.S. Iyengar is credited with bringing the ancient art of yoga to the modern masses. Born in Southern India 100 years ago, the legendary guru is the fou..."},{"title":"James King & The Midnight Hours/Claire Hunter/Sheldon Hunt LIVE @ The Cameron House","date":"2019-04-13T01:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Cameron House","description":"James King & The Midnight Hours, Claire Hunter and Sheldon Hunt are thrilled to be bringing their original music to the legendary Cameron House. Come out for what is sure to be a spectacular night of music, songwriting and rock n roll with three local Toronto ..."},{"title":"Kicking Test Anxiety in the Butt! FOR HIGH SCHOOL KIDS","date":"2019-04-12T20:30:00.000Z","endTime":"2019-04-12T22:00:00.000Z","location":"The Math Guru","description":"Did you know that 85% of all students feel some sort of anxiety when it comes to test taking? Seriously - you're not alone! If you're like most people, you get stressed before tests - and even MORE stressed before exams! Maybe you have a little knot in your st..."},{"title":"Laraaji with special gues Joseph Shabason","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"Toronto Spiritualist Temple","description":"Telephone Explosion, Morning Trip & Burn Down The Capital Present:\nLARAAJI (https://laraajimusic.bandcamp.com)\nLaraaji is a musician, mystic and laughter meditation practitioner based in New York City. He began playing music on the streets in the 1970s, improv..."},{"title":"Mas Sajady at the Total Health Show, Toronto","date":"2019-04-12T20:00:00.000Z","endTime":"2019-04-12T23:00:00.000Z","location":"Metro Toronto Convention Centre (MTCC)","description":"Through two near death experiences Mas Sajady was gifted with extraordinarily potent abilities to help you transform any area of your life - physical, financial, spiritual, relationships - with rapid, tangible and documented results.\nMas' abilities allow him t..."},{"title":"PAINT PUFF PASS","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"Secret Space","description":"Come enjoy the coolest thing since sliced bread.\nIts like Paint Night but like way better.\nExplore the creative side you didn't know you had.\nExpect to indulging in delicious treats, refreshing beverages all while laughing and creating with like minded locals ..."},{"title":"Raven Chacon Mini-Festival","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"Music Gallery","description":"Arraymusic, The Music Gallery, and Native Women In The Arts present\nRaven Chacon Mini-Festival\nFriday – Sunday\n04.12 – 14.19\nWe are pleased to team up with Arraymusic once again together alongside Native Women In The Arts to present the Raven Chacon mini-festi..."},{"title":"Remember Sports w/ Pony @ The Rec Room","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"The Rec Room","description":"Remember Sports' peppy indie powerpop encapsulates the melancholy and excitement of growing up. Lead singer Carmen Perry has an earnest lyrical approach; detailing her own pain and progress in vivid, animated detail. Remember Sports? You're about to.\nWith spec..."},{"title":"Rish Bridal Trunk Show","date":"2019-04-12T14:30:00.000Z","endTime":"2019-04-12T23:30:00.000Z","location":"Sash & Bustle","description":"Sash & Bustle is excited to announce Rish Bridal’s 2019 collection. This trunk show will be full of perfectly fitting silhouettes with fabulous fabrics to make any boho bride excited. You will not want to miss this Israeli’s designers newest collection in stor..."},{"title":"Rope Bondage for Beginners","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Good For Her","description":"What’s so hot about rope bondage? What skills do you need to get started? How do you keep everyone safe? Come to this workshop to learn about rope as a tool for bondage and how to build skills for a sexy rope bondage scene."},{"title":"Showdown: A Burlesque Game Show!","date":"2019-04-12T23:30:00.000Z","endTime":"2019-04-13T02:30:00.000Z","location":"Dance Cave","description":"It's the ultimate one-two punch: five dazzling burlesque performances bookended by five ridiculous party games. What more could you want on a Friday night?\nWhat exactly is Showdown all about? We take brave volunteers from our audience, and have them compete in..."},{"title":"SoQu Presents: Tea Base & Chill","date":"2019-04-12T20:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Tea Base","description":"SoQu [sober queers] is a new monthly meet up for queer and trans folx who just want to chill and socialize in an environment that is free of alcohol! Come over to Tea Base (located in the basement of the Chinatown centre) for some tea, board games, video games..."},{"title":"Studio 102 Grand Opening","date":"2019-04-12T21:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Studio 102","description":"Artists Rob Croxford and Karen Taylor, and photographer Jessica Lin have moved into a new studio together and are ready to show it off to the world!\nCome to Studio 102 on Friday April 12th or Saturday April 13th and see their new home and some of the new work ..."},{"title":"Styleworthy #stylesummit","date":"2019-04-12T15:00:00.000Z","endTime":"2019-04-12T21:00:00.000Z","location":"International Centre","description":"​AUTHENTIC UNAPOLOGETIC CONVERSATIONS ABOUT STYLE & SELF\n​Presenting The Styleworthy #stylesummit at the All About Women’s Show where founder, Jennifer Rabanillo will host a daily panel showcasing a Powerhouse of influencers, inspirers and creatives.\nWithin th..."},{"title":"Sunset Culture Club","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Farside","description":"All vinyl rare party jams and audio explorations with DJ Morgan Yew. Free!"},{"title":"Sushi Making for Millennials","date":"2019-04-12T22:00:00.000Z","endTime":"2019-04-13T00:00:00.000Z","location":"Bloor/Gladstone Library","description":"Move beyond the microwave and Uber Eats. Learn about the art of sushi making with celebrated chef and award-winning author Kim Sang. Kim will teach you how to make 3 different rolls. All supplies are provided. This is a free event.\nRegistration required. Regis..."},{"title":"Swing Dance Lesson & Live Band Social!","date":"2019-04-12T23:30:00.000Z","endTime":"2019-04-12T04:00:00.000Z","location":"Lindy Hop Revolution","description":"Join us for our monthly Swing Dance! Swing dancing is a social dance that is full of joy and a good way to meet a lot of people. Everyone is welcome! We will have a drop-in beginner lesson followed by a dance with Juno-nominated Alex Pangman & Her Alleycats! N..."},{"title":"Taoist Tai Chi Beginning Weekend: Learn 108 Moves in 3 Days","date":"2019-04-12T22:30:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Knox Presbyterian Church","description":"You'll start learning the 108 moves of our set and be introduced to a Taoist art that helps calm the mind and transforms you into a healthier and more harmonious person. The weekend starts on Fri. Apr. 12, 7-9 p.m. (registration opens 6:30 p.m.) and Sat. Apr. ..."},{"title":"Tequila O'Clock - A Social Tequila Tasting Event","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"525 Adelaide Street West","description":"Tequila O’clock is the best time of the day! Join us on Friday, April 12th from 8-10 PM for a tasting of 1 tequila, 2 tequila, 3 tequila… 4 different types of tequila! Enjoy a margarita cocktail reception, followed by a sit-down structured tasting and tutorial..."},{"title":"The Buy Good. Feel Good. Expo Opening Reception","date":"2019-04-12T21:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Enercare Centre","description":"“Every time you spend money, you're casting a vote for the kind of world you want.” ~ Anna Lappé\nFrom fashion and beauty to lifestyle and travel, the Buy Good. Feel Good. Expo celebrates the power of the conscious consumer.\nEnjoy a VIP shopping experience with..."},{"title":"Trade: Big Tree Energy","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Black Eagle","description":"The rosebuds are beginning to bloom and the pussy willows will be bursting. Spring has returned and time for us to get naked, suckle on the nectars and closer to nature.\nFulfilling all your big tree energy fantasies is dreamboat arborist Dillon\nA few ideas of ..."},{"title":"Tricky Moreira's Annual Birthday Bash!","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T07:00:00.000Z","location":"One Loft","description":"On Friday April 12th come celebrate Tricky Moreira's annual This House Birthday Party at One Loft!\nMoreira will be spinning an extended DJ set to celebrate life and music, and is bringing some very talented friends along to play special guest DJs sets (announc..."},{"title":"Weird Al Karaoke","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-13T03:15:00.000Z","location":"Comedy Bar","description":"Weird Al Karaoke is the comedy show where comedians write and perform their own parodies of popular songs, over karaoke tracks!"},{"title":"Zero Hour Improv - April 2019","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Social Capital Theatre","description":"Welcome to Zero Hour Improv, the show with the most improv at the best price!\nZero Hour is 60 mins of pure comedy. It features the best improv troupes in Toronto on a non stop roller coaster of Improv. Come join in on the action!\nFeaturing:\nPaul and the Blarts..."},{"title":"AGAINST THE CURRENT","date":"2019-04-13T22:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Velvet Underground","description":"Collective Concerts Presents Against The Current  Saturday, April 13th Velvet Underground Toronto, ON Doors 6pm / All Ages Collective Concerts Presale starts Thursday, December 13th at 10am. https://www.ticketfly.com/purchase/event/1801362 All tickets o..."},{"title":"Barkworks 2019","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Evergreen Brick Works","description":"Barkworks is Toronto’s latest festival for families and their four-legged friends to come together and enjoy a fun day of Easter egg hunting, live entertainment, activities, and a variety of pet-friendly vendors at our puppy pop-up market.\n\r\nProceeds from the ..."},{"title":"Orville Peck","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"The Great Hall","description":"Collective Concerts Presents\nOrville Peck\nSaturday Apr 13, 2019\nDoors: 8:00 PM\n19 and over\n$13\nLongboat Hall at The Great Hall \n1087 Queen St. W \r\nToronto, ON"},{"title":"Parkdale Flea 2019","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T22:00:00.000Z","location":"Northern Contemporary Gallery","description":"We've moved and our first flea of 2019 in our new space is coming up this Spring! Save the date for April 13 and May 11 (Spring into Parkdale Festival). Vintage pieces, clothing, to Skincare, Crafts, Accessories, Confections and more!\nNew vendors, new space, n..."},{"title":"Record Store Day 2019","date":"2019-04-13T13:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Multiple Venues","description":"Celebrating the culture of the indie record store 24/7/365. \r\nThe twelfth annual Record Store Day takes place worldwide on 4/13/19."},{"title":"Street Machine Market","date":"2019-04-13T14:00:00.000Z","endTime":"2019-04-13T23:00:00.000Z","location":"Milk Toronto","description":"Street Machine Market is Toronto's newest vendor market focused specifically towards up and coming streetwear/ lifestyle brands. This market was conceptualized to fill the void in the Toronto scene for new streetwear/ lifestyle brands that are being establishe..."},{"title":"Wavelength Monthly Music Series","date":"2019-04-13T13:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Brothers Dressler","description":"Wavelength Monthly Music Series\nApril 2018 featuring:\nI am Robot and Proud (Toronto / computer pop since the year 2001)\nThanya Iyer (Montreal / sparkling experimental pop)\nWorld News (Toronto / psychedelic synth duo)\n+ General Chaos Visuals\n++ Precious Jewel (..."},{"title":"Wintersleep in Toronto","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"The Danforth Music Hall","description":"Collective Concerts Presents\n\nWintersleep\r\nwith Partner\n\r\nSaturday, April 13\nThe Danforth Music Hall\r\nToronto, ON\r\nDoors 7pm / 19+\n\r\nCollective Concerts Presale starts Wednesday, December 12th at 10am. https://www1.ticketmaster.ca/wintersleep/event/10005589154..."},{"title":"163 John St. : SATURDAY SHOWCASE @ THE CORNER","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-13T04:00:00.000Z","location":"The Corner","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nSATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna b..."},{"title":"#1 Dirty Comedy Show in Canada: The Dirty North sponsored by Fleshlight at Comedy Bar","date":"2019-04-14T02:45:00.000Z","endTime":"2019-04-14T03:55:00.000Z","location":"Comedy Bar","description":"The Dirty North Comedy show is Canada's #1 Dirty Comedy show sponsored by Fleshlight.\nThe Dirty North has sold out over 40 times in the last 4 years with some of the top Comedians in North America who have been featured on Netflix, Comedy Central, Just For Lau..."},{"title":"2019 Saturday Family Clay!","date":"2019-04-13T17:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"LucSculpture","description":"Every Saturday is a family art day at LucSculpture. Call us and book a spot for your family and friends to make clay sculpture and hand built ceramics. We will fire the clay pieces for you! Reunite the family doing art and it is fun for everyone!\nTime: Every S..."},{"title":"2019 Scruff Social","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T02:00:00.000Z","location":"District 28 Bar Bistro","description":"The Scruff Social returns for its third year on April 13th, 2019! Save Our Scruff invites you to join us for an unforgettable night that gives a chance for dog lovers to celebrate, support, and pay tribute to scruff’s past, and those yet to come in our care.\nT..."},{"title":"946 QUEEN ST. EAST : SATURDAY SHOWCASE @ THE CORNER EAST","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-13T04:00:00.000Z","location":"The Corner East","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nSATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna b..."},{"title":"All Fools Arbour Easter Eggs - Holodeck Follies","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T01:30:00.000Z","location":"Comedy Bar","description":"The Dandies present... Holodeck Follies - Spontaneous Star Trek\nCanada's longest running Star Trek parody show for Trekkies and non-Trekkies.\nSaturday, April 13, 2019 8:00 p.m. at Comedy Bar\nAdmission: $15\nFeaturing stand-up comedy from Garrett Jamieson and ou..."},{"title":"Babes Who Brunch by The Ace Class","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T17:00:00.000Z","location":"Joe Bird","description":"Our April Babes Who Brunch features local boss babe Kat Gaskin, a graphic designer, content planning expert, and creator of The Content Planner - the first and only physical planning system for your blog and social content. Kat helps discouraged business owner..."},{"title":"Balls of Fury Dodgeball Tournament","date":"2019-04-13T14:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Bloor C.I.","description":"WHAT:\n6 on 6 Dodgeball Tournament. This is a co-ed tournament (minimum of 2 of each gender on the court at all times). Teams will play a minimum of 4 x 25 minute games. For this tournament, we are accepting both INDIVIDUAL and FULL TEAM registrations!\nREFS:\nYo..."},{"title":"Bar Phlie with DJ More or Les","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T06:00:00.000Z","location":"Farside","description":"No cover! Rapper/producer/DJ More Or Les plays the tunes with a Hip Hop slant to move you, whether it's just a head-nod or a full-on shake-a-thon. You can easily hear A Tribe Called Quest, Dibia$e, J Dilla, Bonobo, TLC, Art of Noise, Roisin Murphy, The Interne..."},{"title":"Black Sheep Comedy's Stand Up @ Big Rock Brewery","date":"2019-04-13T23:30:00.000Z","endTime":"2019-04-14T02:30:00.000Z","location":"Big Rock Brewery","description":"Join Black Sheep Comedy @ Big Rock Brewery in Etobicoke for an incredible night of comedy and delicious craft beer!\nEach ticket comes with a free 12oz beer or pop, and you will see some of the best comedians in the city, including:\nHeadliner Hisham Kelati\nFeat..."},{"title":"BLEACH: All 90's Alternative Video Dance Party","date":"2019-04-13T17:00:00.000Z","endTime":"2019-04-13T07:00:00.000Z","location":"Remix Lounge","description":"Sat April 13, 2019 - Living On Video Presents -\nBLEACH: All 90's Alternative Video Dance Party with DJ Lazarus\nRSVP: https://www.facebook.com/events/2238048292914766/\n(please SHARE and INVITE your friends)\nThe first BLEACH of 2019 in January was so much fun. A..."},{"title":"Brunch and Beach Clean Up!","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Woodbine Beach","description":"A get together for outdoorsy self-identifying women who love the planet and want to meet like-minded others in their community! Join us at a cozy sandwich shop in the beaches for a casual afternoon Woodbine beach clean up!\nBrunch spot: Yum Croissants\nPopular f..."},{"title":"Bump In The Night with special guest DJ Chris Joynt","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T06:00:00.000Z","location":"Swan Dive","description":"👯‍♀️Rock👯‍♂️Soul👯‍♀️Classic Pop👯‍♂️Rarities👯‍♀️\nCOME SHAKE YER RUMP!\n*free*"},{"title":"Cabbagetown Bunny Hop","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T17:00:00.000Z","location":"Carlton and Parliament","description":"Come join the FREE fun including bunny selfies, refreshments, kids activities, free books, music and more."},{"title":"Casual Chess Club","date":"2019-04-13T18:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Join other chess players in a friendly and welcoming environment for casual play. All ages and skill levels are welcome.\nDrop in. No registration required.\nAudiences: Adult • School-Age Children • Teen\nCategories: Hobbies Crafts & Games"},{"title":"Cathedral Bluffs Symphony Orchestra - Elgar, Saint-Saens, and more!","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T02:00:00.000Z","location":"Chinese Cultural Centre of Greater Toronto","description":"The Cathedral Bluffs Symphony Orchestra, under the direction of Norman Reintamm, continues its 2018-19 season with the Annual Fundraising Concert and Silent Auction on Saturday, April 13, 2019 at 8:00 p.m. Silent Auction opens at 7:00pm. Guest artists include ..."},{"title":"Cedarvale Marketplace Day","date":"2019-04-13T14:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Cedarvale Community School","description":"Join us for a memorable shopping and food experience at the annual Cedarvale Marketplace Day on Saturday April 13 from 10:00-4:00! A fabulous way to spend the day! There will be professional vendors with an array of sensational items available in time for Moth..."},{"title":"Creative Tarping Course","date":"2019-04-13T16:00:00.000Z","endTime":"2019-04-13T20:30:00.000Z","location":"High Park Subway Station","description":"Hey folks! Wild Ones Wilderness is teaching a course in Creative Tarping! We will be teaching not only the fundamentals of a good tarp shelter/system but also the fine points and tricks in order for you to use your tarp in the most efficient way for any situat..."},{"title":"Curator's Tour And Neighbourhood Walk","date":"2019-04-13T18:00:00.000Z","endTime":"2019-04-13T19:30:00.000Z","location":"Onsite Gallery","description":"Lisa Deanne Smith, curator of How to Breathe Forever, will guide visitors through a tour of the exhibition, followed by a 30-45 minute walk in the local vicinity, paying special attention and attempting to shift perspectives of how to observe and respect local..."},{"title":"Don Quixote // Performance on Screen","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Cervantes’s story of the bumbling knight Don Quixote has inspired countless artistic interpretations. The Royal Ballet returns to our screen with Marius Pepita’s exuberant take on this joyful classic of love and friendship, revived for 2019 by acclaimed Cuban ..."},{"title":"Editrix, Future Machines, Deanna Petcoff","date":"2019-04-14T01:00:00.000Z","endTime":"2019-04-13T05:30:00.000Z","location":"Handlebar","description":"EDITRIX (https://editrix.bandcamp.com)\nImproviser Wendy Eisenberg stops through Toronto with her rock power trio\nFUTURE MACHINES (https://futuremachinesfuturemachines.bandcamp.com)\nA power trio that digs deep into a sweet spot between math rock and Sonny Sharr..."},{"title":"Foul Play!","date":"2019-04-13T22:30:00.000Z","endTime":"2019-04-14T01:30:00.000Z","location":"The Chelsea Hotel","description":"The intrigue begins when you meet some colourful characters around dessert time., as you finish your fabulous meal. The plot thickens when somebody you've just met... dies! A detective leads the investigation. The suspects are spread throughout the room. So, y..."},{"title":"Hockey Helps the Homeless Bay St. Tournament","date":"2019-04-13T12:00:00.000Z","endTime":"2019-04-13T21:00:00.000Z","location":"Scotiabank Pond","description":"At Hockey Helps the Homeless (HHTH) we believe that everyone should have a place to call home and the supports that they need to thrive. To ensure all homeless Canadians have a fighting chance, we host Pro-Am and Collegiate hockey tournaments across Canada whe..."},{"title":"Horseburner/Jahgernaut/Ol Time Moonshine/Quiet Earth","date":"2019-04-14T01:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Bovine Sex Club","description":"Music for the Masses Presents:\nSat Apr 13 at The Bovine\n- Horseburner (WV)\nhttps://horseburner.bandcamp.com/\n- Jahgernaut\nhttps://jahgernaut.bandcamp.com/\n- Ol' Time Moonshine\nhttps://oltimemoonshine.bandcamp.com/\n- Quiet Earth\nhttps://quietearthtoronto.bandca..."},{"title":"Intrigue at the AGO Scavenger Hunt","date":"2019-04-13T17:00:00.000Z","endTime":"2019-04-13T19:30:00.000Z","location":"Art Gallery of Ontario","description":"A famous artist's suspicious death, a vanished journalist, and the legend of da Vinci's hidden trove converge in this art mystery scavenger hunt inside the AGO.\nWhen an arts journalist digs into the cold case of a local artist from over 100 years ago, she sudd..."},{"title":"Junior Nature Sketch, Toronto","date":"2019-04-13T13:30:00.000Z","endTime":"2019-04-13T16:00:00.000Z","location":"Multiple Venues","description":"Junior Nature Sketch is an outdoor nature program for kids that focuses on sketching and observing wildlife habitats in unique ecosystems. Guided by a sketch artist and a naturalist, this program encourages children to connect to natural environments in their ..."},{"title":"Kicking Math Anxiety in the Butt! JUNIOR EDITION","date":"2019-04-13T13:30:00.000Z","endTime":"2019-04-13T15:00:00.000Z","location":"The Math Guru","description":"Did you know that 85% of all students feel some sort of anxiety when it comes to test taking? Seriously - you're not alone! If you're like most people, you get stressed before tests - and even MORE stressed before exams! Maybe you have a little knot in your st..."},{"title":"Live Music @ Creeds!","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-14T03:00:00.000Z","location":"Creeds Coffee Bar on Dupont","description":"Doors @ 7pm\nShow @ 8pm\nServing beer, wine & coffeebar drinks all night long!\nCome join us for some sweet acoustic tunes!"},{"title":"Lo with Special Guests","date":"2019-04-13T22:00:00.000Z","endTime":"2019-04-14T01:00:00.000Z","location":"The Dakota Tavern","description":"Toronto artist \"Lo\" will be headlining his first show this April 13th at The Dakota Tavern along with 3 special guests. On top of the nights performances, Lo will also be premiering his first music video called \"Fear\" which is the lead single off his newly rel..."},{"title":"Mask Off Gala","date":"2019-04-14T00:30:00.000Z","endTime":"2019-04-13T06:00:00.000Z","location":"Berkeley Church","description":"You are invited to the Inaugural Mask Off Gala hosted by Jaclyn Goman, Toronto fitness expert and mental health advocate, in benefit of the Sunnybrook Hospital Youth Mental Health Program, \"Fresh Start.\"\nThe gala is a black tie, cocktail-style affair featuring..."},{"title":"Neo Retreat","date":"2019-04-13T12:30:00.000Z","endTime":"2019-04-13T17:00:00.000Z","location":"Mindset","description":"a collective of wellness gurus will lead you through a half day in-city retreat to fill you with wellness through breath, movement and self care workshops.\nYou will leave with a lot, including take-home tools and new products so your wellness journey can conti..."},{"title":"OK Ladies!","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-13T05:00:00.000Z","location":"City Dance Corps","description":"Dance the night away and raise money to amplify women’s voices through theatre!\nOK Ladies! offers a safe space for anyone who identifies as a woman and their allies to come together in a celebration of women. Get the party started at 8pm with an optional, all-..."},{"title":"Origins","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T08:00:00.000Z","location":"Bunker","description":"Kaleidoscope welcomes techno artist Rex Sepulveda for his Toronto debut! Rex is renowned in Detroit's thriving underground electronic music scene. Performing alongside him will be local techno staple, Marivs, and longtime contributor to the scene, Jonathan Coe..."},{"title":"Purple Rain // This Film Should Be Played Loud","date":"2019-04-14T01:30:00.000Z","endTime":"2019-04-14T03:30:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"35th Anniversary Screening!\nThis April marks the third year since the world lost music icon Prince. Join us in paying tribute to The Purple One at our annual screening of the 80s cult masterpiece that propelled him to global superstardom. Set against the gritt..."},{"title":"Rage Against The Machine Tribute: No Shelter @ Supermarket Bar","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-14T02:30:00.000Z","location":"Supermarket","description":"Everything can change on a new years day\nThe past sold out shows have proven that the words from street poet Zack De La Rocha, grooves from Tim Commerford and Brad Wilk, and crushing guitar sounds from Tom Morello are not only relevant to this day, but have be..."},{"title":"Rainbow Songs Foundation Family Fundraiser","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Play Loft","description":"Join us for a family friendly fundraiser for the Rainbow Songs Foundation on April 13th from 11am - 2pm.\nNow entering its eleventh year, Rainbow Songs Foundation provides interactive music programs to families with young children staying in emergency short and..."},{"title":"\"Real Life\" an Art Show by: Adam M Lancia x Natalie Schiabel","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-14T03:00:00.000Z","location":"Narwhal Art Projects","description":"Come join Toronto artists Adam M Lancia & Natalie Schiabel for an art show & party at Narwhal Gallery (2104 Dundas St W).\nSaturday April 13th 2019 11am to 11pm!\nFree entry.\nThere will be a Cash Bar.\nAdam M Lancia - www.adamlancia.com\nNatalie Schiabel - www.nat..."},{"title":"Record Store Day 2019 free live show at Tiny Record Shop","date":"2019-04-13T16:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Tiny Record Shop","description":"In partnership with local Precision Record Pressing, Tiny Record Shop is releasing a limited, hand numbered run of 100 copies of Toronto-based Jaunt's new single, \"On Your Mind\" available exclusively at the shop.\nJaunt, Halifax-based Devarrow, and Toronto-base..."},{"title":"Remember Chicago at Bambi's  April 13","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T07:00:00.000Z","location":"Bambi's","description":"We are excited to announce the highly anticipated return of \"Chicago\" on Saturday April 13th, at one of our favourite undergound spot's for dance music in the city! Our first Chicago party at Bambi's was a huge success and we are so excited to bring you the ne..."},{"title":"Romantica","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T01:30:00.000Z","location":"Calvin Presbyterian Church","description":"Presented by the Greater Toronto Philharmonic Orchestra, this event will feature a selection of popular romantic and works under the baton of guest conductor Oliver Balaburski. The first half will include a set of three romantic overtures: Johann Strauss' II o..."},{"title":"Sankofa, part of the film series Resistance & Revolution: The Cinema of Haile Gerima","date":"2019-04-13T22:30:00.000Z","endTime":"2019-04-14T01:00:00.000Z","location":"TIFF Bell Lightbox","description":"Film\nSankofa\nDir. Haile Gerima\n1993 | 125 min\nStarkly aware of the history of slavery in the United States, African American model Mona takes part in a photoshoot at a Ghanaian slave fort. A mystical drummer, calling on the spirits of enslaved ancestors to ret..."},{"title":"Soundwave Cafe: Claire Coupland","date":"2019-04-13T18:30:00.000Z","endTime":"2019-04-13T20:30:00.000Z","location":"Beach United Church","description":"Warm up your afternoon with your friends and neighbours at Soundwave Cafe featuring folksinger/songwriter/guitarist Claire Coupland.\nDrop by anytime between 2:30pm and 4:30pm for great live music and complimentary coffee and tea. Admission is free, donations a..."},{"title":"Spring To Heath","date":"2019-04-13T12:45:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Women On The Move","description":"How to become your best you! A Women's Health and Well Being Event!\nLunch included: Organic, vegan, gluten-free and delicious!\nCatered by The Goods\nSpeakers:\n1) Jill Werner | Neurological Physiotherapist\nBanish Your Brain Fog\nNew technologies you can implement..."},{"title":"Steve Martin and Martin Short in Toronto","date":"2019-04-13T23:30:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Sony Centre for the Performing Arts","description":"Presale is happening now! View Onsale Times\nPublic Onsale Starts Mon 02/11/19 @ 10:00 am EST"},{"title":"STRATFORD FESTIVAL ON FILM - The Tempest","date":"2019-04-13T16:55:00.000Z","endTime":"2019-04-13T19:30:00.000Z","location":"Cineplex Young and Dundas VIP","description":"The Stratford Festival’s latest film, The Tempest, directed for the stage by\nArtistic Director Antoni Cimolino and for the screen by Barry Avrich, premières at Cineplex\ntheatres across Canada on April 13.The stage production was a truly historic event, featuri..."},{"title":"The Keys to Professional Clinical Practice Online Workshop","date":"2019-04-13T13:30:00.000Z","endTime":"2019-04-13T08:30:00.000Z","location":"Miles Nadal JCC","description":"Today, people use the Internet for everything and, increasingly, clients expect to be able to connect with their helping professional online.\nThe only question is whether the professional is ready. Some people suggest that online services are the future of cou..."},{"title":"Toronto Bar Crawl #33","date":"2019-04-13T22:00:00.000Z","endTime":"2019-04-14T03:00:00.000Z","location":"Multiple Venues","description":"Ready to go out drinking in Toronto?\nGet your night out started right with your host Zoubin taking you on a bar crawl.\nZoubin will take you to some of his favorite bars, where we'll have a drink at each bar before moving onto the next.\nThe focus of this bar cr..."},{"title":"Vi & special guests at Adelaide Hall, Toronto","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T03:00:00.000Z","location":"Adelaide Hall","description":"Vi's headlining show in Toronto, ON at Adelaide Hall - as seen on CTV's The Launch!\nWith special guests, WILL and Bella Krys\nSaturday, April 13\nDoors 8pm\n19+\nTickets:\nhttps://www.eventbrite.ca/e/58606800518\n$12 online advance\n$18 at the door\nListen to Vi's deb..."},{"title":"V@M EXHIBITION","date":"2019-04-13T22:00:00.000Z","endTime":"2019-04-13T04:00:00.000Z","location":"The Freedom Factory","description":"The Freedom Factory's Annual Visual Arts Movement!\nCome out and support 60 Toronto Artists as they competing for CASH, Gallery Space & More - Judged by Industry Leaders!!\nLive Entertainment/ Music, Complimentary Food, Cash Bar.\n(competition takes place over 4 ..."},{"title":"WOMAN ON FIRE...Get Inspired Conference  & Awards Gala!","date":"2019-04-13T12:00:00.000Z","endTime":"2019-04-13T22:00:00.000Z","location":"DoubleTree by Hilton Hotel Toronto Airport West","description":"WOMAN ON FIRE ….Get Inspired Conference & Awards Gala 2019…\nWhat started with a handful of women to help the impoverished women and children in Haiti, has now blossomed into a 2 day event in Toronto, Canada bringing together a diverse and unique blend of entre..."},{"title":"WWF's CN Tower Climb for Nature","date":"2019-04-13T10:00:00.000Z","endTime":"2019-04-13T13:30:00.000Z","location":"Metro Toronto Convention Centre (MTCC), Hall A, North Building","description":"Climbing the CN Tower is a rare and exhilarating opportunity to take 1,776 meaningful steps towards a future where nature and wildlife thrive. Register today to climb, enjoy the breathtaking view of Toronto from the tower's newly renovated observation deck and..."},{"title":"Alec Benjamin in Toronto","date":"2019-04-14T23:00:00.000Z","endTime":"2019-04-15T03:00:00.000Z","location":"Mod Club Theatre","description":"Embrace Presents ALEC BENJAMIN Doors: 7pm All Ages/Licensed Event ALEC BENJAMIN https://www.facebook.com/AlecBenjaminMusic/ https://twitter.com/alecbenjamin https://www.instagram.com/alecbenjamin/"},{"title":"Etsy Team Toronto - Spring Market","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T21:00:00.000Z","location":"The Great Hall","description":"Want to put a spring in your step? Easy, Toronto meet your markers! That's right meet, shop and discover all the local talent Toronto has to offer! Join us Sunday April 14 2019 10am-5pm and meet a curated selection of Toronto's most noteworthy Etsy sellers and..."},{"title":"Evergreen's Drop, Swap & Shop","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Evergreen Brick Works","description":"Have a funky purse sitting in your closet that was just never “you”? Been searching for a pair of rollerblades or a record to add to your collection? Try swapping instead of shopping at our Swap Mall. Bring in up to 20 items in exchange for tickets that can be..."},{"title":"SWMRS","date":"2019-04-14T23:00:00.000Z","endTime":"2019-04-15T03:59:00.000Z","location":"Phoenix Concert Theatre","description":"Collective Concerts & Indie88 Present\nSWMRS: BERKELEY’S ON FIRE\nThe Regrettes, Beach Goons\nSunday Apr 14, 2019\nDoors: 7:00 PM\nAll Ages\n$22\nPhoenix Concert Theatre \n410 Sherbourne Street \r\nToronto, Ontario \nAdvance tickets also available at Rotate This & Sounds..."},{"title":"163 John St. : THE DANGER ROOM @ THE CORNER","date":"2019-04-15T01:00:00.000Z","endTime":"2019-04-14T04:00:00.000Z","location":"The Corner","description":"THE DANGER ROOM\nHOSTS: DAN GUIRY & MORGAN O'SHEA\n'The Danger Room' is marathon style show with a variety of professional and amateur comedians testing their most dangerous and explicit material. Audience members are encouraged to boo and heckle comedians durin..."},{"title":"2019 Acrylic Pour Painting Workshops","date":"2019-04-14T13:30:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"LucSculpture","description":"Come to join this acrylic pour painting workshop in Toronto and have the very best time and results. Even if you have already done pours you will be surprised and delighted by what you do.\nDates: Various dates, 9:30 am to 4:00 pm, Apr. 14 (Sun), May 5 (Sun), a..."},{"title":"946 QUEEN ST. EAST : SUNDAY BEST @ THE CORNER EAST","date":"2019-04-15T00:00:00.000Z","endTime":"2019-04-14T04:00:00.000Z","location":"The Corner East","description":"Every Sunday at The Corner Comedy Club EAST, TAMARA SHEVON will be hosting SUNDAY BEST! A lineup of Canada’s best comedians.\nThere's gonna be 2 shows, 8PM & 10PM, each with a different set of comics. Credits include Just For Laughs, JFL 42, CBC, Comedy Network..."},{"title":"April Podcast Brunch Club Meetup - Special DOUBLE Listening List Meeting","date":"2019-04-14T17:00:00.000Z","endTime":"2019-04-14T19:00:00.000Z","location":"Artful Dodger","description":"Join us at the April Toronto Podcast Brunch Club meeting for a very special DOUBLE listening list meeting!\nWe will be discussing the podcast listening lists \"Language\" and \"The Evolution of Libraries.\"\nAll are welcome! Whether you listened to the list or not, ..."},{"title":"Beethoven's Hair // Doc Soup Sundays","date":"2019-04-14T15:00:00.000Z","endTime":"2019-04-14T17:09:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Doc Soup Sundays: From rarely seen gems to new biographies, Doc Soup Sundays rounds up the best arts and culture documentaries and pairs them with special guest Q&As.;\nHow does a lock of Beethoven’s famously mad hair end up in the hands of Arizona residents Ir..."},{"title":"BootCAMP & Beer V8 with Camp Fuel","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T16:00:00.000Z","location":"Left Field Brewery","description":"Get your bootCAMP class provided by CAMP FUEL , then beer right after! It's called balance. Expect a full body workout, partner drills and a lot of high fives all inside Left Field Brewery! We'll combine strength, conditioning and motivation to work off the ca..."},{"title":"CAPS Ontario presents The Best Ontario Sommelier Competition April 14","date":"2019-04-14T15:00:00.000Z","endTime":"2019-04-15T03:00:00.000Z","location":"The Arcadian Court","description":"The Ontario chapter of the Canadian Association of Professional Sommeliers (CAPS Ontario, http://sommelierscanada.com/ontario/) is delighted to unveil its largest and most diverse wine and food event of its kind in the province, the Best Ontario Sommelier Comp..."},{"title":"Compassionista: An Ethical Fashion Show","date":"2019-04-14T18:30:00.000Z","endTime":"2019-04-14T21:30:00.000Z","location":"The Right Side Boutique","description":"Are you into ethical and cruelty-free fashion, veganism and zero waste? We're hosting a fun Toronto event that you might love at our shop this April -- Compassionista: An Ethical Fashion Show! We hope to see you there. The event will feature sweatshop-free clo..."},{"title":"DakhaBrakha","date":"2019-04-14T23:00:00.000Z","endTime":"2019-04-15T01:00:00.000Z","location":"Koerner Hall","description":"Ukrainian “ethnic chaos” blending Ukrainian harmonies, contemporary roots and rhythms, surprising instrumentation, and theatrical flourishes. At the crossroads of Ukrainian folklore and theatre, their performances are both intimate and riotous.\nPresented in pa..."},{"title":"Extraordinary Women: Baroque Painter Artemisia Gentileschi","date":"2019-04-14T15:00:00.000Z","endTime":"2019-04-14T17:00:00.000Z","location":"Revue Cinema","description":"The painting is shocking for its violence and the calm determination of the women. The artist is Artemisia Gentileschi, born in 1593; the subject is the biblical story of Judith, a beautiful Jewish widow who beheaded an inebriated Assyrian general sent to dest..."},{"title":"Fan Appreciation Night: Toronto Marlies vs Cleveland Monsters","date":"2019-04-14T20:00:00.000Z","endTime":"2019-04-14T22:30:00.000Z","location":"Coca-Cola Coliseum","description":"Join us on April 14th for the final game of the regular season when we celebrate YOU, our incredible fans. We’ll have giveaways throughout the game as our way to say thank you for your support all season."},{"title":"Female Founders Shopping Event","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Toronto Designers Market","description":"Discover some amazing new local female-led brands at Toronto Designers Market! During this shopping event, you will have the opportunity to meet some courageous female founders and learn why they started their businesses and how they overcame obstacles to brin..."},{"title":"Girl Gang Cabarets","date":"2019-04-14T21:30:00.000Z","endTime":"2019-04-15T01:00:00.000Z","location":"Painted Lady","description":"Girl Gang Cabarets is an unboxed variety show at The Painted Lady.\nAn inclusive safe space to meet, empower, and share stories with all kinds of feminists. The Spring Edition features:\nBurlesque By Red Tongued Raven\nPoetry by Robyn Sidhu\nComedy by Arianne Tong..."},{"title":"Healthy Moms Toronto Marketplace","date":"2019-04-14T13:30:00.000Z","endTime":"2019-04-14T19:30:00.000Z","location":"Artscape Wychwood Barns","description":"The Healthy Moms Toronto Marketplace is a FREE event for the whole family featuring a curated selection of natural/organic/sustainable items. Enjoy healthy food options and complimentary onsite childcare while you check out new products and do a little shoppin..."},{"title":"Ice & Fire - Beer and Spicy Food Pairings","date":"2019-04-14T20:00:00.000Z","endTime":"2019-04-14T22:00:00.000Z","location":"People's Pint","description":"Sommelier Sundays continue with our next installment \"Ice and Fire\". In honour of the premiere of the 8th and final season of Game of Thrones we thought we would get everyone fired up for it. We will have 4 separate samples of spicy foods and we will pair them..."},{"title":"Just About Married - Mock Wedding Show","date":"2019-04-14T17:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"The Fifth Social Club","description":"There’s no such thing as a one-size-fits-all wedding, so there shouldn’t be a one-size-fits-all wedding show either. Tired of the same boring trade shows with pushy sales pitches? Same. That’s why we created Just (About) Married, a wedding experience for coupl..."},{"title":"LARK Ensemble presents - Exuberance: Roberta Janzen in recital","date":"2019-04-14T23:30:00.000Z","endTime":"2019-04-15T01:30:00.000Z","location":"Corkin Gallery","description":"LARK Ensemble's cellist Roberta Janzen invites us to share her connection with this majestic instrument and its repertoire. Two solo cello works frame the program: Bach's optimistic and energetic third Suite, and Kodaly's impassioned Solo Sonata. In Ravel's lu..."},{"title":"Meeting Pointe","date":"2019-04-14T19:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Union Station","description":"An afternoon of new ideas in contemporary ballet with live music\nCelebrate the arrival of spring with the beauty of ballet on Sunday, April 14 with Meeting Pointe, a FREE afternoon of contemporary ballet and live music in Union Station’s newly revitalized hist..."},{"title":"Modified A Food Lovers Journey into GMOs","date":"2019-04-14T20:00:00.000Z","endTime":"2019-04-14T22:00:00.000Z","location":"Metro Toronto Convention Centre","description":"Join Kids Right to Know for an inspirational screening of Modified: A Food Lover’s Journey into GMOs at the Total Health Show. The film screening of Modified will be followed by a Q&A; with Rachel Parent, a raffle, and an opportunity to learn, exchange seeds a..."},{"title":"New Orford String Quartet","date":"2019-04-14T19:15:00.000Z","endTime":"2019-04-14T21:15:00.000Z","location":"Walter Hall, Edward Johnson Building, University of Toronto","description":"Violinists Jonathan Crow and Andrew Wan are concertmasters of the Toronto and Montreal Symphony Orchestras, Brian Manker is principal cello in Montreal and Eric Nowlin, principal viola at the Detroit Symphony. They formed in 2009, following the footsteps of th..."},{"title":"NICK MACLEAN QUARTET feat. BROWNMAN ALI","date":"2019-04-15T00:00:00.000Z","endTime":"2019-04-15T03:00:00.000Z","location":"La Revolucion","description":"NICK MACLEAN QUARTET feat. BROWNMAN ALI (Toronto)\nLa Rev | www.LaRevTO.com\nToronto, ON - 2848 Dundas St W, M6P 1Y9\nSUN-APR-14, show @ 8:00pm\n$15 door, $10 adv list (email nickmacleanquartet@gmail.com for adv list)\nFB Event: https://www.facebook.com/events/4665..."},{"title":"Night of the Lepus","date":"2019-04-14T23:30:00.000Z","endTime":"2019-04-15T03:00:00.000Z","location":"Handlebar","description":"Giant mutant rabbits attack people in this 1972 cautionary tale of \"what if science, but too much??\"\nNight Of The Lepus stars Janet Leigh and DeForest Kelley, and is based on a novel from 1964... yes, multiple people committed to this idea on more than one occ..."},{"title":"Outdoor Matzah Bake","date":"2019-04-14T18:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Dufferin Grove Park","description":"Join Makom: Creative Downtown Judaism for a fun afternoon making and baking Matzah in an outdoor, wood-burning oven!\nSee if you can mix, knead, roll and bake in 18 minutes or less! (Matzah won't be kosher for Passover but it's still a wonderful way to prepare ..."},{"title":"Shakespeare and the ROM","date":"2019-04-14T14:30:00.000Z","endTime":"2019-04-14T19:30:00.000Z","location":"Royal Ontario Museum","description":"Explore the life and times of William Shakespeare through the ROM’s collections. With the opportunity to handle authentic objects, this workshop investigates some of the most serious religious and political issues of Shakespeare’s day, as well as some of the m..."},{"title":"Skate for Sarah","date":"2019-04-14T11:00:00.000Z","endTime":"2019-04-14T21:00:00.000Z","location":"Canlan Ice Sports Arean","description":"On Sunday, April 14th, 2019, JCC Chai Sports is hosting the 4th annual Skate for Sarah Charity Hockey Tournament at\nCanlan Arena – York University Campus.\nThis Action-Packed Day Features:\n• Competitive high-level hockey\n• Fun for the whole family\n(including a ..."},{"title":"Spoken Word Workshop & Open Mic -- \"The Ecology of Story: Writing with Mother Earth\"","date":"2019-04-14T19:00:00.000Z","endTime":"2019-04-15T01:30:00.000Z","location":"University of Toronto Scarborough","description":"Introductory Spoken Word Workshop @3pm-5:30pm, room MW130, with spoken word artists Sheniz Janmohamed and Mahlikah Awe:ri Enml'ga't Saqama'sgw (The Woman Who Stands and Walks In The Light).\nOpen Mic @7:30pm in room MW130 (workshop participants are encouraged, ..."},{"title":"Sports Cards & Memorabilia Show","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Montecassino Hotel & Event Venue","description":"Sports Card Extravaganza! $2 Admission! Free Parking! 50 Vendor Tables including baseball, basketball, football, hokey cards! Autographed memorabilia, Game Used Jersey Cards, Photos, Game Tickets, and so much more! 10AM-3PM - Tons of free parking next door too"},{"title":"The Blue City - An Introduction to the Arts & History of Jodhpur","date":"2019-04-14T14:30:00.000Z","endTime":"2019-04-14T19:30:00.000Z","location":"Royal Ontario Museum","description":"Discover the history of Jodhpur through an exploration of its arts from the 18th to 20th centuries with expert Akshaya Tankha of the University of Toronto. Reflect on the aesthetic traditions, religious practices, social conventions, and cultural exchange in t..."},{"title":"The Texas Comedy Massacre 2","date":"2019-04-15T00:00:00.000Z","endTime":"2019-04-15T02:00:00.000Z","location":"Fox and Fiddle (Wellesley)","description":"Killer Standup Comedy from Canada's top comics in an\nintimate perfect-for-comedy venue 12 years running.\nGreat lineup of ALL PRO's this month! NO COVER\nCome see our new regular host,\nTed Morris, Canada's funniest vet!\nThis month featuring\nNile Seguin (Just for..."},{"title":"Toronto Real Estate Flipping for Profit seminar","date":"2019-04-14T13:00:00.000Z","endTime":"2019-04-14T18:00:00.000Z","location":"Westin Prince Hotel Toronto","description":"Flipping houses for instant profit LIVE crash course.Only for action-takers who strive for excellence, and along with learning from the experts with proven track record, Getting local properties quickly flipped, for maximum profit in the shortest time. http://..."},{"title":"Voice Discovery Singalong & Meditation","date":"2019-04-14T19:00:00.000Z","endTime":"2019-04-14T21:00:00.000Z","location":"Lululemon Queen Street","description":"If you knew what took place within these walls, you wouldn’t believe your ears! This workshop is a brave space with a special focus on anyone who identifies as “shy” with their singing. We will join together, find our centre through guided meditation, and then..."},{"title":"Yoga Nidra & Sound Healing","date":"2019-04-14T23:30:00.000Z","endTime":"2019-04-15T01:30:00.000Z","location":"The House of Yoga","description":"Join Jesse Buck and Adalena Franford as they co-create a restful and rejuvenating night of Yoga Nidra with Crystal Singing Bowl Soundbath experience.\nDuring a yoga nidra, also known as \"sleep yoga\" you’ll be led into a deep relaxed state, similar to the state ..."},{"title":"Youth Speaker Slam: 18 & Under Speaking Competition","date":"2019-04-14T16:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"CSI Annex Garage","description":"Young people today will become the leaders of tomorrow and at Youth Speaker Slam our mission is to be the catalyst that propels young leaders forward by providing them with a platform to share their inspiring stories and revolutionary ideas.\nThis coming April ..."},{"title":"163 John St. : DO OR DIE OPEN MIC @ THE CORNER","date":"2019-04-16T00:00:00.000Z","endTime":"2019-04-16T03:00:00.000Z","location":"The Corner","description":"HOSTS: JOEY HARLEM & JEREMY DOBSKI The Corner Comedy Club weekly Open Mic Monday Nights at 8PM - 11PM Amateurs, Pros and Room Regulars get up on stage and try out something new! DURATION: 180 MINUTES $5 TICKETS TICKETS AVAILABLE @ thecornercomedy.com SIGN UP E..."},{"title":"A Tale of Suspense - Money Monster - 2016 Movie","date":"2019-04-15T22:00:00.000Z","endTime":"2019-04-15T23:45:00.000Z","location":"Brentwood Library","description":"Lee Gates is a TV personality whose insider tips have made him the money guru of Wall Street. When Kyle loses all of his family's money on a bad tip, he holds Lee and his entire show hostage on air threatening to kill Lee if he does not get the stock up 24 and..."},{"title":"Clown Masterclass with Aitor Basauri","date":"2019-04-15T14:00:00.000Z","endTime":"2019-04-15T21:00:00.000Z","location":"Sweet Action Theatre","description":"REGISTER BY APRIL 1ST: $475 (COUPON CODE Q2SVYL8)\nREGISTER AFTER APRIL 1ST: $550\nMonday April 15th - Friday April 19th\n10am - 5pm each day\nWHAT IS THE CLOWN MASTERCLASS?\nIn the Spymonkey clown masterclass, you will learn to discover what makes you funny, hone ..."},{"title":"CREATING A HAPPY WORKPLACE - A Workshop","date":"2019-04-15T13:00:00.000Z","endTime":"2019-04-15T16:30:00.000Z","location":"Centre For Social Innovation","description":"The science is in. Creating a happy work environment has a profound impact on a company's bottom line. So why doesn't every company focus on creating happiness at work? The problem is there's a lot of confusion and misinformation on what actually makes someone..."},{"title":"Free Japanese Film Screening! Final Straw","date":"2019-04-15T22:30:00.000Z","endTime":"2019-04-16T00:30:00.000Z","location":"The Japan Foundation","description":"This spring, we will feature a series of films, CHIKYU FILMS, which will share the stories and people who examine the close relationship to our environment, our earth, or Chikyu 地球 in Japanese.\nFINAL STRAW\nDocumentary by Patrick Lydon and Suhee Kang (2015) 74 ..."},{"title":"Fresh Jokes volume 2","date":"2019-04-16T01:30:00.000Z","endTime":"2019-04-16T02:30:00.000Z","location":"Social Capital Theatre","description":"Welcome to Fresh Jokes: a variety show where sketch comedians and musical comedians present their newest, freshest...jokes.\nFeaturing:\nAnesti Danelis\nChris Middleton\nCameron Wyllie\nThe Utilidors\nSuper Cool Oh Yes\nCereal in a Mason Jar\nSwing by and have a look ..."},{"title":"momondays","date":"2019-04-15T21:30:00.000Z","endTime":"2019-04-16T01:30:00.000Z","location":"The Hideout","description":"Put story-telling into a blender. Add a dash of personal growth & transformation. Then drop in a load of laughs. Mix in real, live music, and great conversation with some of the nicest people on the planet, then push the ‘high’ setting… and out comes momondays..."},{"title":"Open Studio","date":"2019-04-15T14:00:00.000Z","endTime":"2019-04-15T22:00:00.000Z","location":"Union Station","description":"Today we welcome you to our Open Studio, a dance studio without walls. Take a behind-the-scenes glimpse into the creative working processes of renowned dance artists and choreographers as they rehearse an upcoming performance or lead a professional class. Stay..."},{"title":"Opera Express Boheme on the go","date":"2019-04-15T14:00:00.000Z","endTime":"2019-04-15T22:00:00.000Z","location":"Union Station","description":"Union and the Canadian Opera Company serve up a commuter-friendly performance of the beautiful – and beloved — La Bohème. Stay for the 45-minute version of the opera or drop in to hear a few of its greatest hits. Trust us: you’ll want to take the later train."},{"title":"Rally For Climate Action","date":"2019-04-15T16:30:00.000Z","endTime":"2019-04-15T17:30:00.000Z","location":"Osgoode Hall Courthouse","description":"The Ontario Government is going to court to undermine Canada's plan to tackle climate change. Join us for a lunchtime rally on Monday April 15 - outside the Osgoode Hall Courthouse - to tell Ontario to stop wasting our money in court and to start fighting clim..."},{"title":"RUN THE FLEX BEGINNER HIP HOP DANCE PROGRAM","date":"2019-04-16T00:30:00.000Z","endTime":"2019-04-16T02:30:00.000Z","location":"Pia Bowman","description":"APRIL 15 - JUNE 3, 2019\n*No class April 22 or May 20\nWhen: Mondays, 8:30PM - 10:30PM\nWhere: Pia Bouman (6 Noble St., Toronto)\nLevel: Beginner - NO previous dance experience required\nThis 6-week hip hop dance program is designed to help you build confidence in ..."},{"title":"Run The Flex Beginner Hip Hop Workshop","date":"2019-04-16T00:30:00.000Z","endTime":"2019-04-16T02:30:00.000Z","location":"Dance Teq","description":"Run The Flex's 6-week hip hop dance programs are designed to help you build confidence in your dancing, work up a sweat and have fun. If you're looking to find your inner dancer...you've come to the right place.\nAPRIL 15 - JUNE 8, 2019\n*No class April 22 or Ma..."},{"title":"Sedges & Grasses","date":"2019-04-15T23:00:00.000Z","endTime":"2019-04-16T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Grasses offer structural interest throughout the year, increase biodiversity and add sound and movement to the garden. Their close relatives, sedges, are indispensable in the fast-growing area of rain gardens. Broaden your horizons with these often overlooked ..."},{"title":"TechTO - April Edition","date":"2019-04-15T22:00:00.000Z","endTime":"2019-04-16T01:00:00.000Z","location":"RBC WaterPark Place","description":"TechTO events bring together Toronto’s tech leaders, innovators, and enthusiasts.\nThe speakers: highly curated leaders & innovators sharing their expertise & experiences through 5 minute TED-style presentations\nThe format: mingling & drinks > demos & showcases..."},{"title":"THE OTHER SHELF. Kathy Wang: Family Trust","date":"2019-04-15T22:00:00.000Z","endTime":"2019-04-15T23:00:00.000Z","location":"Toronto Public Library","description":"This event is part of the Toronto Public Library's new literary series, The Other Shelf, where TPL presents exceptional writers in a smaller space. This event is held in the Novella Room in the Bram & Bluma Appel Salon.\nTickets are available at no cost at the ..."},{"title":"Workout & Work with Camp Fuel","date":"2019-04-15T12:00:00.000Z","endTime":"2019-04-15T21:00:00.000Z","location":"Project Spaces","description":"Let's workout and then work together!\n8-9am workout\n9-5 work\nThis is the perfect opportunity to start your week off right, with a workout & a day pass at Project Spaces. This is an opportunity to get your workout in, meet amazing new people & get work done!\nCA..."},{"title":"Dizzy","date":"2019-04-17T00:00:00.000Z","endTime":"2019-04-17T03:00:00.000Z","location":"Mod Club","description":"Embrace and Indie88 Present DIZZY Doors: 8pm All Ages / Licensed Event DIZZY https://www.facebook.com/wearedizzy/ https://twitter.com/dizzytheband?lang=en https://www.instagram.com/dizzytheband/"},{"title":"Fireside Tales: Year 6, Season Opener","date":"2019-04-17T00:00:00.000Z","endTime":"2019-04-17T01:30:00.000Z","location":"Dufferin Grove Park","description":"The coziest storytelling show is returning for its SIXTH year! Come join hosts Helder Brum & Dan Galea around the fire as they bring together some of the best storytellers in the city! BRING BLANKETS, SNACKS, AND FRIENDS! We'll bring the hot cocoa and marshmal..."},{"title":"13th ANNUAL 2019 ART GEMS AUCTION","date":"2019-04-16T21:00:00.000Z","endTime":"2019-04-17T02:00:00.000Z","location":"Berkeley Church, Toronto","description":"Art Gems is one of the city’s premiere art auctions, with over 500 attendees, including industry leaders, corporate sponsors, donors, Canada’s top artists and gallery owners, as well as Creative Works Studio members. Art Gems raises funds in support of Creativ..."},{"title":"Beeswax Candle Making at Toronto Botanical Garden","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Learn how to make three different kinds of beeswax candles: rolled sheets, dipped tapers and poured mould candles. Participants will go home with their own handmade candles."},{"title":"Canadian Children's Opera Company's Junior Open House","date":"2019-04-16T20:30:00.000Z","endTime":"2019-04-16T22:30:00.000Z","location":"First Unitarian Congregation","description":"Does your child love music, drama, and theatre?\nGreat! They're just who we're looking for.\nJoin us on April 16 to see what a CCOC music education looks like and find out more about our programs for kids aged 5 and up.\n4:45 - 5:45 Butterfly Chorus (JK & SK)\n5:4..."},{"title":"Can You Do Lunch? 2019","date":"2019-04-16T15:30:00.000Z","endTime":"2019-04-16T17:30:00.000Z","location":"Four Seasons Toronto","description":"There are over 63,000 people in Canada living with HIV and it is estimated that six people in Canada become newly infected with HIV each day, or nearly one person infected every four hours. It’s time to act.\nOn Tuesday, April 16, 2019, the Canadian Foundation ..."},{"title":"CJF J-Talk: Fallout from the Field","date":"2019-04-16T22:00:00.000Z","endTime":"2019-04-17T00:00:00.000Z","location":"TD Bank Tower","description":"After witnessing the horrors of war, natural disasters or local crime stories, journalists must often cope with emotional trauma, moral quandaries and PTSD. How can reporters—and newsrooms—manage the personal impact of covering stories that involve human cruel..."},{"title":"Digital Nomads and Remote Work Event","date":"2019-04-16T22:00:00.000Z","endTime":"2019-04-17T00:00:00.000Z","location":"WeWork","description":"Come join us at WeWork Richmond St. for a digital nomad and remote work event! We'll be sharing advice on how to build a personal platform, attract more clients, work remotely, and live the life of a digital nomad!\nThere will be 3-4 quick presentations on how ..."},{"title":"Discover Dance with Nivedha Ramalingham","date":"2019-04-16T16:00:00.000Z","endTime":"2019-04-16T17:00:00.000Z","location":"Toronto Centre for the Arts, Upper Gallery","description":"Discover Dance is a free all-ages lunch series where you will be introduced to some of Toronto’s incredible dance artists. Hosted by the award-winning choreographer Nova Bhattacharya of Nova Dance.\nNivedha Ramalingam is an emerging talent who is burning up sta..."},{"title":"EARTH: An Earth Day Celebration - EARLY BIRD TICKETS ON SALE NOW!","date":"2019-04-16T22:30:00.000Z","endTime":"2019-04-17T02:00:00.000Z","location":"Winchester Dance Theatre","description":"Explore our world through film, food, insight from thought-provoking speakers and meet like-minded and like-hearted individuals through engaging activities.\nMeet Canadian outdoor culture filmmaker Jordan Manley and screen his latest documentary film on forests..."},{"title":"Eatable Films x Hot Docs: Red Chef Revival - World Premiere","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T00:48:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Explore the power of reconciliation through food at the world premiere of the anticipated new docu-series, Red Chef Revival.\nA long-neglected culinary tradition, Indigenous cuisine is being reclaimed and reinvented by a new guard of chefs from across Canada. B..."},{"title":"Jeffrey S. Rosenthal: Knock on Wood","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T00:00:00.000Z","location":"Brentwood Library","description":"For centuries, people around the world have prayed for good luck and warded against bad. Every language features a good luck greeting. Sailors have long looked for an albatross on the horizon as a symbol of good fortune. Jade, clovers, rabbits' feet, wishbones..."},{"title":"Launch for The Seed by Alexandra Kimball","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-16T04:00:00.000Z","location":"The Ossington","description":"Join us to celebrate the Toronto Lit Up launch of The Seed, Infertility is a Feminist Issue (Coach House Books) by Alexandra Kimball at the back room of The Ossington!"},{"title":"Panel Discussion: Impact of Independent Music Magazines on Toronto' Hip Hop Scene","date":"2019-04-16T22:30:00.000Z","endTime":"2019-04-16T23:30:00.000Z","location":"Beeton Hall, Toronto Reference Library","description":"Journalists and Magazine Publishers explore the impact of independent music magazines such as Mic Check, WORD, Peace, Pound and Urbanology, in the 1990s and 2000s."},{"title":"PowerPoint Basics 3","date":"2019-04-16T17:00:00.000Z","endTime":"2019-04-16T19:00:00.000Z","location":"Brentwood Library","description":"Using PowerPoint 2013, learn how to add pictures, animate objects, and more. Basic keyboarding and mouse skills required.\nRegister in person at the Information Desk or by calling 416-394-5240."},{"title":"Retail Job Fair","date":"2019-04-16T14:00:00.000Z","endTime":"2019-04-16T18:30:00.000Z","location":"Toronto Reference Library","description":"On Tuesday April 16th, 2019, there will be 20+ retailers with over 500 job opportunities. Please dress for success, bring 15+ copies of your resume and keep connected with your Job Developers and Employment Coaches from to prepare, prior to this job fair."},{"title":"Supporting the Parenthood Journey: A conversation with Ann Douglas and Amanda Munday","date":"2019-04-16T21:00:00.000Z","endTime":"2019-04-16T23:30:00.000Z","location":"The Workaround","description":"Join Ann and Amanda for an in-depth conversation about the intersection of parenthood and mental health and how we can support each other as parents, colleagues, and neighbours.\n*Please note this event is scheduled at a family-friendly time, will include snack..."},{"title":"The Facebook Fix: How to Get Your Content Seen","date":"2019-04-16T17:00:00.000Z","endTime":"2019-04-16T20:00:00.000Z","location":"Camp Tech","description":"If your organization has a Facebook business page and you’re comfortable with the basics, but you find yourself asking “now what?”, then this workshop is for you. We’ll show you how to develop content that will break through the algorithm and get noticed (and ..."},{"title":"THE OTHER SHELF. Kathy Wang: Family Trust","date":"2019-04-16T22:00:00.000Z","endTime":"2019-04-16T23:00:00.000Z","location":"Toronto Public Library","description":"This event is part of the Toronto Public Library's new literary series, The Other Shelf, where TPL presents exceptional writers in a smaller space. This event is held in the Novella Room in the Bram & Bluma Appel Salon.\nTickets are available at no cost at the ..."},{"title":"Toronto Lit Up: Alexandra Kimball","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T01:00:00.000Z","location":"The Ossington","description":"Alexandra Kimball is releasing The Seed: How the Feminist Movement Fails Infertile Women and will be celebrating its publication with a Toronto Lit Up book launch! Join Coach House Books and the Toronto International Festival of Authors for this exciting event..."},{"title":"Toronto Sales & Marketing Job Fair","date":"2019-04-16T17:00:00.000Z","endTime":"2019-04-16T19:00:00.000Z","location":"Jobs Canada Fair","description":"Looking for Work? Immediate Hiring?\n\r\nDO NOT MISS THE SALES & MARKETING JOB FAIR:\r\nTIME: 1:00PM TO 3:00PM\r\nLOCATION: First Canadian Place, 56th floor\r\nADDRESS: 100 King Street West, Toronto, ON M5H 1A1.\n\r\nMEET FACE TO FACE WITH HIRING COMPANIES IN SALES & MARK..."},{"title":"163 John St. : DIRTY WEDNESDAY @ THE CORNER","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-17T04:00:00.000Z","location":"The Corner","description":"A weekly showcase of some of the dirtiest/uncensored comics in Toronto & It's taking place at the newest, hottest comedy club, THE CORNER! Two shows NOW! @ 8 & 10 PM, comedians credits include Just For Laughs, JFL 42, CBC, Comedy Network + more. Everything Dir..."},{"title":"2019 Drop IN Figure Drawing","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T01:30:00.000Z","location":"LucSculpture","description":"Come to LucSculpture on Wednesday night, 6:30 – 9:30 pm, for drop-in figure drawing Toronto sessions! We have a different model each week. Enjoy the relaxing atmosphere!\nTime: January 23rd to June 19th, 6:30 pm to 9:30 pm\nDrop-in: $20, session passes (12 sessi..."},{"title":"2019 Election Pop-Up Panel: Polling, Voter Engagement and Get Out the Vote","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Centre for Social Innovation, The Atrium","description":"With the federal election getting closer each day, Equal Voice Toronto has been hosting a series of panels on topics that will be useful to anyone interested in getting involved- whether as a candidate, volunteer or just someone who's interested in learning mo..."},{"title":"946 QUEEN ST. EAST : THE RENEGADE SHOW @ THE CORNER EAST","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-17T04:00:00.000Z","location":"The Corner East","description":"Every Wednesday at The Corner Comedy Club EAST, the young killer Kyle Lucey will be hosting THE RENEGADE SHOW! A lineup of Canada’s best comedians showcasing dark and twisted material.\nFeaturing comedians from Just For Laughs, CBC, Sirius XM, and The Comedy Ne..."},{"title":"Ambient Ping: Hypnagogue, ortiz","date":"2019-04-18T00:30:00.000Z","endTime":"2019-04-18T03:30:00.000Z","location":"Handlebar","description":"THE AMBiENT PiNG presents Hypnagogue + ortiz + General Chaos Visuals\n.. 9.00 . ortiz creates dark, dub-inflected soundscapes that evoke the chaotic beauty of urban decay. Crumbling static gives way to ghostly vocals, distant melodies and rumbling low-end, taki..."},{"title":"#BotTO Natural Language Processing for Chatbots with Rasa","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T00:30:00.000Z","location":"OneEleven","description":"Hello!\nDuring this event, we will discuss the latest trends in Natural Language Processing (NLP) and Understanding (NLU) for developing chatbots.\nSCHEDULE:\n6.30 pm: Registration, networking with snacks and drinks sponsored by Rasa »https://rasa.com\n7:00 pm: \"B..."},{"title":"Children's Anxiety: Parent Information Nights","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Humber College Medical Centre","description":"Support and information are provided to assist you to integrate neuroscience and child development theory into your own personal style of parenting. The aim is to reduce anxiety and promote emotion regulation."},{"title":"COMPOSITION: A Poetry Workshop by roseate magazine feat. Cody Caetano","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T01:30:00.000Z","location":"Kotn","description":"This one’s for the poetry heads out there. COMPOSITION is a part of a series of workshops being introduced by roseate magazine. Hosted at KOTN, this session will take place on WED APR 17 from 8:00PM-9:30PM, and will be focusing on the art of writing poetry, wi..."},{"title":"Discover Dance with Nivedha Ramalingham","date":"2019-04-17T16:00:00.000Z","endTime":"2019-04-17T17:00:00.000Z","location":"Sony Centre for the Performing Arts, Lower Lobby","description":"Discover Dance is a free all-ages lunch series where you will be introduced to some of Toronto’s incredible dance artists. Hosted by the award-winning choreographer Nova Bhattacharya of Nova Dance.\nNivedha Ramalingam is an emerging talent who is burning up sta..."},{"title":"Excel Basics 2","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Brentwood Library","description":"Learn to create charts and tables, sort your data, and more, using Microsoft Excel 2013. Pre-requisite: Excel Basics Part 1 or a basic knowledge of Microsoft Excel. Basic keyboarding and mouse skills required.\nRegister in person at the Information Desk or by c..."},{"title":"George Brown College presents: Jewels 2019","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T03:59:00.000Z","location":"TIFF Shop","description":"Please join the George Brown College Jewellery Arts class of 2019 in celebrating their graduation exhibition. Support local artists and come see collections created by tomorrow's contemporary jewellery designers. Opening reception: April 17th 6pm. All jeweller..."},{"title":"Grow Op 2019 at the Gladstone","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Gladstone Hotel","description":"Grow Op at the Gladstone Hotel celebrates its seventh year with an exhibition of art, design and ideas on urbanism, landscape design, and contemporary art.\nThe 2019 edition considers ENERGY; Clean energy, dirty energy, social energy, positive energy, negative ..."},{"title":"Hart House Art Committee \"Syncopation: Jazz Night & Silent Auction\"","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Hart House Debates Room","description":"Art and jazz -- what more could you ask for? Join the Hart House Art Committee at our silent auction and jazz night on April 17th at the HH Debates Room to view original student art, set to the backdrop of live music from the Hart House Jazz Ensemble.\nFree adm..."},{"title":"Harvest Wednesdays Launch: Strolling Dinner, Wine Tasting & More","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Gladstone Hotel","description":"We start our seasonal farm food series with a conjuring from the earth. Enter the hotel ballroom and notice the energy embodied within a mound of dirt.\nTaste the flavours of latent winter and nascent spring. Cellared, fermented, sprouted, deep-winter green-hou..."},{"title":"Humber College Industrial Design Thesis Show","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Ontario Science Center","description":"The annual Thesis Show showcases top-notch, innovative design work by Humber’s fourth-year Bachelor of Industrial Design students. Attended by over 400 industry and design professionals, the event continues to create its indelible mark in the North American de..."},{"title":"InkWell Workshops - Memoir with Leanne","date":"2019-04-17T18:00:00.000Z","endTime":"2019-04-17T20:00:00.000Z","location":"Routes Community Centre","description":"InkWell Workshops offers free, drop-in creative-writing workshops to people living with mental-health or addictions issues led by award-winning professional writers with lived experience of mental illness. Learn how to tell your own life stories in this safe, ..."},{"title":"Learning When Not To Shut Up","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Ryerson University","description":"What does freedom of expression look like for Canadian kids? Disturbingly, it’s not very clear. Although our schools are supposed to be centres for learning critical thinking and citizenship, they impose significant restrictions on student expression. Why is t..."},{"title":"Let's Share Skills! American Sign Language","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Malvern Public Library","description":"Free community program at the Malvern Library. Come and learn basic American Sign Language. If you are already fluent in ASL, please come and share your skills!"},{"title":"OCAD University's President's Speaker Series presents: Burton Kramer","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"OCAD University","description":"OCAD University presents renowned Canadian design pioneer Burton Kramer for a free public talk. A newly minted member of the Order of Canada, he will provide insight into his nearly four decades of experience in the Canadian design industry. In 1974, he create..."},{"title":"Opening Act Dan Rosen - Nick Beaton!","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T01:30:00.000Z","location":"Comedy Bar","description":"Every month, Dan Rosen opens for the hottest acts in town! This month he'll be opening for:\nFlux In A Box!\nSarah St-fleur!\nAdrian Sawyer!\nLucy Gervais!\nand headliner Nick Beaton!\n(Just for Laughs award-winner, Edinburgh Fringe, two-time Canadian Comedy Awards ..."},{"title":"PROFESSIONAL SINGLES SPEED DATING..AGES 27 to 38 ..BOOK WITH A FRIEND GET 15 PERCENT OFF!!","date":"2019-04-17T23:30:00.000Z","endTime":"2019-04-18T01:45:00.000Z","location":"Junction Local","description":"This niche speed dating event is for Professional Toronto Singles that want to meet someone who also has drive, ambition and takes pride in their career. So climb back down that corporate ladder just for one night to mix and mingle…you never know, you may meet..."},{"title":"Retail Human Resources Forum","date":"2019-04-17T12:15:00.000Z","endTime":"2019-04-17T16:00:00.000Z","location":"Toronto Congress Centre","description":"Retail Council of Canada’s Retail Human Resources Forum will inspire and educate attendees with contemporary and innovative strategies for creating a vibrant workplace culture. Designed by retailers, for retailers, this forum will cover topics such as HR techn..."},{"title":"Rubber Tire Peep Show w/ Glass Cannon & Charlotte Lytle","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T03:30:00.000Z","location":"Painted Lady","description":"An evening of great music and good times, with a lineup of 3 stellar local bands."},{"title":"Sacred Music for a Sacred Space","date":"2019-04-17T23:30:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"St. Anne's Anglican Church","description":"Experience two rich choral traditions - French subtlety and the mystical traditions of Eastern Europe and Russia. TMC conductor David Fallis has brought together music of these traditions in a contemplative program in the visual and acoustic splendour of St. A..."},{"title":"School of the Environment Research Day","date":"2019-04-17T16:15:00.000Z","endTime":"2019-04-17T22:00:00.000Z","location":"Faculty Club","description":"Held during Earth Week, the School of the Environment’s Research Day 2019 showcases faculty and graduate research on a broad range of environmental issues affecting the planet. Join us for a series of talks that will investigate the impacts of climate change, ..."},{"title":"Shelley Peterson Student Art Exhibition Opening","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"University of Toronto Art Centre","description":"The University of Toronto Shelley Peterson Student Art Exhibition is an annual exhibition celebrating the diverse artistic excellence of visual studies undergraduate students from all three campuses. The selected works best represent contemporary art practices..."},{"title":"Spring Awakening","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Easy steps to your best garden ever!\n- Monthly tasks for the flower beds, shrubs, veggie patch and lawn\n- When to start seeds, cut back foliage, clean up and weed\n- Right time to prune and plant shrubs, use dormant oil\n- When to plant, divide, stake and deadhe..."},{"title":"Spring Exhibitions Opening","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Art Museum at the University of Toronto","description":"Join us and celebrate!\nThe 2019 University of Toronto MVS Studio Program Graduating Exhibition features the projects of the 2019 Master of Visual Studies graduate students Dana Prieto, Mehrnaz Rohbakhsh, Miles Rufelds and Sahar Te.\nThe University of Toronto Sh..."},{"title":"The Check In","date":"2019-04-18T01:30:00.000Z","endTime":"2019-04-18T02:30:00.000Z","location":"Bad Dog Comedy Theatre","description":"An improv show where the cast uses their own lives and personal struggles as inspiration to create comedy!\nIn The Check In, a cast consisting of some of Toronto's best up and coming improvisers are challenged to test their own personal emotional boundaries as ..."},{"title":"The Liveable City? Transportation","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T00:30:00.000Z","location":"Art Gallery of Ontario","description":"As Impressionism in the Age of Industry takes viewers on a journey through a period of immense change in 19th century Paris, we invite speakers across various disciplines to enter into conversations around urgent issues facing Toronto today: work, affordable h..."},{"title":"Turn Food Waste to Compost at Toronto Botanical Garden","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Composting is a great way to dispose of food waste while also creating natural fertilizer for your garden. Learn the how-to and benefits of composting from the Worm Wranglers, vermicompost specialists. This offsite workshop will be held at Evergreen Brickworks..."},{"title":"Urban Vegetable Gardening - Grow your own food for low-carbon eating!","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-17T23:00:00.000Z","location":"Cedarbrae Library","description":"Whether you grow plants in containers or a square metre garden, no yard is too small to grow vegetables sustainably! A member from the Toronto Master Gardeners will lead this hands-on, two-part workshop to guide you through the steps.\nThe first session will be..."},{"title":"Wednesday Afternoon at the Movies: Three Coins in the Fountain, 1954","date":"2019-04-17T18:00:00.000Z","endTime":"2019-04-17T20:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Join us for a series of cinematic classics, new releases, foreign films and documentaries.\nApril 17, 2019 showing - Three Coins in the Fountain (1954) - Three American women working in Rome, Italy, share a spacious apartment and the desire to find love and mar..."},{"title":"Winter is Here ! GOT Costume party & Trivia Night","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T03:00:00.000Z","location":"Station Bar & Kitchen","description":"Winter is Here !!\nGet together for a fun GOT Trivia night to win awesome prizes. Teams of 4 will compete for prizes and bragging rights !!\nDress to impress your fellow GOT fans in your best GOT character outfits !! Best costume gets the iron throne."},{"title":"Zine launch: Reflections on Illness","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Another Story","description":"Edited by Nazila Bettache and Sarah Vance; a critical, poignant and at times witty collection of pieces by activists facing life-threatening illness based in Canada (occupied/unceded Indigenous territories). Includes personal essays, comics, interviews and a r..."}]}