{"events":[{"year":2019,"month":2,"day":29,"title":"CineCuba 2019","description":"CineCuba 2019 - March 29th, 30th & 31st, 2019 at the Royal Theatre, 608 College Street Toronto, ON M6G 1B4. All films FREE to the public! See you there!","time":"6:30 PM – 10:45 PM","location":"The Royal Cinema"},{"year":2019,"month":2,"day":29,"title":"Emergents III: Jana Luksts, Happenstance","description":"The Music Gallery presents Emergents III: Jana Luksts + Happenstance part of the Emergents Series Curated by Sara Constant In this Emergents concert, contemporary music specialists present two side-by-side takes on the future of the classical recital. Performi...","time":"8:00 PM – 11:00 PM","location":"Music Gallery"},{"year":2019,"month":2,"day":29,"title":"Long Winter Year 7 Vol. 5","description":"Here we are, at the end of our season. Please join us for one last hurrah (until next winter)! Long Winter Year 7 Volume Five Co-presented with Workman Arts https://workmanarts.com/ Three floors of live music and art 7:00 p.m. - 2:00 a.m. *MUSIC* Woodh...","time":"7:00 PM – 2:00 AM","location":"Workman Arts"},{"year":2019,"month":2,"day":29,"title":"Wizkid Live in Toronto","description":"Tickets available on ticketgateway.com https://www.ticketgateway.com/event/view/wizkidtoronto","time":"7:00 PM – 11:00 PM","location":"Rebel"},{"year":2019,"month":2,"day":29,"title":"Yass Qween with Brooke Lynn Hytes","description":"This ultimate dance party launches with our very own Brooke Lynn Hytes, Canada’s first-ever contestant on Rupaul’s Drag race! YASSQWEEN!!!\n\r\nGet ready for an action-packed night of dancing and entertainment, featuring our headliner alongside Toronto‘s finest q...","time":"10:00 PM – 3:00 AM","location":"Fly 2.0"},{"year":2019,"month":2,"day":29,"title":"163 John St. : FRIDAY SHOWCASE @ THE CORNER","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nFRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna be ...","time":"7:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":2,"day":29,"title":"2019 March - Wine and Paint Toronto","description":"On the last Friday of each month, from 7:30 to 9:30 pm, join LucSculpture for good wine, good conversation, and have fun painting!\nFri. March 29, with Hiroshi Yamamoto\nFee: $50 + Tax (includes materials, a glass of wine and snacks)","time":"7:30 PM – 9:30 PM","location":"LucSculpture School Studios"},{"year":2019,"month":2,"day":29,"title":"90's Glow in the Dark Paint Party","description":"It’s our 90’s Glow in the Dark Paint Party with Wine, Beer, Cocktails and many more!\nSpend your Friday night in Toronto, painting and jamming to Dj Rec & Dj GadJet! Good vibes, Great Beats! Live Music :D\nYou select your own image, and we will guide you through...","time":"8:30 PM – 11:30 PM","location":"Paint Cabin"},{"year":2019,"month":2,"day":29,"title":"946 QUEEN ST. EAST : FRIDAY SHOWCASE @ THE CORNER EAST","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nFRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna be ...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":2,"day":29,"title":"Abraxas The Ultimate Santana Tribute Live at the Linsmore Tavern!","description":"This is going to be a really cool show, as the Linsmore Tavern (1298 Danforth Ave) is extremely excited to welcome for the very first time, Abraxas The Ultimate Santana Tribute on Friday March 29th! Fans of the Legendary Carlos Santana and his fantastic guitar...","time":"8:00 PM – 11:59 PM","location":"Linsmore Tavern"},{"year":2019,"month":2,"day":29,"title":"Afro Haus","description":"What started as a simple idea in February 2018 has turned into a vibrant, beautiful community where people know they can have a safe space to express, release, and GET DOWN to the grooviest, freshest dance music coming out of Sub-Saharan Africa!\nWe've created ...","time":"10:00 PM – 3:00 AM","location":"Bunda Lounge"},{"year":2019,"month":2,"day":29,"title":"Alfonso Cuarón's Love in the Time of Hysteria","description":"See Oscar-winning director Alfonso Cuarón's (ROMA) first feature, a dark screwball comedy about love and sex at the height of the AIDS crisis. 💛\n\r\nThe film follows Casanova Tomás Tomás who is falsely diagnosed with AIDS by a wrathful lover when he falls in lo...","time":"6:30 PM – 8:30 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":2,"day":29,"title":"Anup Jalota","description":"Ghazals & Bhajans by Bhajan Samrat Anup Jalota accompanied by Jazim Sharma and Vatsala Mehra","time":"7:00 PM – 10:30 PM","location":"80 Brydon Drive"},{"year":2019,"month":2,"day":29,"title":"A Slumber Party","description":"Slumber Party is a new Friday night late show featuring a group of smart, sweet, sassy, and saucy comedians ready to share some spirited silliness with Toronto!\nLive at Second City Training Centre - 99 Blue Jays Way, 3rd Floor\n9.30pm showtime.\n$12 admission at...","time":"9:30 PM – 11:00 PM","location":"John Candy Box Theatre"},{"year":2019,"month":2,"day":29,"title":"Backyard Living Expo","description":"If you need help to create your perfect outdoor space, come to the Backyard Living Expo at The International Centre, March 29-31. Learn how to make the most of your backyard from a variety of HGTV celebrities, gardeners, chefs, DIY professionals, and outdoor b...","time":"12:00 PM – 8:00 PM","location":"The International Centre"},{"year":2019,"month":2,"day":29,"title":"Ballet BC","description":"Bold and innovative, Ballet BC’s distinctive style and approach returns to Toronto.\nBallet BC presents a diverse repertoire of Canadian and international work from the late 20th and early 21st centuries, and is a hotbed for the creation and performance of new ...","time":"8:00 PM – 10:00 PM","location":"St. Lawrence Centre for the Arts"},{"year":2019,"month":2,"day":29,"title":"Battle of the Bands","description":"Musicians@Ryerson’s 2019 7th Battle of the Bands will be held on Friday March 29th, 2019 at 7:30 PM. Battle of the Bands is an event where 6 local bands each play a set and are then judged and eliminated until a winner is crowned. Tickets are $6 online or $10 ...","time":"7:30 PM – 11:59 PM","location":"Mattamy Athletic Centre"},{"year":2019,"month":2,"day":29,"title":"Beam Me Up! Last Disco at The Piston!","description":"This isn’t goodbye…\nIt’s time for our residency at the Piston to come to end, though this isn’t goodbye from us. We’re movin’ on, to a venue who shares our disco dreams and has more room to dance! We can’t announce where just yet, but we’ll be live with the ev...","time":"10:00 PM – 2:30 AM","location":"The Piston"},{"year":2019,"month":2,"day":29,"title":"Beatles VS Stones","description":"Hits and rarities from The Beatles & The Rolling Stones\nwith DJ Blush","time":"9:00 PM – 2:00 AM","location":"Stones Place"},{"year":2019,"month":2,"day":29,"title":"Black Sheep Comedy's Stand Up @ Brunswick Bierworks, Adrienne Fish Edition","description":"Get your fill of cold craft beer and hot homegrown comedians at East York's finest brewery space!\nYour amazing lineup includes headliner Adrienne Fish! As seen on JFL42, Winnipeg Comedy Festival, Halifax Comedy Festival, Sirius XM, CBC's \"The Debaters\", AND he...","time":"7:30 PM – 10:30 PM","location":"Brunswick Bierworks"},{"year":2019,"month":2,"day":29,"title":"Black Women Connect! Book Club - March  Meeting","description":"Are you a Black Woman in Toronto wanting to meet new people and create new networks?\nBlack Women Connect! Book Club is a Toronto-based book and social club that focuses on celebrating Black Literature, Sisterhood and the love of reading. Our mission is to brin...","time":"7:00 PM – 9:00 PM","location":"791 Saint Clair Avenue West"},{"year":2019,"month":2,"day":29,"title":"Blue Note Records: Beyond the Notes","description":"Join us on a revelatory journey behind the scenes of Blue Note Records, the pioneering label that gave voice to some of the most ground-breaking jazz artists of the 20th and 21st centuries. Legends Herbie Hancock and Wayne Shorter come together with next-gener...","time":"8:45 PM – 10:21 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":2,"day":29,"title":"Building Consent Culture","description":"This is a workshop that uses the anti-oppression frame work to understanding rape culture and the mechanisms by which it manifests inside arts and community spaces. Practices and principles for fostering brave spaces and a culture of consent will be explored, ...","time":"6:00 PM – 9:00 PM","location":"Daniels Spectrum"},{"year":2019,"month":2,"day":29,"title":"Coffee & Canvas - Freestyle Painting","description":"Join us for an afternoon of 'Coffee and Canvas'!\nRelax and unwind with some freestyle painting and a cup of coffee or tea and a treat. A great way to spend some quality time with friends or family.\nJust pay for your canvas and we will supply the paint, brushes...","time":"5:00 PM – 9:00 PM","location":"Fresh Paint Studio (Danforth East)"},{"year":2019,"month":2,"day":29,"title":"Cub Camp: Spring Fever","description":"We made it! We'll we almost made it? SPRING IS HERE!\nTime for us to start blooming and get out of hibernation and back out on the dancefloor!\nDJ Scooter McCreight\nDoor host Jacklynne Hyde","time":"10:00 PM – 2:00 AM","location":"Beaver Cafe"},{"year":2019,"month":2,"day":29,"title":"DivaGirl Fashion Friday Spring Runway","description":"It may be cold out, but Spring is in the air, so get your most fashionable outfit ready for March 29th.\nDivaGirl's Annual Fashion Friday Spring Runway has an epic new lineup and venue—and we’re excited to share the news.\nThe exclusive one-day women's only even...","time":"6:00 PM – 10:00 PM","location":"FountainBlu Event Venue"},{"year":2019,"month":2,"day":29,"title":"DJ Teenage Werewolf","description":"Rock n' Roll magic all night long!","time":"10:00 PM – 2:00 AM","location":"Swan Dive"},{"year":2019,"month":2,"day":29,"title":"Drop The Beat Aries Party","description":"Special Edition of DROP THE BEAT/ARIES -- GENE'S BDAY\nGoing to be special,not just because we are going to celebrate Gene King'S, birthday but because for all people who come by and prove to us they are ARIES to; no need to pay the cover at the door! .\nThis ni...","time":"9:00 PM – 3:00 AM","location":"Wayla Bar"},{"year":2019,"month":2,"day":29,"title":"Echo Women's Choir Presents Annabelle Chvostek","description":"7-10 p.m.: Echo Women’s Choir Presents: Juno-nominated singer-songwriter and multi-instrumentalist Annabelle Chvostek in a spring fundraising concert. Also featuring Las Brujas del Barrio, a silent auction, free snacks, and a cash bar. Purchase Echo’s 20th Ann...","time":"7:00 PM – 10:00 PM","location":"Tranzac Club"},{"year":2019,"month":2,"day":29,"title":"Etobicoke Community Concert Band - \"Dance Like No One's Watching\"","description":"The 3rd. formal concert of the Etobicoke Community Concert Band's 2018-19 season. The theme \"Dance Like No One's Watching\" will feature music that will remind you of the days when people actually danced together. Our special guest is an Etobicoke vocalist Meag...","time":"8:00 PM – 10:00 PM","location":"Etobicoke Collegiate Institute - Auditorium"},{"year":2019,"month":2,"day":29,"title":"Female Voices - Allyson Mitchell and Deirdre Logue - 'Hers Is a Dank Cave'","description":"MOCA has invited artist and writer Lisa Steele to organize a series of talks and screenings that intersect, interact, or just plain act up with the lively resonances that exist between the iconic contemplations of Chantal Akerman and the deeply, contemporary i...","time":"7:00 PM – 9:00 PM","location":"MOCA Toronto"},{"year":2019,"month":2,"day":29,"title":"HERO - The World Tour","description":"The event is a Bio-Fiction film inspired by the life and times of Ulric Cross.","time":"7:00 PM – 12:00 AM","location":"Imagine Cinemas Carlton Cinema"},{"year":2019,"month":2,"day":29,"title":"Hirut Hoot","description":"Want have a laugh while enjoying a delicous Ethiopian meal with friends?\nWho doesn't?!\nThis month's Hoot is stupid good.\nWith stupid comedians:\nRobin Archer\nChe Durana\nKevin MacDonald\nMr. Jim McAleese (note the \"Mr.\")\nLee-Anne Stewart\nFeaturing the return of R...","time":"9:00 PM – 11:00 PM","location":"Hirut"},{"year":2019,"month":2,"day":29,"title":"House of Kings: Fashion Show!","description":"Welcome to House of Kings first ever FASHION SHOW! Come out to see the AH-MA-ZING looks (and the acts to go with them!) these fierce Kings, Queens and Gender Performers are turning out for our RUNWAY! Because, YES- Kings and GP's can be stylish too ;)\nDoes a F...","time":"9:30 PM – 2:00 AM","location":"Glad Day Bookshop (Church)"},{"year":2019,"month":2,"day":29,"title":"Hutch & Friends","description":"Hutch & Friends is back for a four month run @ the Peacock! After an eighth month break, this monthly stand-up showcase is not to be missed. Hosted and curated by Paul Hutcheson with the comedic talents of Ashley Cooper, Ryan Dillon, Clif Knight, Nick Reynolds...","time":"8:00 PM – 9:30 PM","location":"The Peacock Public House"},{"year":2019,"month":2,"day":29,"title":"Kickass Study Strategies for Math & Science!","description":"Doing well on a test isn’t just about knowing course content - it’s about developing kickass study skills! This study strategy workshop will provide an overview of all the super important aspects of studying - from getting organized, to taking notes, to rememb...","time":"4:30 PM – 6:00 PM","location":"The Math Guru"},{"year":2019,"month":2,"day":29,"title":"La Traviata","description":"The Toronto City Opera presents Giuseppe Verdi's tragic love story featuring Beth Hagerman as Violetta. The production is supported by the artistic team of Jennifer Tung, Ivan Jovanovic and Alaina Viau and a 40 member chorus. Opens March 28, 7:30 pm, also Marc...","time":"7:30 PM – 10:00 PM","location":"Al Green Theatre, Miles Nadal JCC"},{"year":2019,"month":2,"day":29,"title":"Latvia: Past,Present,and Future. A Baltic State and its Neighbours in A Global Context..","description":"Come out and join us in celebrating the Latvian culture through a day full of cultural programs, food, networking, and engaging conversations with various people including our keynotes:\n1) Lt. Colonel Steve Macbeth(one of the most recent commander for the Cana...","time":"8:00 AM – 5:00 PM","location":"Glendon College, York University"},{"year":2019,"month":2,"day":29,"title":"Little Rambunctious Live at Alchemy","description":"Little Rambunctious Live at Alchemy\n4 horns and a drummer\nYou make up the title - We make up the song.\nShow starts at 10:30\nPay what you think it's worth.\nKitchen open 12PM - 12AM\n$6 beer / wine, 5 - 8PM","time":"10:30 PM – 2:00 AM","location":"Alchemy Food & Drink"},{"year":2019,"month":2,"day":29,"title":"Maya Killtron Album Release Party","description":"Come celebrate the release of NEVER DANCE ALONE - the first full length album by loveable ol' Maya Killtron\nFree Oysters - Snacks - Drag Queens - DJ's - Maybe Singing\nWe'll have it all.\nIt's been an absolute mission getting this big baby done but she's here & ...","time":"9:00 PM – 1:00 AM","location":"Friday Roots and Vibes"},{"year":2019,"month":2,"day":29,"title":"Night Metamorphosis Possession Fear is Free Fridays","description":"Night Metamorphosis Possession Fear is Free Fridays. All ROCKin' with NO revisionist talkin'. Watch movies the way they were meant to be seen! On the BIG SCREEN and in the BIG FRIGHTFUL SOUND.\nFun starts 8:45 pm Friday. Admission is FREE and everyone is welcom...","time":"8:45 PM – 1:45 AM","location":"Kingsway Theatre BAR - The Last Independent"},{"year":2019,"month":2,"day":29,"title":"Nu Music Industry Night","description":"Come Network! We're inviting Toronto's best up-and-coming Singers, Producers, Videographers, Photographers, Bloggers, A&R; Reps (and more) to join us for Nu Music Industry Night !\nFeaturing:\n-Live Performances from Nu Music Artists\n-Media Sharing Area\n$15 in a...","time":"7:30 PM – 11:30 PM","location":"Painted Lady"},{"year":2019,"month":2,"day":29,"title":"O! happie Days - TRUE FRIENDSHIPS- & the healing power","description":"O! happie days LIVE SHOW\npresents\n-True Friendships-\nThe Magical Healing Powers\nAn Evening for You to enter a world where We Explore\nThe healing power of True Friendship LOVE & JOY is ALIVE.\nFriends become family forever and teach us lessons in love & life. Le...","time":"6:30 PM – 9:30 PM","location":"Glad Day Bookshop"},{"year":2019,"month":2,"day":29,"title":"PAINT PUFF PASS","description":"Come enjoy the coolest thing since sliced bread.\nIts like Paint Night but like way better.\nExplore the creative side you didn't know you had.\nExpect to indulge in some delicious treats, while enjoying a refreshing beverage all while creating our own personal m...","time":"8:00 PM – 10:00 PM","location":"Secret Loft"},{"year":2019,"month":2,"day":29,"title":"Panic at the Boat!","description":"Dance the night away to indie rock, britpop, new wave and whatever the name is for 00's music. Do what the common people do. Dance, drink and screw (but don't do the third one at our party)","time":"10:03 PM – 2:00 AM","location":"The Boat"},{"year":2019,"month":2,"day":29,"title":"Peace of Minds Gala","description":"Fundraising Gala with Toronto's top artists, Carmen Elle & KASHKA at the beautiful CSI Annex Lounge! Meet new friends, bid on some awesome giveaways and enjoy delicious hors d’oeurves from NishDish - First Nations owned and operated, specializing in indigenous...","time":"6:30 PM – 9:30 PM","location":"CSI Annex"},{"year":2019,"month":2,"day":29,"title":"Remote Control - an '80s and '90s Video Dance Party","description":"No cover! Come join VJ Mobotron for the ultimate retro video dance party! Are you an All Star or are you Never Going to Give It Up? Who was the greatest diva? Whitney or Mariah? The ageless question of which decade rules supreme the '80s or the '90s will be se...","time":"10:00 PM – 2:00 AM","location":"Handlebar"},{"year":2019,"month":2,"day":29,"title":"Rock The Night","description":"Friday March 29 Sounds Of The City\nPresents \"Rock The Night\"\n@the.cameronhouse (408 Queen St W)\nMC\n@lauraannemckay\nAwesome lineup of artists!\n@chrisbirkettmusic\n@ellisintransit\n@cdemeanor\n@almostanartist.band\nRace against Fate","time":"9:00 PM – 1:00 AM","location":"Cameron House"},{"year":2019,"month":2,"day":29,"title":"ROMKids Sleepovers","description":"Bunk down for the night at Toronto’s ultimate backstage museum pass at the Royal Ontario Museum!\nBefore bedtime, visitors are invited to get up close to Museum artifacts with exclusive after-hours access to our galleries, speak with ROM experts, enjoy a specia...","time":"5:00 PM – 10:00 AM","location":"Royal Ontario Museum"},{"year":2019,"month":2,"day":29,"title":"SONGBOOK IX","description":"Canada’s brightest emerging artists perform alongside Soprano Jacqueline Woodley (M’Dea Undone, Oksana G., Tapestry Briefs: Winter Shorts) and pianist Andrea Grant (Wexford Musical Festival). A 3-day Masterclass, New Opera 101, culminates in three performances...","time":"8:00 PM – 10:00 PM","location":"ERNEST BALMER STUDIO"},{"year":2019,"month":2,"day":29,"title":"Start the Car Live at Drums N Flats","description":"Start the Car are an incredibly talented Toronto band committed to playing Fundraising events and great live music venues like North Toronto's Drums N Flats\nGet Out, Have Some Fun and feel good about helping out a local North Toronto Charity, all proceeds from...","time":"9:00 PM – 12:30 AM","location":"Drums N Flats"},{"year":2019,"month":2,"day":29,"title":"Tantric Speed Dating","description":"Back by popular demand! Whether you've been waiting to try it or just can't get enough....we're excited to welcome you :)\nThere's no comparison between Tantric Speed Dating and a regular speed dating event. People often tell us that getting dating matches is a...","time":"6:30 PM – 10:30 PM","location":"Dream Yoga Dance"},{"year":2019,"month":2,"day":29,"title":"Ten Minute Theatre - Science Fiction Edition","description":"6 Original Science Fiction themed plays, all under the duration of 10 minutes each!\nFollowed by live entertainment. Doors open 9pm, show starts 10pm.\nTickets: https://bit.ly/2EMMvhy\nStay up to date by following us!\nWebsite: https://www.superwondergallery.com\nT...","time":"9:00 PM – 2:00 AM","location":"Super Wonder Gallery"},{"year":2019,"month":2,"day":29,"title":"Terrible Two Day Fest Toronto","description":"Friday March 29th and Saturday 30th from 6:30 pm till 11:30 pm both days . We showcase the weirdest recent B movies you will ever see. With feature length film screenings for only 2 dollar a movie, with titles like Caroushell, Camp Death 3, House Shark and Clo...","time":"6:30 PM – 11:30 PM","location":"Eyesore Cinema"},{"year":2019,"month":2,"day":29,"title":"The Anti-Token Comedy Show","description":"A monthly comedy show featuring Toronto's dopest stand-up comedians of colour! Hosted by Harpreet Sehmbi! Doors open at 9:30pm and show starts at 10pm!\nHOT LINEUP:\nBig Norm Alconcel (Kevin Hart's LOL Network)\nThurka Guna (The New Normal Comedy Show)\nCassie Cao...","time":"10:00 PM – 11:30 PM","location":"Theatre Centre Cafe"},{"year":2019,"month":2,"day":29,"title":"The bYouties Birthday Bash","description":"bYouties is a Toronto-based custom clothing company producing made-to-order rave/festival/Burning Man-style bootyshorts for real humans with real bodies that really don't belong in generic sizes.\nAnd we're turning 1!\nSo to celebrate, we're throwing an epic dan...","time":"10:00 PM – 3:00 AM","location":"Round"},{"year":2019,"month":2,"day":29,"title":"The Forbidden Shore Set to Open the CineCuba 2019 Film Festival  Celebrating 75 Years of Diplomatic Relations between Canada and Cuba and ICAIC 60th Anniversary","description":"The Forbidden Shore (96 mins) Filmmaker Ron Chapman in attendance\nSynopsis: Politics silenced Cuban voices beyond its shores, but within, music is its very heartbeat. The extraordinary musical diversity of Cuba is revealed with over 40 performances by it's top...","time":"6:30 PM – 9:00 PM","location":"The Royal Cinema"},{"year":2019,"month":2,"day":29,"title":"Tigerland - Sneak Peek // Films Changing the World","description":"Be among the first to catch this riveting doc on the majestical tiger—often the subject of myths and folktales, poetry and art—at this special screening after its Sundance Festival premiere. Half a century ago, in the jungles of India, a young forest officer r...","time":"6:00 PM – 8:06 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":2,"day":29,"title":"Toronto Jam for Good","description":"Calling all designers, developers, strategists, innovators & anyone eager to make a positive impact in Toronto, and on the world: Join the #Toronto Jam for Good on the weekend of March 29th-31st.\nDuring the Jam, you will work with people from different backgro...","time":"6:00 PM – 4:00 PM","location":"WeWork"},{"year":2019,"month":2,"day":29,"title":"Trinity Art Show 2019: Statements","description":"Art in the contemporary moment has urgency. Unconstrained and undefined, it can be a vehicle to address contention in our personal identities, sociopolitical issues, ideologies, technology, as well as culture. Let’s have a conversation.\nFor our 15th anniversar...","time":"6:00 PM – 9:00 PM","location":"Seeley Hall, Trinity College"},{"year":2019,"month":2,"day":29,"title":"Underground Comedy Spotlight on: Sam Norton!","description":"Fri Mar 29th! Our Underground Comedy Spotlight is on: Sam Norton!!\nHosted by Joanne Baker and featuring: Jamieson Donnell, Olivia Stadler, Kirby Darius & Dena Jackson!\nThis is gonna be one helluva show! Don't miss out!\nShowtime 9:30pm. $15 cover\nAbout Sam Nort...","time":"9:30 PM – 11:00 PM","location":"The Underground Cafe"},{"year":2019,"month":2,"day":29,"title":"Unruly Fridays","description":"DANCEHALL l AFROBEATS l SOCA l HIPHOP\n++ Deejayshai & Dia Isidore Smart (XiXgon Int'l)\n++ Special Guests: DJ NV\n*** $4 Shots & $5 Beers before 11pm\n*** $13 Pitchers l Drink Specials All Night l Kitchen Open Late\n++ Free Before 11pm\n++ Socialite Bar - 276 Augus...","time":"10:00 PM – 3:00 AM","location":"Socialite Tapas Bar"},{"year":2019,"month":2,"day":29,"title":"Visionary Gala","description":"The Visionary Gala is a formal fundraising event, attracting over 300 guests in support of inspiring the next generation of young minds. This event brings together community members and city builders to celebrate excellence and support new ideas. The event inc...","time":"7:00 PM – 10:00 PM","location":"Daniels Spectrum"},{"year":2019,"month":2,"day":29,"title":"World Premiere of LOT X Culminates Harbourfront Centre Provocative Dance Series TORQUE","description":"Adelheid’s LOT X is an interactive dance experience that transports performers and audiences and through several locations at Toronto’s Harbourfront Centre, challenging ideas of intimacy and holding a magnifying glass to the land we are standing on and the peo...","time":"8:00 PM – 9:30 PM","location":"Harbourfront Centre Theatre"},{"year":2019,"month":2,"day":29,"title":"Y2GAY - Showdown of the 90s vs 2000s Dance Night","description":"Juicy Moon Productions Presents\nY2GAY Showdown of The Decades.\nWe are turning back time to the night of Y2K with a dance party like no other at the WORLD FAMOUS BUDDIES with the best of both the 90s and 2000s. First we are starting the night off with all the j...","time":"10:30 PM – 2:30 AM","location":"Buddies in Bad Times"},{"year":2019,"month":2,"day":30,"title":"An Evening with Anderson Cooper","description":"Unique Lives and Experiences presents Relentless, fearless and locked onto the truth like a heat-seeking missle. Each of these qualities has made veteran journalist Anderson Cooper one of the most recognizable faces on television. Whether recounting his probin...","time":"7:30 PM – 9:00 PM","location":"Roy Thomson Hall"},{"year":2019,"month":2,"day":30,"title":"Butterbeer Bar Crawl","description":"CALLING ALL WITCHES, WIZARDS and even you MUGGLES! The Butterbeer Bar Crawl is back after popular demand! Grab your drinking crew or make a new one as we \"Stumble\" between 4 themed bars in Toronto's Entertainment District! 4 Bars // 1 Theme // Get Involved The...","time":"2:00 PM – 10:00 PM","location":"Multiple Venues"},{"year":2019,"month":2,"day":30,"title":"Choker","description":"DOORS: 7:00 PM SHOW: 8:00 PM\r\nThis is a LEGAL AGE 19+ show.\n\r\nSale Dates and Times:\n\r\nPublic Onsale : Fri, 16 Nov 2018 at 10:00 AM\n\r\nLive Nation Presale / LEGAL AGE 19+ : Thu, 15 Nov 2018 at 10:00 AM\n\r\nLive Nation Mobile App Presale : Thu, 15 Nov 2018 at 10:00...","time":"7:00 PM","location":"The Drake Hotel"},{"year":2019,"month":2,"day":30,"title":"Final Sale and ART EVENT","description":"The Coffin Factory Studios:\nFinal sale and ART EVENT before they close the lid on the Coffin Factory Lofts.\nThis Saturday March 30th 12-4pm, final sale, $0.25 and up. Whatever is left will go to donation.\nIt's not only a yard sale is an ART EVENT- There will b...","time":"12:00 PM – 4:00 PM","location":"The Coffin Factory Studios"},{"year":2019,"month":2,"day":30,"title":"HideSeek","description":"HideSeek is an immersive pop-up experience inspired by childhood nostalgia. Using multi-sensory elements, our floor-to-ceiling installations excite in person and impress in photos. We invite guests to leave adulting behind and jump into a world of childlike wo...","time":"12:00 PM – 10:00 PM","location":"1305 Dundas Street West"},{"year":2019,"month":2,"day":30,"title":"On Sterling Bingo Open House and Scavenger Hunt","description":"Come by one of these locations on Sterling Rd. pick up a map and join us for an afternoon scavenger hunt of open studios, galleries and businesses. Get your map stamped at all 8 spaces and you can enter a raffle for various prizes and redeem it for a complimen...","time":"1:00 PM – 5:00 PM","location":"Multiple Venues"},{"year":2019,"month":2,"day":30,"title":"Toronto AirPod Owners MeetUp","description":"A gathering to share our collective love for Airpods, and to let everyone else know that they're poor.\n\r\nOFFICIAL EVENT MERCH:\nhttps://teespring.com/stores/airpod-brad\r\n^if you don't buy it you're poor.\n\r\nUSE CODE: BRAD10 FOR 10$OFF\r\nInsta @rxdbrxd_\n\r\nWe will ...","time":"12:00 PM","location":"Yonge-Dundas Square"},{"year":2019,"month":2,"day":30,"title":"163 John St. : SATURDAY SHOWCASE @ THE CORNER","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nSATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna b...","time":"7:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":2,"day":30,"title":"2019 March - 'Intuitive Art Workshop for LGBTQ'","description":"Unleash your creativity! Let go of your mind and create something uniquely your own in a safe space.\nDate: Mar. 30th (Saturday), 1:00 pm to 3:30 pm\nInstructor: Natasha Sudenis\nPrice: $63 (materials and tools are included)","time":"1:00 PM – 3:30 PM","location":"Lucsculpture Studios and School"},{"year":2019,"month":2,"day":30,"title":"2019 Refugee & Migrant Health Conference","description":"Learn more about challenges faced by refugees and migrants in navigating the health care system in Canada and internationally at the 2019 Refugee and Migrant Health Conference held at Sidney Smith Hall on Saturday, March 30th from 9AM-1PM! Our 3 invited speake...","time":"9:00 AM – 1:00 PM","location":"Sidney Smith Hall (Room 2118)"},{"year":2019,"month":2,"day":30,"title":"80's & 90's Video Dance Party w/ Depeche Mode Spotlight - PANIC 16 Year Anniversary","description":"Sat March 30, 2019 - Living On Video Presents -\nPANIC - 80's & 90's Video Dance Party & DEPECHE MODE Spotlight *16 Year Anniversary* with DJ Lazarus\nRSVP: https://www.facebook.com/events/266435300890722/\n(please SHARE and INVITE your friends)\nThanks for making...","time":"9:00 PM – 3:00 AM","location":"Remix Lounge"},{"year":2019,"month":2,"day":30,"title":"88 Free Ice Cream Lava Cakes! Tsujiri Patisserie Grand Opening!","description":"Tsujiri, a 155-year-old premium Japanese Matcha brand, is opening its first patisserie shop in downtown Toronto.\nTsujiri Patisserie (exclusively only in Toronto) is grand opening on March 30th! The most eye-catching highlight of this new store is they are offe...","time":"12:00 PM – 3:00 PM","location":"Tsujiri Patisserie"},{"year":2019,"month":2,"day":30,"title":"946 QUEEN ST. EAST : SATURDAY SHOWCASE @ THE CORNER EAST","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nSATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna b...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":2,"day":30,"title":"Abstract Paint Pouring - Freestyle Painting","description":"Join us for a freestyle abstract paint pouring drop in session!\nGet creative and pour fluid paints on to canvas or wooden birch wood panels to create vibrant acrylic artwork.\nJust pay for your canvas or wooden panel size and we will include all paint pouring m...","time":"11:30 AM – 1:00 PM","location":"Fresh Paint Studio (Danforth East)"},{"year":2019,"month":2,"day":30,"title":"Ambiguous Origins","description":"Ambiguous Origins is an exhibition exploring the boundary between the physical and the digital through augmented reality, installation and film. Drawing connections among science fiction, new media and mixed-race identity, Ambiguous Origins chronicles the jour...","time":"12:00 PM – 7:00 PM","location":"Ignite Gallery"},{"year":2019,"month":2,"day":30,"title":"An Intimate Sip & Shuck Experience","description":"Join us on Saturday, March 30th from 7-9:30 pm for an intimate evening spent sipping wine and slurping oysters in style!\nEnjoy freshly shucked oysters and a reception wine upon arrival, followed by a shucking tutorial as you learn how to shuck properly and we ...","time":"7:00 PM – 9:30 PM","location":"525 Adelaide Street West"},{"year":2019,"month":2,"day":30,"title":"Aperitivo in Maschera","description":"Throughout the world, Carnival is one of the most beloved festivals by young and old alike. The Italian Chamber of Commerce of Ontario in collaboration with Pizza Nova and Casa Loma,is organizing the \"Aperitivo in Maschera\", a cocktail party to celebrate the C...","time":"6:30 PM – 11:30 PM","location":"Casa Loma"},{"year":2019,"month":2,"day":30,"title":"Arthur Simeon Live Comedy","description":"Join us Saturday March 30 for a stellar comedy show with Arthur Simeon!\nArthur Simeon is a Ugandan-born Toronto-based comedian who has been performing for a decade all over the world. A truly gifted storyteller, Arthur has been invited to perform at the presti...","time":"9:30 PM – 11:00 PM","location":"The Underground Cafe"},{"year":2019,"month":2,"day":30,"title":"A Sex & Dating Comedy Event at Comedy Bar","description":"Bedroom Antics is a fun and lighthearted stand up show about sex, dating, relationships, and everything in between! A sex positive night of comedy with some of Toronto's favorite stand ups talking and laughing about love\nHosted by Tracy Hamilton, with Jade Nil...","time":"9:00 PM – 10:20 PM","location":"Comedy Bar"},{"year":2019,"month":2,"day":30,"title":"Aurum Medicine and Wellness Clinic - Grand Opening Celebration!","description":"Join us to celebrate at our Grand Opening event as we open our flagship clinic location by the beautiful Christie Pits Park.\nEat, drink and celebrate with us as we open our new improved space. Check out our botanical dispensary & apothecary, new clinic space, ...","time":"3:00 PM – 10:00 PM","location":"Aurum Medicine and Wellness Clinic"},{"year":2019,"month":2,"day":30,"title":"Awesome; I Fuckin' Shot That! // This Film Should Be Played Loud","description":"Over their 30-year career, The Beastie Boys remain one of the most chaotic, hilarious and influential groups that music has ever seen. Relive their electric energy of their unforgettable Madison Square Garden show in 2004, when fifty audience members were hand...","time":"9:30 PM – 11:05 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":2,"day":30,"title":"Ballet BC Masterclass with Nicole Ward","description":"Ballet BC Masterclass with Nicole Ward\nFor Intermediate/Advanced Dancers Ages 16+\nThis masterclass is a unique opportunity to learn Ballet BC repertoire taught by Nicole Ward. (Photo Sharen Bradford)\nSaturday, March 30, 2019\n10:30AM - 12:00PM (Doors 10AM)\nSony...","time":"10:30 AM – 12:00 PM","location":"Sony Centre for the Performing Arts"},{"year":2019,"month":2,"day":30,"title":"BARCODE SATURDAYS TORONTO'S #1 URBAN PARTY","description":"Barcode Saturdays Toronto’s Saturday Night Ritual…..2 Floors 2 Sounds!!\nSaturday March 30th 2019 Barcode's SPRING TINGS....Ladies FREE on the Guestlist (Before 11:30)\nBOTTLE SERVICE EXTREMELY RECOMMENDED!! VIP Booths Starting at $325 All In (Includes 4 in Free...","time":"10:00 PM – 3:00 AM","location":"Orchid Nightclub"},{"year":2019,"month":2,"day":30,"title":"Beat The Winter Blahs-Welcome Afternoon Tea","description":"It has been a long winter- and to CELEBRATE SPRING\nthe love of tea is having an Afternoon Tea with artisan crafted Chocolate Chai Tea & baked goodies, creative conversation, time out for checking out books, meet our Bee Keeper- Humble Honey and try the honey w...","time":"2:00 PM – 6:00 PM","location":"Acadia Bookstore"},{"year":2019,"month":2,"day":30,"title":"Belly Dance Event - Cabaret 101 at the Egyptian Dance Academy","description":"Belly Dance Cabaret 101 at the Egyptian Dance Academy\nMarch 30 2019 @ 8pm\nMark your calendar and get your tickets in advance!\nOnly $15 in advance, $20 at the door.\nDoors open at 7:30pm, Cabaret starts at 8pm\nWe will have snacks and drinks, bring your own wine....","time":"8:00 PM – 10:30 PM","location":"Egyptian Dance Academy"},{"year":2019,"month":2,"day":30,"title":"Buke and Gase / Obuxum / Ace of Wands - Wavelength Monthly Music Series","description":"Wavelength Monthly Music Series\nMarch 2019:\nBUKE & GASE\n\"Scholars\" Tour Lands in Toronto\nAcclaimed New York avant-pop duo releases first new album in 6 years on Brassland Records\nwith special guests:\nOBUXUM\nAce of Wands\nSaturday, March 30\nMonarch Tavern\n12 Cli...","time":"8:00 PM – 11:59 PM","location":"Monarch Tavern"},{"year":2019,"month":2,"day":30,"title":"BW 4 Year Anniversary Show ft. MIKE PATERSON & More!","description":"Brickworks Entertainment presents: THE 4 YEAR ANNIVERSARY SHOW!\nIt's been an amazing FOUR YEARS since we started on our mission to make people laugh and we're looking forward to many more! Come join us as we celebrate with one of our favourite Canadian comedy ...","time":"9:00 PM – 10:30 PM","location":"Comedy Bar"},{"year":2019,"month":2,"day":30,"title":"B.Y.O.Dog Yoga","description":"We know how important your fur baby is to you, so bring them along on Saturday March 30th to this dog friendly Yoga Flow.\nLet your pup move freely throughout the yoga room while you participate in a 60-minute Vinyasa class planned to help improve your balance,...","time":"2:30 PM – 3:30 PM","location":"Tribe Fitness"},{"year":2019,"month":2,"day":30,"title":"Canadian Armed Forces night: Toronto Marlies vs Laval Rockets","description":"Celebrate the troops with the Marlies as we host members from the Canadian Armed Forces on March 30th.","time":"7:00 PM – 9:30 PM","location":"Coca-Cola Coliseum"},{"year":2019,"month":2,"day":30,"title":"Candy, Abuse of Power, Ekulu, Best Wishes & Raze at VU","description":"SATURDAY, MARCH 30, 2019\r\nFREAKED OUT HC\n\r\nCANDY\r\nw/ ABUSE OF POWER\r\nEKULU, BEST WISHES\r\n& RAZE\r\nat The Velvet Underground\nCANDY\r\n[RICHMOND HARDCORE]\r\n[TRIPLE B RECORDS]\r\n[DROPPED ONE OF THE BEST HC LPs OF 2018]\nhttps://candygonnadie.bandcamp.com/album/good-to...","time":"6:00 PM – 8:00 PM","location":"Velvet Underground"},{"year":2019,"month":2,"day":30,"title":"Casual Chess Club","description":"Join other chess players in a friendly and welcoming environment for casual play. All ages and skill levels are welcome.\nDrop in. No registration required.\nAudiences: Adult • School-Age Children • Teen\nCategories: Hobbies Crafts & Games","time":"2:00 PM – 4:00 PM","location":"Beaches Branch, Toronto Public Library"},{"year":2019,"month":2,"day":30,"title":"Cauldron Release Party & Art Show","description":"For the past decade or so, we here at the Society of the Seven Crowns have been blessed with the ability to present artwork from all over Canada. This March we are hosting a show that excites us to no end–possibly our biggest! The recent explosive popularity o...","time":"8:00 PM – 1:00 AM","location":"Seven Crowns Tattoo"},{"year":2019,"month":2,"day":30,"title":"CBC's Dragons' Den Auditions","description":"The Dragons' Den auditions are coming back to Toronto for round 2 ! Show producers will be holding another round of open auditions on Saturday March 30th at the CBC Atrium.\nDRAGONS’ DEN gives aspiring entrepreneurs the opportunity to pitch their businesses to ...","time":"10:00 AM – 5:00 PM","location":"CBC Toronto"},{"year":2019,"month":2,"day":30,"title":"Condo Balconies and Container Gardening","description":"Imagine adding an entire room to your condominium or apartment! When the seasons change and it’s garden time, that’s your opportunity! Learn how to maximize your balcony for entertaining and relaxing using furniture that’s designed to fit and plants in contain...","time":"2:00 PM – 4:00 PM","location":"Design Department"},{"year":2019,"month":2,"day":30,"title":"DJ Cheff","description":"Get weird, get lit get down...\n*free*","time":"10:00 PM – 2:00 AM","location":"Swan Dive"},{"year":2019,"month":2,"day":30,"title":"Do you have game?  Come check out the Press Start Toronto, 90s gaming event!","description":"Please join us on Saturday March 30 2019, between the hours of 12pm to 5pm to play fun 90s video games, tournaments and entertainment. We're a fundraiser event in support of George Brown College Foundation and Sketch; The Working Arts Foundation.","time":"12:00 PM – 5:00 PM","location":"The Hive Esports"},{"year":2019,"month":2,"day":30,"title":"Drag Bingo","description":"We’re back and better than ever! Join us for a Drag-o-rific night of laughs, 'lewks', and plenty of BINGO!\nYour amazing host, Mona Moore, will take you through a fun-filled night of bingo, drag performances, and sweet prizes! We have dance-off tiebreakers, a l...","time":"7:30 PM – 11:00 PM","location":"Lee's Palace"},{"year":2019,"month":2,"day":30,"title":"Earth Hour Event: Imagining the Earth as an Exoplanet","description":"Join us for the AstroTours Earth Hour Event! The entire evening is free and no registration is required. Room ES1050 in the Earth Science Building (5 Bancroft Avenue). A panel of speakers will help us imagine we are an alien race observing the earth as an exop...","time":"7:00 PM – 10:00 PM","location":"Reichman Family Lecture Hall (ES1050), Earth Science Building"},{"year":2019,"month":2,"day":30,"title":"Earth Hour Show & Tell at Akin St. Clair","description":"This month Akin is hosting a relaxed and fun ‘Show and Tell for Artists’ at Akin's St. Clair studios (1747 St. Clair Avenue West). This month's Show and Tell will have an Earth Hour twist! Artists are encourage but are not required to share art that relates to...","time":"7:00 PM – 9:30 PM","location":"Akin St. Clair"},{"year":2019,"month":2,"day":30,"title":"ELECTRIC CIRCUS - 4AM LAST CALL","description":"Dance with us all night long to your favourite\n90s HOUSE and DANCE MUSIC\nwith DJs PAMMM and V∆NESS∆\nDOORS @ 11:00\n$5 or FREE before midnight\nSERVING until 4AM\nFollow us:\ninstagram.com/electriccircustoronto","time":"11:00 PM – 4:00 AM","location":"The Baby G"},{"year":2019,"month":2,"day":30,"title":"Embiria presents Spring Yoga x Brunch","description":"Join us at our popular Yoga x Brunch Experience where time will slow down and allow you to unwind, rejuvenate and focus on some much needed self-care, just in time to welcome Spring. Plus you'll go home with AMAZING goodies valued at over $100. Treat yourself,...","time":"9:00 AM – 11:00 AM","location":"Cambria Gallery"},{"year":2019,"month":2,"day":30,"title":"Encircled In-Studio Social: Empowered Women Edition","description":"Join us at our Spring In-Studio Social!\nThis social, we’re celebrating strong female entrepreneurs in Toronto because empowered women empower women.\nIn honour of Women’s History Month, we’ll be hosting an engaging panel of female entrepreneurs from the fashion...","time":"9:30 AM – 2:00 PM","location":"Encircled HQ"},{"year":2019,"month":2,"day":30,"title":"FADED - A night of Hip Hop, Dancehall and More","description":"Family Business presents their latest party, FADED, featuring a night of your favorite hip hop, dancehall and R&B; tracks. Tucked at the back of The Rec Room (Toronto's new entertainment venue), the boys from Family Business will keep you dancing all night lon...","time":"10:00 PM – 2:00 AM","location":"The Rec Room"},{"year":2019,"month":2,"day":30,"title":"Fair Trade Fayre","description":"Learn about Fair Trade with speaker Samuel Ansell, CEO of Casa Relief organization from 12:30 pm - 1:00 pm. Then shop the world between 1:00 pm - 3:00 pm from a selection of Fair Trade and ethical vendors including Talis, Moyaa Shea, Casa Relief and Cocoa Cami...","time":"12:30 PM – 3:00 PM","location":"Beach United Church"},{"year":2019,"month":2,"day":30,"title":"Family Fan Day","description":"Don’t miss this year’s Canadian Screen Awards Family Fan Day! Come meet your favourite stars on Saturday, March 30 from 10am to 2pm at the Sony Centre for the Performing Arts! Hosted by Suki & Spencer from The Zone on YTV, it’s a FREE event with unlimited fun ...","time":"10:00 AM – 2:00 PM","location":"Sony Centre for the Performing Arts"},{"year":2019,"month":2,"day":30,"title":"Film Screening RAZZIA and AVE MARIA","description":"Razzia (Feature)\nDirected by: Nabil Ayouch\nCasablanca: vibrant and rough, inviting yet unforgiving. Four souls in search of truth, thirty years after a passionate teacher in the Atlas Mountains was put to silence… Through the echo of his shattered dreams, the ...","time":"7:00 PM – 10:00 PM","location":"Innis Cafe"},{"year":2019,"month":2,"day":30,"title":"Friendly Faces Comedy Showcase","description":"An upbeat and positive night of stand up featuring a fun group of Toronto comedians.\nTickets: $12 general admission/$10 for Second City Training Centre students with a valid card","time":"8:00 PM – 9:30 PM","location":"Second City Training Centre 3rd Floor"},{"year":2019,"month":2,"day":30,"title":"Geek Hard LIVE!","description":"Geek Hard, the popular internet radio show and podcast, brings you a night nerdy hilarity. Andrew and Mr. Green host an evening of nerd comedy featuring performances by Beggar's Canyon and Yaw Attuah!\nPlus, special guest interviews, and more! There are also gl...","time":"7:00 PM – 8:30 PM","location":"Comedy Bar"},{"year":2019,"month":2,"day":30,"title":"How to Take Better Photos for Social Media","description":"Grab your smartphone camera or DSLR for this fun and hands-on workshop, where you’ll learn how to take better photos that will be liked, shared and remembered. Discover how to setup the perfect product shot, a flat lay, a portrait or selfie, and how to shoot “...","time":"10:00 AM – 1:00 PM","location":"Camp Tech"},{"year":2019,"month":2,"day":30,"title":"I'm With the Band: An Open Jam Session for Mental Health","description":"ALL INSTRUMENTS are PROVIDED & ALL SKILL LEVELS ARE WELCOME.\n100% of ticket sales will be donated to Full Circle- Art Therapy Centre.\nAn fun and friendly open musical improv session to raise funds to provide mental health care for underprivileged individuals l...","time":"7:00 PM – 10:00 PM","location":"Antikka"},{"year":2019,"month":2,"day":30,"title":"Intrigue at the AGO Scavenger Hunt","description":"A famous artist’s suspicious death, a vanished journalist, and the legend of da Vinci's hidden trove converge in this art mystery scavenger hunt inside the Art Gallery of Ontario (AGO).\nWhen an arts journalist digs into the cold case of a local artist from ove...","time":"1:00 PM – 3:30 PM","location":"Art Gallery of Ontario"},{"year":2019,"month":2,"day":30,"title":"Intro to Performance Art with Artist-in-Resident Marisa Hoicka","description":"Ever wonder what makes up a performance art piece? Join us at Fool’s Paradise, former home and studio of Doris McCarthy, for this hands-on workshop with artist-in-resident Marisa Hoicka. Come learn the origins of performance art and try performing in a support...","time":"11:00 AM – 1:00 PM","location":"Fool's Paradise"},{"year":2019,"month":2,"day":30,"title":"Jackets, The Marwills, Melissa Murphy, Alex Mason","description":"Come celebrate the release of the new Jackets album at Handlebar with your pals Jackets, The Marwills, Melissa Murphy, and Alex Mason!\nhttps://www.facebook.com/JacketsMusic/\nhttps://themarwills.bandcamp.com/\n$10 cover at the door, or bring a buddy and admit tw...","time":"9:00 PM – 2:00 AM","location":"Handlebar"},{"year":2019,"month":2,"day":30,"title":"Juicebox - Monthly Dance Party","description":"Juicebox is a dance party catering to those who love Indie, New Wave, 80's, Electronic Synth Pop, Alternative and Britpop. Hosted by Babs (Dj Babe Decibel) and Jorge (Dj Tweed) at The Piston every last Saturday of the month! Cover $10","time":"10:00 PM – 2:00 AM","location":"The Piston"},{"year":2019,"month":2,"day":30,"title":"Julian Taylor Band \"Avalanche\" Release Show","description":"Julian Taylor Band celebrate the release of their brand new album Avalanche.\nTORONTO ALBUM RELEASE SHOW\nwith special guest Mikhail Laxton\nWHEN: Saturday, March 30, 2019\nWHERE: The Great Hall, 1087 Queen Street West, Toronto, ON\nTICKETS: https://www.ticketfly.c...","time":"8:00 PM – 11:00 PM","location":"The Great Hall"},{"year":2019,"month":2,"day":30,"title":"Kora","description":"Day time Deep House event with Kora (Anjuna Deep) at Love Child Social House: 3-9pm, $20 tickets available now","time":"3:00 PM – 9:00 PM","location":"Love Child Social House"},{"year":2019,"month":2,"day":30,"title":"Ladies Learn to Lead - Bachata","description":"Stuck in a dance rut? Tired of hearing, “just follow”? Ladies Learn to Lead offers Latin dance workshops for followers to gain a new perspective on leading fundamentals.\nThe goal of our workshops is to break the communication barrier between leaders and follow...","time":"11:00 AM – 1:00 PM","location":"City Centre Dance"},{"year":2019,"month":2,"day":30,"title":"Letter from Masanjia // Canadian Screen Arts Festival","description":"Canadian Screen Award Nominee - Ted Rogers Best Feature Length Documentary\nWhen a woman in Oregon opens a box of Halloween decorations and finds an SOS letter penned by a political prisoner from inside a Chinese labour camp, her discovery makes waves across ma...","time":"6:00 PM – 7:15 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":2,"day":30,"title":"Lost & Found Q&A screening with writer/director Liam O Mochain","description":"Q&A; screening of Irish film LOST & FOUND with Writer/Director Liam O Mochain at the Carlton Cinema Toronto. The film will screen for a minimum of a week. Includes Q&A; screening on Saturday 30th March at 6.45 pm co-presented by the Toronto Irish Film Festival...","time":"6:45 PM – 8:45 PM","location":"Imagine Cinemas Carlton"},{"year":2019,"month":2,"day":30,"title":"Low Carb Lifestyle Show","description":"Celebrate the Low Carb Lifestyle!\nThe Low Carb Lifestyle Show brings Toronto’s low carb community together.\nThe Low Carb Lifestyle Show celebrates the popular low carb and keto lifestyle. The first of its kind in Toronto and in Canada, low carb and keto enthus...","time":"10:00 AM – 8:00 PM","location":"Delta Toronto"},{"year":2019,"month":2,"day":30,"title":"Machine Learning & Data Science 101","description":"Do you want to get a job in Data Science or Machine Learning, but you’re not sure how to learn EVERYTHING YOU NEED TO LEARN?\nWould you like some hands-on help to give you a foundation? (for FREE)\nWould you like to understand how to use python? And the Python l...","time":"10:10 AM – 12:10 AM","location":"8200 Warden Avenue"},{"year":2019,"month":2,"day":30,"title":"Mandle Philharmonic presents 'Mahler & Tchaikovsky'","description":"Mahler & Tchaikovsky\nConductor: Mandle Cheung\nSoloist: Kevin Ahfat\nSaturday, March 30th, 2019, 7:00 PM\nToronto Centre for the Arts, George Weston Recital Hall\nTicket Information\nAdult $10 | Student/Child rate - 18 and Under $6 | Seniors over 65 - $6\nTickets av...","time":"7:00 PM – 9:00 PM","location":"Toronto Centre for the Arts"},{"year":2019,"month":2,"day":30,"title":"MFNP Presents: Vaughan Nights Comedy Show","description":"MFNP is back again to bring you one of the hottest shows in the city!\nThis time, with another line up of some of the best working comedians in the country! These comedians have toured all across Canada and the States, and have been featured on Just For Laughs,...","time":"9:00 PM – 11:00 PM","location":"Lake Wilcox Brewing"},{"year":2019,"month":2,"day":30,"title":"Mindful Walk with Lachlan Crawford, ND","description":"Let's take a walk!\nUse your body and your mind at a mindful walking workshop in Toronto’s Trinity Bellwoods Park this spring.\nTogether we will tap into the body’s physical power to ground and centre us as we explore deep awareness of movement, the environment,...","time":"9:00 AM – 10:15 AM","location":"Darou Wellness"},{"year":2019,"month":2,"day":30,"title":"Naked & Famous x Dutil Denim Launch","description":"For over 10 years, Dutil and Naked & Famous Denim have worked together, united by a mutual passion for raw denim, Japanese craftsmanship and design. To celebrate this decade of friendship, we're proud to launch the collaborative Dutil x Naked & Famous Denim Su...","time":"1:00 PM – 5:00 PM","location":"Dutil Denim"},{"year":2019,"month":2,"day":30,"title":"Nature Blows Our Minds!","description":"Do you value environmental education, but don’t know how to engage kids with abstract concepts such as habitats and biodiversity? Are you looking for fun kids activities to celebrate Earth Hour and Earth Day? Bring your kids to our workshop and see how game-ba...","time":"2:00 PM – 3:00 PM","location":"Centre for Social Innovation"},{"year":2019,"month":2,"day":30,"title":"Obsessive Pop Tendencies","description":"Pleasure Dome presents Obsessive Pop Tendencies, a film program exploring shipping memes, screaming teen girls, daytime dramas, and how fandom crosses over into contemporary art practices. Curated by Rea McNamara.","time":"7:00 PM – 10:00 PM","location":"Buddies in Bad Times"},{"year":2019,"month":2,"day":30,"title":"PETER HARRIS: Machines for Living - New Paintings","description":"\"Inspired by a quote from architect Le Corbusier who wrote that “A house is a machine for living in.”, I wanted to consider the “machines” that are a vital adjunct to the city. The paintings in this series are portraits of the structures, devices and tools nec...","time":"10:00 AM – 5:00 PM","location":"Mira Godard Gallery"},{"year":2019,"month":2,"day":30,"title":"Pictures at an Exhibition","description":"Fundraiser for Orchestra Toronto\nSaturday March 30, 2019 at 7:30 pm\nAdmission $50/for one. $90/for two\nPurchase tickets at 416 467 7142 In advance at Eventbrite\nPianist Richard Herriott presents an auditory album of musical delights for the piano, in an evenin...","time":"7:30 PM – 10:00 PM","location":"Gallery 345"},{"year":2019,"month":2,"day":30,"title":"Pretty Things by Toastr - LGBTQ event for women","description":"Hi hi hi!\nThe promise of Spring and new beginnings is in the air. So let's convene to dance, mingle, be gay and get litty.\nA lounge-style party is the vibe at Founder Bar on Dundas West. A sophisticated venue with dimmed nuances and sexy feels.\nHip hop, R&B;, ...","time":"10:00 PM – 2:00 AM","location":"Founder"},{"year":2019,"month":2,"day":30,"title":"Rise and Fall of the City of Mahagonny by Kurt Weill","description":"VOICEBOX: Opera in Concert concludes the current season with Kurt Weill and Bertolt Brecht’s RISE AND FALL OF THE CITY OF MAHAGONNY, an unblinking look at social tensions in Weimar Germany. The work premiered at the Neues Theater in Leipzig in 1930. Weill and ...","time":"8:00 PM – 10:40 PM","location":"St. Lawrence Centre for the Arts"},{"year":2019,"month":2,"day":30,"title":"Rosalie Vaillancourt comedy event - Toronto Francophone Week","description":"Francophonie en Fete is pleased to invite you to the comedy show featuring the talented Quebec comedian Rosalie Vaillancourt. As part of Toronto Francophone Week, she will be in Toronto on Saturday, March 30, 8pm, at the Spadina Theatre, L’Alliance Francaise, ...","time":"8:00 PM – 11:00 PM","location":"Spadina Theatre - Alliance Francaise"},{"year":2019,"month":2,"day":30,"title":"Rugby World Cup is coming to Hemingway's!","description":"Come see the William Webb Ellis Cup at Hemingway's this Saturday! That's right, the REAL trophy is touring the world, and we're proud to be it's destination in Toronto! (Only one of three venues in all of Canada)\nWhat you need to know:\n- 4pm - 7pm\n- No cover o...","time":"4:00 PM – 7:00 PM","location":"Hemingway's"},{"year":2019,"month":2,"day":30,"title":"Saturday Family Clay","description":"Every Saturday is a family art day at LucSculpture. Call us and book a spot for your family and friends to make clay sculpture and hand built ceramics. We will fire the clay pieces for you! Reunite the family doing art and it is fun for everyone!\nTime: Every S...","time":"1:00 PM – 4:00 PM","location":"LucSculpture School & Studios"},{"year":2019,"month":2,"day":30,"title":"Shove It Down My Throat","description":"In 2013, Luke O’Donovan is arrested after a knife fight at a New Year’s party. The media portrays him as a maniac who went on a stabbing spree. Luke says he’s the victim of a queer-bashing, punished for fighting back. In 2014, theatre artist Johnnie Walker beg...","time":"8:00 PM – 10:30 PM","location":"Buddies in Bad Times"},{"year":2019,"month":2,"day":30,"title":"Singsation Saturday of World Music","description":"This TMC Singsation Saturday choral workshop will be led by Suba Sankaran & Dylan Bell of FreePlay. Join us for an introduction to South Indian music, plus some jazz, blues, folk and pop.","time":"10:00 AM – 1:30 PM","location":"Calvin Presbyterian"},{"year":2019,"month":2,"day":30,"title":"SMASH!","description":"Noah Maloney and D.J. Mausner each do 30 minutes of comedy with a few friends.\n19+. Very stupid.","time":"11:00 PM – 12:00 AM","location":"Bad Dog Comedy Theatre"},{"year":2019,"month":2,"day":30,"title":"SNOWgarden Party!","description":"Interactive Rock Operetta for family audiences. Children sing, dance and drum and learn to speak the language of nature.","time":"11:00 AM – 11:45 AM","location":"Palmerston Public Library Theatre"},{"year":2019,"month":2,"day":30,"title":"Soul Night at Alchemy featuring The Beverley Street Trio","description":"We are back at Alchemy, come on down for a night of R&B;, Motown, and Funk all with a soulful twist!\nShow starts at 10:30\nNo cover\nKitchen open 12PM - 12AM\nDrink specials available 5-8PM","time":"10:30 PM – 2:00 AM","location":"Alchemy Food & Drink"},{"year":2019,"month":2,"day":30,"title":"Spring Thaw 2019 Dinner and Dance","description":"On Saturday, March 30th, 2019, the Broad Reach Foundation for Youth Leaders will host Spring Thaw 2019 – Sail it Forward for Youth! dinner and dance at The Boulevard Club to support the Foundation’s work with disadvantaged, at risk and vulnerable youth, and to...","time":"7:00 PM – 12:00 AM","location":"The Boulevard Club"},{"year":2019,"month":2,"day":30,"title":"SSC Spikeball Tournament","description":"WHAT:\n2 on 2 Spikeball Tournament.Teams consist of two players with no co-ed restrictions. All teams guaranteed to play a minimum of 4 x 30-minute games.Games will be played on sand.\nSKILL LEVELS:\nWe are now offering both recreational and intermediate division...","time":"1:00 PM – 6:00 PM","location":"National Beach Centre"},{"year":2019,"month":2,"day":30,"title":"Stiletto Flats at Drums N Flats","description":"The Flats are back at their fav North Toronto venue. The always awesome staff at Drums N Flats deliver the best in service and smiles! Dance to rock, retro, and more played Stiletto Flats style!\nShow starts at 9:30 PM. $10 cover! Tickets can be purchased at th...","time":"9:30 PM – 1:00 AM","location":"Drums N Flats"},{"year":2019,"month":2,"day":30,"title":"Stuffy's For SickKids","description":"Build a stuffy, and help build a new SickKids! Join us on March 30 & 31 for a 45-minute workshop, and a chance to create your very own, cute and cuddly, stuffy! Decorate a t.shirt for your stuffy to make it one-of-a-kind... just like you!\n$30 per participant (...","time":"10:00 AM – 6:00 PM","location":"Designher Co."},{"year":2019,"month":2,"day":30,"title":"Sunkist Picnic in the Grove Pop-Up Event","description":"Sunkist will be recreating the experience of picnicking in a California citrus grove, allowing Torontonians to warm up, share real moments with family and friends, and discover the benefits of Sunkist citrus with DIY expert Natalie Ho.\nOn Saturday, March 30, S...","time":"11:00 AM – 5:00 PM","location":"369 King St West"},{"year":2019,"month":2,"day":30,"title":"Take a Chance with DJ Julia Dickens","description":"DJ Julia Dickens spins all vinyl Euro Disco and the sweetest tunes to make you feel good. No cover!","time":"10:00 PM – 2:00 AM","location":"Farside"},{"year":2019,"month":2,"day":30,"title":"The Be-Sharps & Friends","description":"The Be Sharps, the reigning (Plow) Kings of Canada, return to Coalition: T.O for a set of your favourite songs from The Simpsons!\nJoining them will be surf punk instrumentalists Mark Malibu & the Wasagas, and AC/DC tribute AMY/DC featuring members of Saigon Ho...","time":"9:00 PM – 2:00 AM","location":"Coalition"},{"year":2019,"month":2,"day":30,"title":"The Funniest Show on The Danforth","description":"The Funniest Show on The Danforth with DUO DAD IS THE MOST UNIQUELY ENTERTAINING comedy/variety show ON EARTH. THIS MONTH joining DUO DAD is Herbeaver, Matt Santos, Abbas Wahab, Michelle Coburn, and Angela Maiorano-Thurston.","time":"9:30 PM – 10:30 PM","location":"Social Capital Theatre"},{"year":2019,"month":2,"day":30,"title":"The Metamorphosis Gala","description":"Fresh for spring 2019, the Canadian Lesbian and Gay Archives (CLGA) is hosting its annual gala fundraiser on Saturday, March 30 at the Bram and Bluma Appel Salon at the Toronto Reference Library. We are delighted to announce that CBC personality Mary Ito will ...","time":"6:00 PM – 1:00 AM","location":"Bram and Bluma Appel Salon (Toronto Reference Library)"},{"year":2019,"month":2,"day":30,"title":"The Stevie Ray Vaughan Experience Live at the Linsmore Tavern for a Saturday night!","description":"The Linsmore Tavern was named one of Canada's top 35 Blues music venues in all of Canada and one of the reasons why the Linsmore was named one of the best in blues music is because of this particular act who will absolutely blow you away! On Saturday March 30h...","time":"8:00 PM – 11:59 PM","location":"Linsmore Tavern"},{"year":2019,"month":2,"day":30,"title":"Toronto Anti AirPod Owner MeetUp","description":"A gathering to share our collective disdain for Airpods, and to let Apple Air Pod users know that they ain't shit. #podsaintshit\nOFFICIAL EVENT MERCH:\nhttps://teespring.com/stores/blair-pods-hot-shop\nUSE CODE: BLAIR15 FOR 15$OFF\nInsta @antipodsquad\nThey got th...","time":"12:00 PM – 4:00 PM","location":"Yonge and Dundas Square"},{"year":2019,"month":2,"day":30,"title":"Toronto Bar Crawl #31","description":"Toronto Bar Crawl has been running regularly scheduled bar tours in downtown Toronto since August 2017.\nWe gather friendly fun people looking to meetup and party at a few down to earth bars for a great night out.\nYou can keep up with our event schedule at our ...","time":"6:30 PM – 10:30 PM","location":"Multiple Venues"},{"year":2019,"month":2,"day":30,"title":"Tour de Danse","description":"Get ready for a high-energy performance! Coming up is Toronto Dance Theatre's signature Tour de Danse event, where members of the community will perform alongside our company dancers for a one-night-only show in support of TDT. You will get to see company danc...","time":"8:00 PM – 10:30 PM","location":"Winchester Street Theatre"},{"year":2019,"month":2,"day":30,"title":"Trash Tag Challenge Clean Up -Mud Creek/Brickworks Trails","description":"🌎Green vs Grey invites you to take on the Trash Tag Challenge!! 💪Clean up of Mud Creek! Home to Coyotes, Turtles, Racoons, Frogs, Birds, and many others. 🧚🏼‍♀️🐺🐛🦋🐌🐝🦉🦆🦇🕷🕸🐢🐦🦊🐭🐰🐹🐸\nSpring is about to sprung and the equinox is upon us. As the s...","time":"9:00 AM – 2:00 PM","location":"Evergreen Brick Works"},{"year":2019,"month":2,"day":30,"title":"Twice Loved Kids' Clothing, Toys, and Gear Sale","description":"March 30th 10am-12pm\nLots of high-quality pre-owned items at great prices!","time":"10:00 AM – 12:00 PM","location":"Dennis R. Timbrell Recreation Center"},{"year":2019,"month":2,"day":30,"title":"Untitled w/ Adam X & Orphx","description":"Untitled is a series of events brought to you by like-minded individuals who believe your experience should not just stop at the audio, but also be a visual sensation. Featuring Adam X and Orphx alongside visuals by Fezz Stenton, going down in a west side indu...","time":"10:30 PM – 5:00 AM","location":"500 Keele Warehouse"},{"year":2019,"month":2,"day":30,"title":"Watercolor Workshop: Learn to Paint Flowers","description":"An exclusive watercolour workshop held by Coco Bee, the watercolour artist behind the 1.3 million views “5MIN Beginner’s Watercolor Tips” Rainbow Whale video. In this 1.5-hour workshop, we will be learning to paint flowers from start to finish and explore the ...","time":"1:00 PM – 2:30 PM","location":"Make Lemonade"},{"year":2019,"month":2,"day":30,"title":"When We Were Young","description":"Exultate Chamber Singers combines forces with Chorus Niagara Children's Choir in a special afternoon concert celebrating the joy of youth and music. Highlights include Rutter's Mass of the Children and music by Corlis, Ešenvalds, Whitacre, and more!\nTickets: $...","time":"4:00 PM – 5:00 PM","location":"St. Thomas's Anglican Church"},{"year":2019,"month":2,"day":30,"title":"Wild Wild Party @ Duffy's Tavern --- All Vinyl Rock n' Soul Dance!","description":"All Vinyl 45rpm 1950s-60s maximum rock n soul DANCE PARTY!\nGarage! Beat! RnB! Rock n Roll! Soul!\nThe Wild Wild Part in the Wild Wild Cavern @ Duffy's Tavern\nw/DJ Derek B\n$5 --- FREE before 11pm","time":"10:00 PM – 2:30 AM","location":"Duffy's Tavern"},{"year":2019,"month":2,"day":30,"title":"Yoga and Plant Based Lunch","description":"Lauren Lefebvre and Jessica Almonte are hosting a restorative afternoon. First, join us for a 60 minute yoga class followed by guided meditation, reiki healing and aromatherapy massages. Then we'll provide a delicious plant based lunch!","time":"1:30 PM – 4:30 PM","location":"Lotus Yoga Centre"},{"year":2019,"month":2,"day":30,"title":"Young Picasso // Exhibition on Screen","description":"Travel to the three European cities—Málaga, Barcelona, and Paris—that had huge influence on Pablo Picasso as a young painter and shaped him into the extraordinary, prolific artist he later became. Looking at two key periods in Picasso’s life—the Blue Period an...","time":"1:00 PM – 2:25 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":2,"day":31,"title":"Christie Pits Graphic Novel Book Launch","description":"Dirty Water Comics is excited to announce the release of Christie Pits, a timely historical-fiction graphic novel set in Toronto. In an age of increasingly hateful discourse, Christie Pits looks back at the social conditions that sparked Canada's largest race-...","time":"2:00 PM – 3:30 PM","location":"Congregation Beth Tzedec"},{"year":2019,"month":2,"day":31,"title":"Corrado's Barber Shop Fundraiser","description":"In support of a dear friend who is such a wonderful solid stand up guy that given so much character to our city; A skateboarding, boombox carrying, barber clown. Adam lost his stepson, his business and his home to a terrible fire at Bathurst/Richmond. All ...","time":"7:00 PM – 2:00 AM","location":"Bovine Sex Club"},{"year":2019,"month":2,"day":31,"title":"Homeshake","description":"Collective Concerts Presents Homeshake with Yves Jarvis Sunday, March 31st The Phoenix Concert Theatre Toronto, ON Doors 7pm / All Ages Tickets on sale now! https://www.ticketfly.com/purchase/event/1806420 Also available at Rotate This and Soundscapes...","time":"7:00 PM","location":"Phoenix Concert Theatre"},{"year":2019,"month":2,"day":31,"title":"Leslieville Farmers' Market","description":"Thank you to everyone who supported our first winter market season! March 31st is your last chance to stop by our winter market. We will be starting back up on May 12th in Jonathan Ashbridge Park for our 9th summer season! Activities: Kids activities start at ...","time":"10:00 AM – 3:00 PM","location":"The Redwood Theatre"},{"year":2019,"month":2,"day":31,"title":"March 2019 Toronto Pug Grumble","description":"IT'S A PUG MEETUP!!!\nBring your pugs to the Dog Bowl in Trinity Bellwoods park on Sunday, the 31st of March 2019 from 2:00PM to 4:00PM for a Toronto Pug Grumble! There will be lots of snorting, rolling and grumbling.\nPugs, Buggs, Chugs, Frugs, Jugs, Puggles an...","time":"2:00 PM – 4:00 PM","location":"Dog Bowl in Trinity Bellwoods Park"},{"year":2019,"month":2,"day":31,"title":"Old Book and Paper Show","description":"All manner of curious and interesting vintage paper, antique photography, vintage books - every conceivable type of vintage printed material, all under one roof. Collectors and dealers in old paper, ephemera, photography and books get together for the biggest ...","time":"10:00 AM – 4:00 PM","location":"Artscape Wychwood Barns"},{"year":2019,"month":2,"day":31,"title":"Toronto Downtown Record Show","description":"THE TORONTO DOWNTOWN RECORD SHOW is back.\r\nWe're at it again with almost 100,000 records on sale.\n\r\nOver 40 tables of records, all from different vendors, selling the best Vinyl Records you need.\r\nMANY STYLES AND SOUNDS OF MUSIC WILL BE THERE FOR YOU TO DIG UP...","time":"11:00 AM – 4:00 PM","location":"Estonian House"},{"year":2019,"month":2,"day":31,"title":"163 John St. : THE DANGER ROOM @ THE CORNER","description":"THE DANGER ROOM\nHOSTS: DAN GUIRY & MORGAN O'SHEA\n'The Danger Room' is marathon style show with a variety of professional and amateur comedians testing their most dangerous and explicit material. Audience members are encouraged to boo and heckle comedians durin...","time":"9:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":2,"day":31,"title":"56 Minutes : A Comedy Showcase, Vol. 15","description":"March is an exciting month. We are finally approaching the end of winter. Say farewell to the winter with this hot comedy show! Toronto's wacky comedy show gets hotter with this stellar line up. You will sweat and laugh at the same time (or just laugh)\nHosted ...","time":"7:00 PM – 8:30 PM","location":"Comedy Bar"},{"year":2019,"month":2,"day":31,"title":"6th Annual Music March for Music Therapy","description":"Get ready for the 6th annual Music March for Music Therapy!\nThis year our fundraising goal is $40,000! Help us reach it by purchasing a ticket to the after-party or creating a fundraising page here: https://www.canadahelps.org/en/charities/885510008RR0001-cana...","time":"11:30 AM – 3:00 PM","location":"Multiple Venues"},{"year":2019,"month":2,"day":31,"title":"7th Annual Spin-a-Thon","description":"7th Annual Spin-A-Thon! March 31, 1:00 PM to 7:00 PM @ Torq Ride spinners will have fun, get fit, and fundraise for Youth Assisting Youth | The Peer Project’s proven youth mentoring program for at-risk and newcomer kids. Spin for one hour or more of non-stop m...","time":"1:00 PM – 7:00 PM","location":"Torq Ride (Energia Athletics 2nd Floor)"},{"year":2019,"month":2,"day":31,"title":"946 QUEEN ST. EAST : SUNDAY BEST @ THE CORNER EAST","description":"Every Sunday at The Corner Comedy Club EAST, TAMARA SHEVON will be hosting SUNDAY BEST! A lineup of Canada’s best comedians.\nThere's gonna be 2 shows, 8PM & 10PM, each with a different set of comics. Credits include Just For Laughs, JFL 42, CBC, Comedy Network...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":2,"day":31,"title":"Abstract Paint Pouring - Freestyle Painting","description":"Join us for a freestyle abstract paint pouring drop in session!\nGet creative and pour fluid paints on to canvas or wooden birch wood panels to create vibrant acrylic artwork.\nJust pay for your canvas or wooden panel size and we will include all paint pouring m...","time":"11:00 AM – 1:30 PM","location":"Fresh Paint Studio (Danforth East)"},{"year":2019,"month":2,"day":31,"title":"Adwa-An African Victory, part of the film series Resistance & Revolution: The Cinema of Haile Gerima","description":"Film\nAdwa — An African Victory\nDir. Haile Gerima\n1990 | 97 min\nIn 1896, Ethiopian forces armed mainly with spears and knives, defeat a well-equipped and organized Italian military bent on colonization. This victory ignited a flame of hope for freedom and indep...","time":"1:00 PM – 3:00 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":2,"day":31,"title":"Align, Activate & Attract","description":"ALIGN, ACTIVATE + ATTRACT\n7-week journey to attract what you desire from the inside out.\nLearn how to be a magnetic creator! Explore in a sacred space to deep dive into your innate ability to align your heart to your mind, activate the passion within, and attr...","time":"2:00 PM – 4:00 PM","location":"Tribe Fitness"},{"year":2019,"month":2,"day":31,"title":"An Afternoon Paint Party","description":"SUNDAY FUNDAY!!!!!\nIts the perfect weekend hang out. Theres no need to be artsy or creative! Bc you know what, YOU ARE CREATIVE!!! its a hidden trait in all of us! (not to be cheesy!) Let us help you tap into that inner creativity of yours!!!!\nHow does this wo...","time":"1:00 PM – 5:00 PM","location":"Paint Cabin"},{"year":2019,"month":2,"day":31,"title":"A Taste of Jewish Montreal with Yidlife Crisis & Rose and Sons","description":"Wilensky’s. Schwartz’s. Cheskie’s. Discover the roots of Montreal’s vibrant Jewish community through the classic eateries that tell its story. We’re pairing the Toronto premiere of \"Chewdaism\", the first feature film by the creators of the wildly popular web s...","time":"6:00 PM – 7:40 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":2,"day":31,"title":"Beauty Apero","description":"Do you have curly hair that's too dry, untamed and hard to manage? Have you tried everything with no result? Curl Flippers is here to help.\nYou're invited to our three-hour workshop opened to women with 2a hair to 4c hair who are eager to treat their locks wit...","time":"3:00 PM – 6:00 PM","location":"Salon B (Curl Flippers)"},{"year":2019,"month":2,"day":31,"title":"Blues Sunday w The Frank Cosentino Band in March at the Linsmore Tavern","description":"The Frank Cosentino Band who will be performing on Sunday March 31st! Only the best in blues music when it comes to Blues Sunday at the Linsmore and that is definitely the case on the last Sunday of the month with The Frank Consentino Band! Frank Consentino is...","time":"7:00 PM – 11:00 PM","location":"Linsmore Tavern"},{"year":2019,"month":2,"day":31,"title":"Borrel presents: March Rijsttafel","description":"The Dutch-Indonesian rijsttafel (rice table) is an elaborate collection of dishes that present a melange of sweet, spicy and savoury flavours to the palate. Served in a buffet-type setting, rijsttafel pairs the Dutch ethos of togetherness (gezelligheid) with I...","time":"6:00 PM – 9:00 PM","location":"Borrel"},{"year":2019,"month":2,"day":31,"title":"Burlesque at Cherry Cola's: Aries Season","description":"Sinful Sundays is Cherry Cola's signature burlesque event!\nCome be entertained at our weekly \"temple of tease\" where we feature a fresh lineup of gorgeous burlesque entertainers, drag and variety acts.\nCelebrate Aries Season with babes in their (near) birthday...","time":"9:30 PM – 11:59 PM","location":"Cherry Cola's"},{"year":2019,"month":2,"day":31,"title":"Charity BootCAMP & Beer - Heart & Stroke - Camp Fuel","description":"Get your hearts pumping for a great cause! Proceeds from this BootCAMP & Beer class will be donated to the Heart and Stroke Foundation of Canada.\nGet your bootCAMP class provided by CAMP FUEL , then beer right after! It's called balance. Expect a full body wor...","time":"11:30 AM – 1:30 PM","location":"Junction Craft Brewing"},{"year":2019,"month":2,"day":31,"title":"Coast 2 Coast LIVE","description":"Coast 2 Coast LIVE is the Largest Artist Showcase in the World that brings together Artists, DJs, Producers, Media and more for a professional networking event & artist showcase. Artists in the showcase are judged by a panel of celebrity judges via the exclusi...","time":"9:00 PM – 12:00 AM","location":"1108 Dundas St W"},{"year":2019,"month":2,"day":31,"title":"Coffee & Canvas - Freestyle Painting","description":"Join us for an afternoon of 'Coffee and Canvas'!\nRelax and unwind with some freestyle painting and a cup of coffee or tea and a treat. A great way to spend some quality time with friends or family.\nMarch 31\n11am - 1:30pm\nJust pay for your canvas and we will su...","time":"11:00 AM – 1:30 PM","location":"Fresh Paint Studio (Danforth East)"},{"year":2019,"month":2,"day":31,"title":"'Don't You Want Me' Launch Party and Exhibit","description":"'Don't You Want Me' is a global documentary photography project showcasing the beauty and resilience of LGBTQ people with their rescued dogs. Coupling compelling images and personal narratives, Don’t You Want Me shows that individuals of all stripes have the a...","time":"5:00 PM – 7:00 PM","location":"Tom & Sawyer"},{"year":2019,"month":2,"day":31,"title":"Elevated Vibrations","description":"Experience the healing power of vibration through both a meditation and crystal singing bowl sound bath. Cassidy from Just Be Meditation will guide you through an opening meditation, followed by sound therapy with Alexandria Santaguida. Get ready to receive th...","time":"9:00 AM – 10:00 AM","location":"Indigo"},{"year":2019,"month":2,"day":31,"title":"Embroidered Memories","description":"“Embroidered Memories” is a folk-art installation and exhibit that features hand-embroidered Ukrainian Canadian pillows (Ukrainian: podushky), collected from Ukrainian-Canadian families across Canada. The exhibit space at St.Vladimir Institute will be filled w...","time":"10:00 AM – 4:00 PM","location":"St. Vladimir Institute"},{"year":2019,"month":2,"day":31,"title":"Florivox Presents: A Tribute To The Greats","description":"Join Florivox Choir and conductor Joshua Tamayo as they pay “Tribute to the Greats” at their next concert of the season. The program includes an array of classic pop hits from artists including The Beatles,ABBA, Aretha Franklin, Madonna, Queen, and many more. ...","time":"3:00 PM – 5:00 PM","location":"Beach United Church"},{"year":2019,"month":2,"day":31,"title":"GOLD Women's History Month","description":"GOLD the comedy show that celebrates women and gender non-conforming comedians. Featuring: Surer Qaly Deria, Adrienne Fish, Meg Mackay, Burlesque by Imogen Quest Headlined By: Coko & Daphney Hosted + Produced by: Anasimone George","time":"9:30 PM – 11:00 PM","location":"Bad Dog Comedy Theatre"},{"year":2019,"month":2,"day":31,"title":"Heat: A Burlesque to Fight Climate Change","description":"It's easy to feel helpless when reading the news about climate change. The UN climate report released in late 2018 let us know that we have until 2030 to cut carbon emissions by 45% from 2010 levels to avoid catastrophic warming. What's more, we know that litt...","time":"7:00 PM – 10:00 PM","location":"Revival"},{"year":2019,"month":2,"day":31,"title":"Hush Pup, Zones, Kristian North, Ed Munstay","description":"We are very thrilled to announce the release of our debut full length album, \"Panacea\" launching 22.03.19 via Victoria/Montreal based label, Lone Hand (lonehand.xyz).\nVideo for \"Oasis\" off of Panacea\nhttp://bigtakeover.com/news/VideoPremiereOasisbyHushPup\nFor ...","time":"8:00 PM – 1:00 AM","location":"Handlebar"},{"year":2019,"month":2,"day":31,"title":"Katie McBride with Dan Edmonds","description":"Toronto indie pop artist Katie McBride plays Burdock Music Hall with folk singer-songwriter Dan Edmonds March 31st. Tickets $10.00 advance and at the door, doors at 9pm and show at 9:30pm.","time":"9:00 PM – 11:30 PM","location":"Burdock"},{"year":2019,"month":2,"day":31,"title":"KUNDALINI REBIRTHING WORKSHOP:  UNLOAD YOUR PAIN AND FEAR","description":"Yogi Bhajan taught a series of Kundalini Yoga rebirthing kriyas in the late 80’s which all have a profound power to clean the subconscious mind. Join Bir Kaur and be guided through two of these shorter rebirthing kriyas designed to unload your pain and fear. P...","time":"1:30 PM – 3:30 PM","location":"Lotus Yoga Centre"},{"year":2019,"month":2,"day":31,"title":"La Traviata","description":"The Toronto City Opera presents Giuseppe Verdi's tragic love story featuring soloist Beth Hagerman as Violetta. The production is supported by the artistic team of Jennifer Tung, Ivan Jovanovic and Alaina Viau and a 40 member chorus. Opens March 28, 7:30 pm, a...","time":"2:00 PM – 4:30 PM","location":"Al Green Theatre, Miles Nadal JCC"},{"year":2019,"month":2,"day":31,"title":"Locals Only Sound","description":"MRG Concerts Presents:\nLocals Only Sound\r\nw/ Emma Lokai & Stefani H. Kimber\n\r\nSunday March 31, 2019.\nDrake Underground\r\n19+ DOORS: 7PM\n\r\nTickets on sale now!\nhttps://www.eventbrite.ca/e/56922826707\r\nGA Adv: $10.00 + S/C\r\nTickets at Eventbrite.ca, Rotate This &...","time":"7:00 PM – 11:00 PM","location":"The Drake Hotel"},{"year":2019,"month":2,"day":31,"title":"LoversLand Sample Sale","description":"Mark your calendars bridal babes. LoversLand is hosting its spring MEGA SAMPLE SALE.\n\r\nOn Sunday, March 31st, 2019 brides will receive 30%-60% off all selected gowns from some of our favourite designers including Rime Arodaky, Bo and Luca, Rue De Seine, Theia,...","time":"9:00 AM – 6:00 PM","location":"LoversLand"},{"year":2019,"month":2,"day":31,"title":"Make It an Indigo Morning: Elevated Vibrations","description":"Experience the healing power of vibration through both a meditation and crystal singing bowl sound bath. Cassidy from Just Be Meditation will guide you through an opening meditation, followed by sound therapy with Alexandria Santaguida. Get ready to receive th...","time":"9:00 AM – 10:00 AM","location":"Indigo Toronto Eaton Centre"},{"year":2019,"month":2,"day":31,"title":"March Pig Roast Feat. Beau's The Astromancer","description":"Join for our first pig roast of spring!\n$30 whole-hog buffet ($10 for kids) includes all-you-can-eat pig & sides and a beverage.\nFeatured beer: The Astromancer sage gruit beer, by Beau's All Natural Brewing Co.\nThe flavours in the beer will inspire the flavour...","time":"6:00 PM – 9:00 PM","location":"Earlscourt BBQ"},{"year":2019,"month":2,"day":31,"title":"Melanin Fetish: An All Black Kinky Burlesque Revue","description":"ES, Black folks can be into kink and BDSM, And YES, we're here to own that!\nJoin a thrilling cast of black burlesque stars as they deliver and serve up unapologetic kink and sex appeal!\nThe world of BDSM and Kink has often been thought to belong to whiteness, ...","time":"7:00 PM – 9:30 PM","location":"Round Venue"},{"year":2019,"month":2,"day":31,"title":"Miziwe - Everywhere","description":"Pax Christi Chorale\nDavid Bowser, Artistic Director & Conductor\npresents\nthe world premiere of\nMiziwe…(Everywhere…)\nA new oratorio by Barbara Croall\nperformed in Ojibwe Odawa language with surtitles\nSunday, March 31, 2019 at 3pm\nKoerner Hall\nat the Telus Centr...","time":"3:00 PM – 5:00 PM","location":"Koerner Hall"},{"year":2019,"month":2,"day":31,"title":"Murder at the ROM Scavenger Hunt","description":"A curator has been murdered and a trail of clues left behind, connected to secrets in the collections. As you solve clues, you’ll begin to piece together a tale of greed, lust, pride and revenge. There are multiple suspects, one victim and you, the sleuths, mu...","time":"1:00 PM – 3:30 PM","location":"Royal Ontario Museum"},{"year":2019,"month":2,"day":31,"title":"Mystical and Macabre","description":"A Musical Expression of Opposites! Sunday March 31, 3PM Amici Chamber Ensemble presents a unique program featuring the mystical juxtaposed with the macabre and an exploration of the overwhelming opposite feelings that come to all of us on a daily basis, expres...","time":"3:00 PM – 5:00 PM","location":"Mazzoleni Concert Hall, Royal Conservative Music"},{"year":2019,"month":2,"day":31,"title":"OTHER: A Diversity Showcase","description":"OTHER is a monthly comedy, art and music show at The Second City Training Centre showcasing emerging and seasoned performers identifying as OTHER. Each showcase will include free food* and an exhibition before and after the show featuring a variety of local ar...","time":"7:00 PM – 9:00 PM","location":"The John Candy Box Theatre"},{"year":2019,"month":2,"day":31,"title":"Personalized Wellness Technology Open House","description":"Join us this Sunday afternoon for an open house at Studio79 with special offers, snacks and prizes.\nStudio79 recently launched Jet and Infrared Sauna PODs and Spa services. More at https://studio79.ca/studio79-open-house\n* EMS Fitness Training - https://studio...","time":"11:00 AM – 1:00 PM","location":"Studio79"},{"year":2019,"month":2,"day":31,"title":"Prescription Self- Care Panel Series Part II: Movement","description":"Prescription Self-Care presents a seven part panel series showcasing powerful community leaders in Toronto's wellness space through monthly panel events. This panel will focus on the self-care realm of movement. Join us as we showcase four incredible community...","time":"3:00 PM – 5:00 PM","location":"Bolo"},{"year":2019,"month":2,"day":31,"title":"Puppy Love Yoga","description":"It's Yoga with puppies! We provide the puppies, you bring your mat and help socialize the little guys. Special GROUP DISCOUNT. Book at least 4 spots and enter code DOUBLEDATE at checkout to get one spot free. Because puppies!","time":"10:00 AM – 11:00 AM","location":"The Redwood Studio"},{"year":2019,"month":2,"day":31,"title":"Pysanky at DROM Taberna","description":"Learn the ancient art of Ukrainian Easter Egg decorating-- a sacred and meditative practice. Pysanky, as these eggs are known in Ukrainian, are made using the wax-resist \"batik\" method, in which designs are drawn or written onto the egg with beeswax, and then ...","time":"2:00 PM – 4:00 PM","location":"Drom Taberna"},{"year":2019,"month":2,"day":31,"title":"Side Hustle Sunday","description":"We are strong believers of sacred weekend time to reset, but the reality is sometimes you need one more day to get sh*t done.\nIntroducing Side Hustle Sunday at Make Lemonade, we provide the good vibes, you provide the hustle. Whether it's to grow your side gig...","time":"9:00 AM – 5:00 PM","location":"Make Lemonade"},{"year":2019,"month":2,"day":31,"title":"STRATFORD FESTIVAL ON FILM- CORIOLANUS","description":"The Stratford Festival production of Shakespeare’s Coriolanus is coming to Cineplex theatres across the country on March 31. Coriolanus, directed for the screen by Barry Avrich, is the latest event cinema offering from the Stratford Festival, which, under the ...","time":"2:00 PM – 5:00 PM","location":"Multiple Venues"},{"year":2019,"month":2,"day":31,"title":"Sud Salutations @ Eastbound Brewing Co.","description":"Join us on Sunday March 31st for 60 minutes of Vinyasa Flow yoga in the brewery led by Becki Charles, followed by a well deserved flight of Eastbound Brewing Co. beers! That's right, yoga and beer!","time":"10:00 AM – 11:30 PM","location":"Eastbound Brewing Company"},{"year":2019,"month":2,"day":31,"title":"Tantra 101 - For Individuals and Couples","description":"Tantra is the study of how to use the body, senses, feelings and energy to finally take life by the reins and live FULLY.\nThis 6 hour introduction to Tantra is a potent combination of theory and experience and provides the foundation for those wishing to take ...","time":"9:00 AM – 3:30 PM","location":"Dream Dance Yoga"},{"year":2019,"month":2,"day":31,"title":"The Arkin and Friends","description":"We’re super thrilled for the next The Arkin and Friends at The Crow’s Theatre in the east end.\nWe hope you’ll join us for our next show on Sunday, March 31st, 7:30pm start time.\nStarring The Monkey Toast Players: David Shore, Christy Bruce, Herbie Barnes, Lisa...","time":"7:30 PM – 8:30 PM","location":"Crow's Theatre"},{"year":2019,"month":2,"day":31,"title":"The Out of the Cold Art Showcase and Sale","description":"The 10th annual Beth Sholom/Beth Tzedec Out of the Cold Art Showcase and Sale, featuring works of art created by the guests who use the shelter. The highlight of the event is when the Artists address the audience at 2 p.m. Suggested donation, $5. For more info...","time":"1:00 PM – 3:00 PM","location":"Beth Sholom Synagoue"},{"year":2019,"month":2,"day":31,"title":"Toronto Reptile Expo: March 31st","description":"The Toronto Reptile Expo is on March 31st at the International Centre! Join us for a fun family day of reptile appreciation!\nReptile Breeders, vendors, enthusiasts and experts all in one place. Learn about and purchase a new family member!\nDoors open at 9am ti...","time":"9:00 AM – 4:00 PM","location":"International Centre"},{"year":2019,"month":2,"day":31,"title":"WESLODGE Sunday Funday Trivia","description":"The big yellow doors on King Street mark the spot for Sunday Funday. Starting March 31st, stop by Weslodge on Sundays for our delicious brunch menu (featuring classics like eggs benny, pancakes and fried chicken and waffles), and trivia games hosted by Jason D...","time":"7:00 PM – 12:00 AM","location":"Weslodge Saloon"},{"year":2019,"month":2,"day":31,"title":"Yoga and Paws for a Cause","description":"Yoga and Paws for a Cause is a charity event created by University of Guelph-Humber Media Students in support of the Toronto Humane Society. There will be food, drinks, dogs and yoga! Tickets are $20.\nThere are two sessions of Yoga available.\nSession #1: 9:30a...","time":"9:30 AM – 12:30 PM","location":"The Blue Room - Humber Lakeshore"},{"year":2019,"month":3,"day":1,"title":"163 John St. : DO OR DIE OPEN MIC @ THE CORNER","description":"HOSTS: JOEY HARLEM & JEREMY DOBSKI The Corner Comedy Club weekly Open Mic Monday Nights at 8PM - 11PM Amateurs, Pros and Room Regulars get up on stage and try out something new! DURATION: 180 MINUTES $5 TICKETS TICKETS AVAILABLE @ thecornercomedy.com SIGN UP E...","time":"8:00 PM – 11:00 PM","location":"The Corner"},{"year":2019,"month":3,"day":1,"title":"ADVOCATS BIG BAND AT THE DUKE LIVE - ALL ABOUT THE WEATHER!","description":"The Advocats Big Band is celebrating the “hottest”, or should we say “coolest”, topic of discussion these past few months: the weather! Join us on Monday, April 1st at The Duke Live from 7:30 to 10:00 pm. You will hear a whole bunch of big band tunes devoted t...","time":"7:30 PM – 10:00 PM","location":"The Duke Live"},{"year":2019,"month":3,"day":1,"title":"Assface - April 1st - the Spring has Sprung show","description":"April May June July Before you know it, it's August and the planet is all burnt up But it's only an April show. So this one is about Daffodils and sunshine An absolute celebration of spring. There.will.be.dancing .... Assface is lying through it's teeth of cou...","time":"9:00 PM – 10:00 PM","location":"Social Capital Theatre"},{"year":2019,"month":3,"day":1,"title":"Baby Time","description":"Bouncing and tickling rhymes, songs and stories for babies from birth to 18 months with their parents or caregivers. Drop-in. Stay and Play from 11:00am until 11:30am. No baby Time on April 22nd (Easter Monday)","time":"10:30 AM – 11:30 AM","location":"Jones Library"},{"year":2019,"month":3,"day":1,"title":"Campus Philharmonic Orchestra - Spring Concert at UofT!","description":"We are happy to present a very exiting program, collaborating with two fantastic UofT graduates in one of the most dramatic opera scenes and the symphony that has since its premiere enchanted audiences, becoming the crown jewel of the orchestral repertoire!The...","time":"8:00 PM – 10:00 PM","location":"MacMillan Theatre"},{"year":2019,"month":3,"day":1,"title":"CHARITY CAR DETAILING FOR KIDS BY AAAAUTOSPA.COM","description":"This is a charity event for kids, from April/01/2019 to April/15/2019 ..50% of the proceeds will be donated to Sickkids Foundation . AAA Auto Spa is a professional car detailing company based in Toronto, Since 1995 we had the pleasure to serve Torontonians for...","time":"9:00 AM – 7:00 PM","location":"177 Limestone Cres"},{"year":2019,"month":3,"day":1,"title":"Etobicoke General Hospital Volunteer Recruitment Information Night","description":"Etobicoke General Hospital's new Patient Tower will open in June 2019 to give better access to services the community needs most. Join us for a volunteer recruitment information night on April 1, 4-6PM, at Etobicoke General Hospital's West End Cafeteria. Compl...","time":"4:00 PM – 6:00 PM","location":"Etobicoke General Hospital - West End Cafeteria"},{"year":2019,"month":3,"day":1,"title":"Gershon Iskowitz: Life & Legacy","description":"Gershon Iskowitz survived the Holocaust by creating drawings as a means of psychological resilience. At age 28 he arrived in Canada, where he became an internationally renowned abstract painter and one of the country's most significant cultural philanthropists...","time":"7:00 PM – 8:30 PM","location":"93 Charles Street West"},{"year":2019,"month":3,"day":1,"title":"How To File A Simple Tax Return with Canada Revenue Agency","description":"A representative from the Canada Revenue Agency (CRA) will facilitate the Teaching Taxes course. The course will help you understand why you pay taxes and how taxes are used. It also teaches the basics of taxation, rights and responsibilities as a taxpayer and...","time":"6:30 PM – 8:00 PM","location":"Brentwood Library"},{"year":2019,"month":3,"day":1,"title":"I Ain't No Joke: Hip Hop DJs and the Evolution of  Toronto Hip Hop Culture","description":"As explored in the For the Record:An Idea of the North exhibit on until April 28 at the TD Gallery in the Toronto Reference Library, the Soundsystem and the DJ have been the backbone of the development of hip hop culture in Toronto. Through various transformat...","time":"6:00 PM – 7:30 PM","location":"Toronto Reference Library, Hinton Learning Theatre"},{"year":2019,"month":3,"day":1,"title":"\"Masters of Illusion\" Restoring Hope Event","description":"North America’s largest touring magic show, Masters of Illusion, featuring star magicians Chipper Lowell, Jarrett & Raja, Michael Turco and Naathan Phan in support of kids with serious illness.Born from the multi-award-winning television series Masters of Illu...","time":"7:30 PM – 9:30 PM","location":"Roy Thomson Hall"},{"year":2019,"month":3,"day":1,"title":"Mobile Donor Event","description":"SPRING has sprung! RENEW your COMMITMENT to GIVE LIFE. Blood donors are needed every day. Join #CanadasLifeline at blood.ca","time":"3:00 PM – 8:00 PM","location":"Jubilee United Church"},{"year":2019,"month":3,"day":1,"title":"Practical Perennials at Toronto Botanical Garden","description":"This class will feature a variety of easy-care perennials that have long periods of interest, seasonal colour and tolerances for clay, sand, salt and shade. Sean will also touch on planting, spring and fall maintenance, garden designing and winter interest.","time":"7:00 PM – 9:00 PM","location":"Toronto Botanical Garden"},{"year":2019,"month":3,"day":1,"title":"Shane Pendergast at The Tranzac","description":"Folk singer-songwriter Shane Pendergast of Prince Edward Island will play two sets of original and traditional music from 6-7:45 PM on April 1st.\nGrowing up in a musical family, Shane was surrounded by traditional Maritime, French Acadian, and Celtic music. No...","time":"6:00 PM – 7:45 PM","location":"Tranzac Club"},{"year":2019,"month":3,"day":1,"title":"Tacos: The Hidden Principle of Kabbalah","description":"Join us on this April fools day to learn everything about Kabbalah. Experience an unforgettable dinner inside Toronto's Assembly Chef's Hall.\nThe Menú\nGuácamole and chips\nTaco Platter\nChilaquiles de pollo (Family stile)\nTequila cocktail by Tequila Tromba\nKombu...","time":"6:00 PM – 10:00 PM","location":"Colibri"},{"year":2019,"month":3,"day":1,"title":"Under the Stairs","description":"UNDER THE STAIRS\nWritten by Kevin Dyer\nMusic by Reza Jacobs\nDirected by Micheline Chevrier\nMAINSTAGE | Apr. 1-16, 2019 | Recommended for Ages 8 & Up | World Premiere!\nIn this beautiful semi-musical, the cupboard under the stairs is a magical place, providing y...","time":"2:30 PM – 3:45 PM","location":"Young People's Theatre"},{"year":2019,"month":3,"day":2,"title":"Blac Rabbit in Toronto","description":"Collective Concerts Presents Blac Rabbit Tuesday Apr 2, 2019 The Drake Hotel  1150 Queen Street West  Toronto, ON Doors: 8:00 PM 19 and over $15","time":"8:00 PM","location":"The Drake Hotel"},{"year":2019,"month":3,"day":2,"title":"Perfume in Toronto","description":"DOORS OPEN 7:00 PM (EDT) SHOW TIME 8:00 PM (EDT) TICKET PRICES $46.50 balcony / $52.50 floor advance / $57.50 gold advance / $59.50 floor dos / $65 gold dos ON SALE TO GENERAL PUBLIC November 2 (Fri.), 2018　12:00 PM (EDT) AGE REGULATIONS ALL AGES","time":"7:00 PM","location":"Queen Elizabeth Theatre"},{"year":2019,"month":3,"day":2,"title":"Riverside Wine & Craft Beer Fest","description":"Riverside Wine & Craft Beer Fest is an annual week-long celebration of wine and, new this year, craft beer paired with local food and shopping. Wine and craft beer lovers can delight in tasting new and established Ontario wines and locally brewed craft beers, ...","time":"5:00 PM – 5:00 PM","location":"Multiple Venues"},{"year":2019,"month":3,"day":2,"title":"What A Bagel Free Bagel Day 2019","description":"- What A Bagel's 21st Annual Free Bagel Day (6 Free Bagels in the 6ix)\n- Six FREE bagels for anyone who visits What A Bagel on April 2nd at any time. No purchase necessary!\n- All locations are participating in this event!\n- They can get any bagel of their choi...","time":"7:00 AM – 7:00 PM","location":"Multiple Venues"},{"year":2019,"month":3,"day":2,"title":"15th Annual North American Summit on Food Safety","description":"Benchmark your transition strategy with the NEW Safe Food for Canadians Regulatory rollout.\nImplementation of the Safe Food for Canadians Regulations will begin on January 1, 2019. Now is the time to find out how your compliance plans and transition strategies...","time":"8:30 AM – 5:00 PM","location":"Old Mill Toronto"},{"year":2019,"month":3,"day":2,"title":"2019 Heart of Home Care Awards","description":"Join us April 2, 2019 for an afternoon of love, laughter, great stories and live music as we honour the incredible dedication, work and heart that family caregivers show every day when caring for friends and family members who are ill or living with a disabili...","time":"2:00 PM – 3:30 PM","location":"The Forth"},{"year":2019,"month":3,"day":2,"title":"Adult Afternoon Movie: Mamma Mia! Here We Go Again","description":"Join us for a free afternoon movie!\nTen years after the original Mamma Mia! you’re invited to return to the magical Greek island of Kalokairi in an all-new original musical based on the songs of ABBA. With the film’s original cast returning and new additions i...","time":"2:00 PM – 4:00 PM","location":"Riverdale Branch, Toronto Public Library"},{"year":2019,"month":3,"day":2,"title":"Brutus Begins - April Residency","description":"Brutus Begins brings his psych-folk, to the Painted Lady every Tuesday in April. He re-samples and processes elements of nature, acoustic instruments and synthesizers to create a sonic landscape that blurs the lines between the real and the reconstructed. Song...","time":"8:00 PM – 10:30 PM","location":"Painted Lady"},{"year":2019,"month":3,"day":2,"title":"CEPT Presents: Sustainable Finance Panel & Networking Night","description":"Date: Tuesday, April 2nd\nTime: 6:00PM - 8:45PM\nVenue: Ontario Heritage Center, 10 Adelaide St E, Toronto, ON M5C 1J3\nRegistration Fee: $15 online in advance, $20 CASH at door/day of event\nWe're bringing together environmental and financial professionals for ou...","time":"6:00 PM – 8:45 PM","location":"Ontario Heritage Centre"},{"year":2019,"month":3,"day":2,"title":"Cosmic Glow","description":"Our event is to bring people together and experience something totally unique! We are incorporating glow in the dark and galaxy together as one! Cosmic Glow is a one time experience on April 2nd, 2019, at the Super Wonder Gallery. We promise attendees good mus...","time":"7:00 PM – 10:30 PM","location":"The Super Wonder Gallery"},{"year":2019,"month":3,"day":2,"title":"David Mezmozgis - Immigrant City","description":"Meet David Bezmozgis, an award-winning writer and filmmaker, living in Toronto. Hear him discuss his new short story collection, Immigrant City, which follows immigrant characters in new spaces, and outlines all their contradictions and complexities, their ear...","time":"7:00 PM – 8:00 PM","location":"North York Central Library Auditorium"},{"year":2019,"month":3,"day":2,"title":"Embiria presents: Sugar Cookie Decorating","description":"Have you ever wanted to learn how to create beautiful cookies with icing like a professional? Learn from the super talented Joanne of @burberriejam (just take a look for the magic she creates!) on how to decorate a variety of Easter themed sugar cookies with r...","time":"6:30 PM – 8:30 PM","location":"Cambria Gallery"},{"year":2019,"month":3,"day":2,"title":"Far East Comedy Tuesdays at The Corner Comedy Club EAST","description":"Tuesday April 2nd at The Corner Comedy Club EAST, ERNIE VICENTE will be hosting FAR EAST COMEDY! A lineup of Canada’s best comedians showcasing their best material. An intimate evening dedicated to exposing Canada’s rich pool of diverse stand up comedians!\nFea...","time":"8:00 PM – 10:00 PM","location":"The Corner Comedy Club EAST (946 Queen St. East)"},{"year":2019,"month":3,"day":2,"title":"Forgotten Civilizations of the Holy Land","description":"The 3rd millennium BCE Levantine civilizations that rivaled the greatness of Egypt and Mesopotamia.\nFREE OPEN LECTURE\nHistorians have long considered the Levant, also known as Syria-Palestine, a land bridge connecting the older and more important civilizations...","time":"7:30 PM – 9:00 PM","location":"Centre Place"},{"year":2019,"month":3,"day":2,"title":"Get Leashed DOGA: Dog-inclusive Yoga","description":"Get Leashed DOGA (yoga with your dog) is back for 2019!\nThe DOGA experience is like no other bonding experience with your pup. Come join us on Tuesday April 02, 2019 for an evening of dog-inclusive wellness along side of like-minded pet owners.\nThis is a leash...","time":"6:45 PM – 8:00 PM","location":"The Costume House"},{"year":2019,"month":3,"day":2,"title":"Hilario Duran with the Hilario Duran Trio, Annalee Patipatanakoon, violin and Roman Borys, cello","description":"Cuban jazz great Hilario Durán brings together friends from the jazz and classical worlds for a programme we might call Memories of Lula Lounge, because the Gryphons, Hilario and Roberto were mainstays of our 8-year foray into classical-jazz-world music at Lul...","time":"8:00 PM – 10:00 PM","location":"Jane Mallett Theatre, St. Lawrence Centre for the Arts"},{"year":2019,"month":3,"day":2,"title":"Hot Breath Karaoke","description":"No cover!\nToronto has no shortage of karaoke nights, but Hot Breath Karaoke is truly a standout. This cult transplant from London, England and has become one of the city's funnest Tuesday night parties and it's probably the only place you might find yourself s...","time":"9:00 PM – 2:00 AM","location":"Handlebar"},{"year":2019,"month":3,"day":2,"title":"HOW WE PAINT - Steve Driscoll","description":"HOW WE PAINT Steve Driscoll\nApril 2nd, 7:00 PM\nRoom 190\n100 McCaul\nHave you ever looked at a painting and wondered ‘how did they do that?’\n“How WePaint” is a unique artist speakers series presented by the programme of Contemporary Drawing and Painting at OCAD ...","time":"7:00 PM – 8:30 PM","location":"OCAD University"},{"year":2019,"month":3,"day":2,"title":"Liveintheround with Brad Cooper","description":"Free Music by @StRoyals every Tuesday and Friday from 5:30 - 7:30 pm featuring $7 Ontario Craft Beer and food specials\nhttps://liveintheroundtrioslounge.eventbrite.ca","time":"5:30 PM – 7:30 PM","location":"Marriott Downtown CF Toronto Eaton Centre"},{"year":2019,"month":3,"day":2,"title":"Plant Nite","description":"Plant for Lonny!\nPlant Smiles on Kids with Congenital Heart Disease.\nPlant with an impact! Together, we'll create opportunities for children with congenital heart disease to forget about their illness for a week and experience the magic of summer camp, at zero...","time":"7:00 PM – 8:30 PM","location":"Marche"},{"year":2019,"month":3,"day":2,"title":"PowerPoint Basics 1","description":"Learn to open, create and edit a simple presentation using Microsoft PowerPoint 2013. Basic keyboarding and mouse skills required. Register in person at the Information Desk or by calling 416-394-5240.","time":"1:00 PM – 3:00 PM","location":"Brentwood Library"},{"year":2019,"month":3,"day":2,"title":"Ravi Shankar: Between Two Worlds // Music on Film","description":"Music on Film: Inspiring music docs from around the world come together with special musical performances and discussions selected by the Royal Conservatory of Music.\nRavi Shankar is best known for his collaboration and friendship with George Harrison in the 1...","time":"6:30 PM – 8:00 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":3,"day":2,"title":"ROMKids Junior","description":"Inspire your toddler's imagination and sense of discovery as you explore the ROM's collection of art, history, and nature through the eyes of a child.\nBring your child on an eight-week sensory adventure as you tour galleries with our early learning instructors...","time":"9:30 AM – 3:00 PM","location":"Royal Ontario Museum"},{"year":2019,"month":3,"day":2,"title":"Rowers Reading Series","description":"Join the Rowers Reading Series for an amazing April evening of poetry and prose featuring Sarah Henstra, Doyali Islam, Sheniz Janmohamed and Michael Rowe. Admission is free.","time":"6:45 PM – 8:30 PM","location":"Glad Day Bookshop (Church)"},{"year":2019,"month":3,"day":2,"title":"Seed Saving 101","description":"This workshop will cover the benefits of seed saving, relevant plant anatomy and how to gather, clean and store seeds. Examples from USC Canada’s work with seed-saving farmers around the world will place the importance of seed conservation in a global context....","time":"6:30 PM – 9:00 PM","location":"Toronto Botanical Garden"},{"year":2019,"month":3,"day":2,"title":"Spring Art Fiesta","description":"Centennial College's Public Relations students are hosting a special fundraising event for Art Starts, a non-profit organization that uses art as a vehicle to inspire social change in underserved youths in Toronto neighbourhoods.\nThe Spring Art Fiesta is a fun...","time":"6:30 PM – 8:30 PM","location":"Pinot's Palette"},{"year":2019,"month":3,"day":2,"title":"Stupid Fancy","description":"Tues, April 2nd, 8PM\n$5 at the Door\nComedy Bar\n(945 Bloor St. W)\nPresents:\nStupid Fancy ~ Comedy Salon\nHosted by Andrew Lizotte\nFeaturing:\nAshley Cooper\nBorana Makrie\nCatherine Naiker\nChristophe Davidson\nGreg Houston\n& Improv By\nAlia DeSanyis + 1\nDisplaying th...","time":"8:00 PM – 9:30 PM","location":"Comedy Bar"},{"year":2019,"month":3,"day":2,"title":"Survival of the 6ix","description":"The Toronto apocalypse is coming... will you be ready? Survival of the 6ix will be a fight to the finish. Contestants will go through a variety of skill testing challenges to get the basic necessities of water, sustenance, warmth, and safe haven, until they re...","time":"6:00 PM – 11:00 PM","location":"423 College St."},{"year":2019,"month":3,"day":2,"title":"The Fauna Foundation: A Chimpanzee Sanctuary","description":"A fundraising lecture by Dr. Mary Lee Jensvold. The Fauna Foundation, is the only chimpanzee sanctuary in Canada, caring for chimpanzees from research laboratories and zoos. Dr Jensvold has 30+ years’ experience in the care, management, and design of sanctuari...","time":"7:00 PM – 9:00 PM","location":"Gladstone Hotel"},{"year":2019,"month":3,"day":2,"title":"The Pursuit of Happiness","description":"Have you heard the saying “Happiness is an inside job”? Join us at this interactive panel discussion where our three wellness experts take you on the pursuit of happiness. Get tips on how to supercharge your happiness through healthy habits, pick up motivation...","time":"7:00 PM – 9:00 PM","location":"Centre for Social Innovation"},{"year":2019,"month":3,"day":2,"title":"Videorama 28","description":"Videorama is a video variety show that showcases original videos from Toronto's funniest and wildest creators alongside videos curated from the depths of the internet. The 28th installment of Videorama is hosted by Dan Tahmizian along with guest co-host Laura ...","time":"8:00 PM – 9:30 PM","location":"Dundas Video"},{"year":2019,"month":3,"day":2,"title":"Westbury National's IMAGINE 2019 Technology Showcase","description":"Stimulate your senses, as you experience the latest in audio-visual technology. This unique event will inspire new thoughts and ideas in how you can better connect, whether it be through best-in-class conference room solutions to impressive projection mapping ...","time":"2:00 PM – 8:00 PM","location":"Arcadian Court"},{"year":2019,"month":3,"day":2,"title":"What Is Love - Stories, Poetry, Music and Art Night","description":"We search for it everyday. We look for it in relationships with our friends and families, our coworkers. We search for it through sports, the arts, spiritual community. What if what we are searching for could be found right where we are? What if what we are lo...","time":"7:00 PM – 9:00 PM","location":"Small World Music Centre"},{"year":2019,"month":3,"day":2,"title":"Womens Panel Discussion Salty Woman: Better, Stronger, Faster","description":"Join our first Salty Woman meet-up where we bring in women of influence to share their stories and invite others to break the silence and speak up and celebrate the achievements of our fellow sisters.\nSALTY WOMAN: BETTER, STRONGER, FASTER: APRIL 2, 2019\nStrong...","time":"7:00 PM – 9:00 PM","location":"Casa Siempre"},{"year":2019,"month":3,"day":3,"title":"Ariana Grande in Toronto","description":"Ariana Grande is brining her Sweetener Tour to Toronto's Scotiabank Arena in 2019. American Express runs presale 11/1-11/3","time":"7:00 PM","location":"Scotiabank Arena"},{"year":2019,"month":3,"day":3,"title":"Human Rights Watch Film Festival","description":"Spotlight global crises, celebrate the power of the human spirit, and expose the stories that have long been hidden in the shadows during the 16th annual Human Rights Watch Film Festival, co-presented by TIFF. Watch the seven films in the festival’s bold lineu...","time":"8:00 PM – 8:00 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":3,"title":"163 John St. : DIRTY WEDNESDAY @ THE CORNER","description":"A weekly showcase of some of the dirtiest/uncensored comics in Toronto & It's taking place at the newest, hottest comedy club, THE CORNER! Two shows NOW! @ 8 & 10 PM, comedians credits include Just For Laughs, JFL 42, CBC, Comedy Network + more. Everything Dir...","time":"8:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":3,"day":3,"title":"2019 Drop in Figure Drawing","description":"Come to LucSculpture on Wednesday night, 6:30 – 9:30 pm, for drop-in figure drawing Toronto sessions! We have a different model each week. Enjoy the relaxing atmosphere! Time: January 23rd to June 19th, 6:30 pm to 9:30 pm Drop-in: $20, session passes (12 sessi...","time":"6:30 PM – 9:30 PM","location":"LucSculpture"},{"year":2019,"month":3,"day":3,"title":"946 QUEEN ST. EAST : THE RENEGADE SHOW @ THE CORNER EAST","description":"Every Wednesday at The Corner Comedy Club EAST, the young killer Kyle Lucey will be hosting THE RENEGADE SHOW! A lineup of Canada’s best comedians showcasing dark and twisted material.\nFeaturing comedians from Just For Laughs, CBC, Sirius XM, and The Comedy Ne...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":3,"day":3,"title":"Amitava Kumar in Conversation","description":"Award-winning writer and journalist Amitava Kumar was born in Ara, India and grew up in the nearby town of Patna, famous for its corruption, crushing poverty, and delicious mangoes. Kumar is the author of several books of nonfiction, poetry and his most recent...","time":"7:00 PM – 9:00 PM","location":"The Great Hall"},{"year":2019,"month":3,"day":3,"title":"Angelique","description":"Marie Joseph Angélique, an enslaved Black woman, was accused, tried and hanged for setting fire to Montréal in 1734. The late Lorena Gale’s award-winning 1998 classic play draws a line from Canada’s often ignored history of slavery to contemporary struggles wi...","time":"8:00 PM – 11:00 PM","location":"Factory Theatre"},{"year":2019,"month":3,"day":3,"title":"Angry Inuk","description":"In her award-winning documentary, director Alethea Arnaquq-Baril joins a new tech-savvy generation of Inuit as they campaign to challenge long-established perceptions of seal hunting. Armed with social media and their own sense of humor and justice, this group...","time":"6:00 PM – 8:00 PM","location":"Toronto Reference Library (3rd floor  Hinton Theatre)"},{"year":2019,"month":3,"day":3,"title":"Beer & Belly Dancing!","description":"BEER & BELLY DANCING @ The Peacock Public House\nCome along with your pals from The Jim (1174 Bloor Street / @thejim1174) for a little field trip to College Street. Wednesday April 3rd we are joining up with the talented belly-dancing pro Aleha Darabaka for a n...","time":"7:00 PM – 9:00 PM","location":"The Peacock Public House"},{"year":2019,"month":3,"day":3,"title":"Book Launch: Wayward Lives, Beautiful Experiments by Saidiya Hartman","description":"In Wayward Lives, Beautiful Experiments, Saidiya Hartman examines the revolution of black intimate life that unfolded in Philadelphia and New York at the beginning of the twentieth century. Free love, common-law and transient marriages, serial partners, cohabi...","time":"7:00 PM – 9:00 PM","location":"Innis Cafe"},{"year":2019,"month":3,"day":3,"title":"BUCK A SHUCK","description":"Join Trecce every Wednesday 4-11pm for Buck a Shuck, choose from a selection of in season oysters.","time":"4:00 PM – 11:00 PM","location":"Trecce"},{"year":2019,"month":3,"day":3,"title":"Building a Post-Carbon World Symposium: Creating Pathways to a Sustainable Society","description":"The School of the Environment, University of Toronto presents a day of learning, discussion, and networking. Explore ideas and participate in interactive sessions about the broader renewal of society in a zero-carbon world. By offering a range of perspectives ...","time":"9:00 AM – 5:00 PM","location":"Desautels Hall, Rotman School of Management"},{"year":2019,"month":3,"day":3,"title":"Business Communication UP Toronto Event","description":"Professional Development and Networking Event:\nThe key to successfully starting and growing a business is effective communications. Your great idea will not get interest from anyone if you can’t share your vision, persuasively pitch, and clearly market your pr...","time":"10:00 AM – 4:00 PM","location":"Toronto City Hall"},{"year":2019,"month":3,"day":3,"title":"Cybersecurity in the Age of Espionage","description":"Free talk Wednesday, April 3 from 7 to 9 pm features cybersecurity expert, author and former FBI operative Eric O’Neill talking spies, cybersecurity, cyber theft and counterintelligence. The York U Faculty of Science forum also features panellists York math Pr...","time":"7:00 PM – 9:00 PM","location":"Bram & Bluma Appel Salon, Toronto Reference Library"},{"year":2019,"month":3,"day":3,"title":"Digital Archaeology in Greece","description":"Celebrate the cutting-edge archaeological work being undertaken by the Canadian Institute in Greece with its interim Director Brendan Burke. With the promise of a new permanent home in Athens, the Canadian Institute in Greece is leading the field with new and ...","time":"6:00 PM – 7:00 PM","location":"Royal Ontario Museum"},{"year":2019,"month":3,"day":3,"title":"Discover Special Collections: Book arts - Handmade books","description":"The Discover Special Collections series is an opportunity to view some of the treasures of the Toronto Public Library's Special Collections.\nOn display will be a selection of handmade books from the Toronto Reference Library's Private Press and Fine Printing C...","time":"2:00 PM – 2:30 PM","location":"Toronto Reference Library"},{"year":2019,"month":3,"day":3,"title":"Diva Cup: Fundraiser for The 519","description":"Diva Cup is a drag competition featuring Toronto's top comedians in drag for the first time! It's the third annual fundraiser in support of The 519!\nHosted by the one and only Tynomi Banks\nStarring:\nAndrew Phung (Kim's Convenience)\nBrandon Ash-Mohammed (Ethnic...","time":"8:00 PM – 9:30 PM","location":"Comedy Bar"},{"year":2019,"month":3,"day":3,"title":"Evoke","description":"From April 3 to 5, 2019, Evoke, a non-profit initiative, presented by Havas Canada & Plastic Mobile, is bringing the developer community together in Toronto for one the largest developer conferences and events in Canadian history!\nEvoke will feature over 500 p...","time":"9:00 AM – 10:00 PM","location":"Arcadian Court"},{"year":2019,"month":3,"day":3,"title":"FFCON19: FEARLESS - 2019 Fintech & Financing Conference and Expo","description":"The National Crowdfunding & Fintech Association of Canada is proud to present the 2019 Fintech and Funding Conference: FEARLESS (#FFCON19), entering its 5th year Canada’s leading financial technology and financing conference on April 3 & 4 in Toronto.\nFFCON19 ...","time":"8:00 AM – 7:00 PM","location":"Bram & Bluma Appel Salon"},{"year":2019,"month":3,"day":3,"title":"Floral Design at Toronto Botanical Garden","description":"Apply modern arrangement concepts and techniques to miniature, small and large designs to create exciting and dynamic designs in all sizes! This totally new approach will broaden your design horizons.\nPrerequisites: Floral Design Certificate or five floral des...","time":"6:30 PM – 9:30 PM","location":"Toronto Botanical Garden"},{"year":2019,"month":3,"day":3,"title":"Guess? Jeans Warehouse Sale 2019","description":"GUESS? Jeans Warehouse Sale\n\r\nApril 3 - 7, 2019\n\r\nPublic Welcome\r\nEntrance 6\r\nFree Parking\r\nFree Admission\n\r\nWednesday, April 3: 6:00 AM - 09:00 PM\r\nThursday, April 4: 11:00 AM - 09:00 PM\r\nFriday, April 5: 11:00 AM - 0:00 PM\r\nSaturday, April 6; 10:00 AM - 6:00...","time":"6:00 AM – 9:00 PM","location":"International Centre"},{"year":2019,"month":3,"day":3,"title":"Health and Wellness Speed Coaching","description":"This series of 10-minute meet-and-greet sessions gives you the chance to speak with Health and Wellness coaches who will help you reach your goals and set you on the right path to making the changes you have wanted in your life.","time":"6:30 PM – 8:30 PM","location":"Old Mill Toronto"},{"year":2019,"month":3,"day":3,"title":"HealthTO Special April Edition - THIW","description":"HealthTO events bring together the Toronto healthcare community to discuss topics related to the future of innovation in health and wellness.\nThis month is a special edition of HealthTO, taking place during Toronto Health Innovation Week, and featuring 10 spea...","time":"6:00 PM – 9:00 PM","location":"MaRS Discovery District"},{"year":2019,"month":3,"day":3,"title":"Hello Korea","description":"Hello! Korea is a Korean cultural experience taking place in Downtown Toronto at Revival (783 College St) on Wednesday, April 3rd, 2019.\nGuests of all ages and backgrounds can enjoy different aspects of our events ranging from live performances such as traditi...","time":"7:00 PM – 10:00 PM","location":"Revival"},{"year":2019,"month":3,"day":3,"title":"Idomeneo","description":"Opera Atelier is honoured to present Mozart’s Idomeneo, from April 4-13, 2019 at the Ed Mirvish Theatre. The radiant Canadian superstar Measha Brueggergosman makes a triumphant return to the Toronto stage as Elettra – the role which won her a Dora Award and nu...","time":"7:30 PM – 7:30 PM","location":"Ed Mirvish Theatre"},{"year":2019,"month":3,"day":3,"title":"InkWell Workshops - Poetry with Stuart","description":"InkWell Workshops offers free, drop-in creative-writing workshops to people living with mental-health or addictions issues led by award-winning professional writers with lived experience of mental illness. Let Stuart lead you through poetry exercises guarantee...","time":"2:00 PM – 4:00 PM","location":"Routes Community Centre"},{"year":2019,"month":3,"day":3,"title":"Natural Benefits of Roses at Toronto Botanical Garden","description":"Gracing gardens throughout the ages, the rose is among the most popular flowers of all time. Most gardeners grow roses for their beauty and scent, but there is another side to the rose. Join us to learn traditional herbal uses of roses as well as their history...","time":"6:30 PM – 8:30 PM","location":"Toronto Botanical Garden"},{"year":2019,"month":3,"day":3,"title":"New Homeland // Doc Soup","description":"Every summer since 1914, Camp Pathfinder in Algonquin Park has welcomed boys and young men to spend a few weeks learning to camp, hike, and canoe. Two years ago, enraged by the tragic images from the growing global refugee crisis but inspired by Canada’s growi...","time":"6:30 PM – 8:00 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":3,"day":3,"title":"OF GLITCHES AND MACHINES","description":"OF GLITCHES AND MACHINES features contemporary works for solo piano, electronics and multi-media, performed by Stephanie Chua and Adam Sherkin. Taking inspiration from the hum of vacuum cleaners to the malfunction of video tape, this programme showcases virtuo...","time":"8:00 PM – 10:00 PM","location":"Lula Lounge"},{"year":2019,"month":3,"day":3,"title":"Old School Comedy","description":"A FREE Comedy Show featuring a new setlist every month of 3 top Toronto comedians Hosted and Produced by Ben Bankas.","time":"9:00 PM – 10:30 PM","location":"Old School"},{"year":2019,"month":3,"day":3,"title":"PoetryNOW: 11th Annual Battle of the Bards","description":"Toronto’s popular poetry competition, PoetryNOW: The Battle of the Bards, is back for its 11th year to feature readings from 20 dynamic poets and showcase a diverse range of voices, themes and poetic genres.","time":"7:30 PM – 8:30 PM","location":"Harbourfront Centre"},{"year":2019,"month":3,"day":3,"title":"SCRIBE & STITCH","description":"Queen Gallery is proud to exhibit the mixed media collection of art by Tina Rouhandeh. Scibe and Stitch exhibition offers a nuanced approach to art with the fusion of calligraphy and hand stitches. Visit this exhibition to view the collection's use of mixed me...","time":"3:30 PM – 7:30 PM","location":"Queen Gallery"},{"year":2019,"month":3,"day":3,"title":"SHINE Polewalking at Kortright Series A","description":"Pole walking is a great low-impact workout to increase the aerobic level of a walk, and the Kortright Centre for Conservation is a great environment for walking, with kilometres of trails through forests and meadows.\nOur Series A Polewalking sessions take plac...","time":"6:00 PM – 7:00 PM","location":"Kortright Centre for Conservation"},{"year":2019,"month":3,"day":3,"title":"SHINE Tai Chi in Nature at Kortright Series A","description":"Tai chi promotes harmony between mind, body and spirit. Deep stretching combined with a full range of motions strengthens the body and calms the mind. Add nature and make a deeper connection between the individual and the world around you.\nOur Tai Chi Series A...","time":"12:00 PM – 2:00 PM","location":"Kortright Centre for Conservation"},{"year":2019,"month":3,"day":3,"title":"Soul Journeys- Akashic Records -- Toronto Intuition Development Circle","description":"Wednesday, April 3, 2019\n8:15 PM to 9:45 PM\nPrice: CA$15.00 /per person\nIntroduction to the Circle followed by Organizer Introduction, light instruction, meditation, and activities to practice intuition and psychic development.","time":"8:15 PM – 9:45 PM","location":"Liberty Movement & Wellness"},{"year":2019,"month":3,"day":3,"title":"Storytelling Night: Stories That Connect Us","description":"Join us for a special collaborative event presented by Stories of Ours and Onsite Gallery: Stories That Connect Us! An evening of stories, poetry, and art shared by people of different ages, backgrounds and identities in the beautiful Onsite Gallery at 199 Ric...","time":"6:30 PM – 8:00 PM","location":"Onsite Gallery"},{"year":2019,"month":3,"day":3,"title":"Survivor: A discussion on dating white people for QTBIPOC youth","description":"So, you’re dating a white person/ people. How do you manage the racism that may happen between you while also maintaining the care in your relationship? How is this even more complicated as a queer/trans/2S person? How do you manage possible feelings of guilt,...","time":"6:00 PM – 8:30 PM","location":"Sherbourne Health Centre"},{"year":2019,"month":3,"day":3,"title":"Taoist Tai Chi Open House: Free class April 3 at Wexford Heights United Church","description":"Join us and try Taoist Tai Chi. Gentle movements promote well-being for people of all ages and in all conditions. They also serve as a moving meditation that reduces stress and provides a way to cultivate body and mind.","time":"7:00 PM – 9:00 PM","location":"Wexford Heights United Church, Wesley Room (downstairs)"},{"year":2019,"month":3,"day":3,"title":"The Art of Cannabis Cultivation: Part 2 - Grassroots","description":"Eric Butterworth said, “Don’t go through life, GROW through life”. Growth takes time, nutrients, and love; whether you're talking personal development or nurturing the growth of plants. Transplanting can be tricky and there’s one special step we’ll share that’...","time":"7:00 PM – 8:30 PM","location":"Plant Alchemy Studio"},{"year":2019,"month":3,"day":3,"title":"The Battle for Truth on Parliament Hill","description":"Robert Lewis, former Editor-In-Chief of Maclean's Magazine and Parliament Hill correspondent, discusses his book, \"Power, Prime Ministers and the Press\", and tells the story of the reporters who covered 23 Canadian prime ministers over the past 150 years — and...","time":"6:30 PM – 8:00 PM","location":"North York Central Library"},{"year":2019,"month":3,"day":3,"title":"The Liveable City?: Housing","description":"As Impressionism in the Age of Industry takes viewers on a journey through a period of immense change in 19th century Paris, we invite speakers across various disciplines to enter into conversations around urgent issues facing Toronto today: work, affordable h...","time":"7:00 PM – 8:30 PM","location":"Art Gallery of Ontario"},{"year":2019,"month":3,"day":3,"title":"The Mall w/Jordanne Brown and Ben Stager","description":"Immersive comedy show that is about a mall with sketch and stand up.","time":"9:30 PM – 11:00 PM","location":"Social Capital Theatre"},{"year":2019,"month":3,"day":3,"title":"The Most Humorous and Tragic Tale of William Shakespeare's Shakespeare","description":"Now I am Dead Production’s “The Most Humorous and Tragic Tale of William Shakespeare’s Shakespeare” invites you to share in the Meta biographical chaos, love, humanity and life of the Bard.\nThe debut production of “Now I am Dead Productions,” this play is the ...","time":"1:00 PM – 3:00 PM","location":"Redwood Theatre"},{"year":2019,"month":3,"day":3,"title":"The School of the Environment University of Toronto presents the Robert Hunter Memorial Lecture featuring Bill Mckibbon: Turning Up the Heat: Physics and Politics in a Warming World","description":"Bill McKibben, founder of the grassroots climate campaign 350.org, and the Schumann Distinguished Professor in Residence at Middlebury will discuss the causes and effects of climate change–but most importantly, he will talk about the growing movement to rein i...","time":"6:00 PM – 8:00 PM","location":"Isabel Bader Theatre"},{"year":2019,"month":3,"day":3,"title":"The Silence of Others","description":"Following survivors of Spain’s 40-year dictatorship under the fascist general Francisco Franco, The Silence of Others was filmed over 6 years to show how many victims continue to seek justice today. The film, which was directed by Emmy-winning filmmakers Almud...","time":"8:00 PM – 9:40 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":3,"title":"Toronto Klezmer Society","description":"The popular TKS jam takes over DROM TABERNA Resto once again Every Wednesday in April from 9pm-12M. Bring your instrument and play, bring your feet and dance, or just come to listen.","time":"9:00 PM – 12:00 AM","location":"Drom Taberna"},{"year":2019,"month":3,"day":3,"title":"Trivia Club","description":"No cover! Starting at 8PM, that Trivia Club goodness that you know and love from six years of game show goodness in Toronto, at your living room away from home, Farside! It all takes place within three rounds of team-based trivia excellence, at one of the cool...","time":"8:00 PM – 11:00 PM","location":"Farside"},{"year":2019,"month":3,"day":3,"title":"Wednesday Afternoon at the Movies: Gilda, 1946","description":"Join us for a series of cinematic classics, new releases, foreign films and documentaries.\nApril 3, 2019 showing - Gilda (1946) - A deceitful woman plays with the lives of her husband, his crime lord boss, and his right hand man. Stars Rita Hayworth, Glenn For...","time":"2:00 PM – 4:00 PM","location":"Beaches Branch"},{"year":2019,"month":3,"day":4,"title":"Giro d'Italia 2019","description":"Giro d'Italia, an annual Toronto food festival, brings together 20 of Toronto’s top Italian chefs in celebrating the regional cuisine of Italy! Early reservations are available Thursday, March 28 through Sunday, March 31 for American Express cardmembers. Gener...","time":"7:00 PM – 11:00 PM","location":"Multiple Venues"},{"year":2019,"month":3,"day":4,"title":"Mass Exodus 2019","description":"Mass Exodus 2019: An Inevitable Shift will take the audience on a journey that will entice the senses through a captivating event of colour, light and art. Mass Exodus has been a celebrated fashion event for over 30 years developed by and for the students of t...","time":"1:30 PM – 4:30 PM","location":"Daniels Spectrum"},{"year":2019,"month":3,"day":4,"title":"163 JOHN ST. : THURSDAY SURPRISE SHOW @ THE CORNER","description":"PAUL THOMPSON'S SURPRISE SHOW Paul Thompson hosts a surprise line up of special guests. Featuring comics making their first appearance at The Corner as well as comics visiting Toronto from New York, Los Angeles, United Kingdom, and all over the world. TWO SHOW...","time":"8:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":3,"day":4,"title":"946 QUEEN ST. EAST : THE BANANAS SHOW @ THE CORNER EAST","description":"Every Thursday at The Corner Comedy Club EAST, JOEY HARLEM & JEREMY DOBSKI will be hosting THE BANANAS SHOW! A lineup of Canada’s best comedians showcasing their fun and weird material. Featuring comedians from Just For Laughs, CBC, Sirius XM, and The Comedy N...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":3,"day":4,"title":"Acclaimed Off Broadway Dramedy DRY POWDER Comes to Toronto","description":"​Evermore Theatre Company presents the Toronto premiere of the popular and acclaimed, off-Broadway dramedy ‘Dry Powder.’ Starring 2019 Canadian Screen Award-nominee Rebecca Liddiard (Frankie Drake Mysteries, Alias Grace), Soulpepper alum Christef Desir (The Ro...","time":"8:00 PM – 9:45 PM","location":"Toronto Centre for the Arts"},{"year":2019,"month":3,"day":4,"title":"A Family Tour","description":"Introduced by Farida Deif, Canada Director at Human Rights Watch, A Family Tour tells the story of Yang Shu, a Chinese filmmaker who is forced to live in exile in Hong Kong after making a film that offended the Chinese government. This heartbreaking story high...","time":"6:30 PM – 8:15 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":4,"title":"An Authentic Syrian Gathering with Live Syrian Music!","description":"New arrivals have always shaped Canadian food identity, and the recent wave of Syrian refugees is no exception. Diala Aleid is one of them. She is the co-owner of Zezafoun, a restaurant in Midtown Toronto serving freshly made Syrian cuisine. In this rare works...","time":"6:30 PM – 9:30 PM","location":"Aphrodite Cooks"},{"year":2019,"month":3,"day":4,"title":"Andreas Souvaliotis: Misfit","description":"Hear Andreas Souvaliotis, social entrepreneur and creator of the popular Carrot Rewards health and wellness app, read from his memoir Misfit.\nAndreas Souvaliotis was raised at a time when being on the autism spectrum wasn't easily diagnosed or even discussed. ...","time":"6:30 PM – 8:00 PM","location":"Toronto Reference Library, Beeton Hall"},{"year":2019,"month":3,"day":4,"title":"Ashley's Angels Catwalk for SickKids","description":"The 6th annual Angels Catwalk for SickKids is one of Toronto’s most anticipated charitable events. Building on the success of the past five years, this premier red carpet event will once again feature some of the hottest fashions to walk across the runway, tan...","time":"6:00 PM – 1:00 AM","location":"Steam Whistle Brewing"},{"year":2019,"month":3,"day":4,"title":"A Temple Sinai Program: Standing on a Precipice - Progressive Social Issues in Danger as Israelis Face an Election with keynote address by prominent Israeli social activist Anat Hoffman","description":"A Temple Sinai Program: Standing on a Precipice — Progressive Social Issues in Danger as Israelis Face an Election with keynote address by prominent Israeli social activist Anat Hoffman\nJust five days before Israelis head to the polls, Anat Hoffman, founding m...","time":"7:00 PM – 9:00 PM","location":"Temple Sinai Congregation of Toronto"},{"year":2019,"month":3,"day":4,"title":"Babies at Lunch","description":"Grab your baby bag!\nOn the first Thursday of every month, head to Old Mill Toronto to connect with other new moms and dads and swap parenting tips over our delicious lunch buffet. Take some time to yourselves and enjoy a relaxing afternoon, ending with a decad...","time":"11:30 AM – 2:00 PM","location":"Old Mill Toronto"},{"year":2019,"month":3,"day":4,"title":"Bare Mans / Dr Love and the Love Brigade / The High Vibes / Soft Edit","description":"19+ event\n$10 at the door\nDoors at 8:30pm\nShow at 9pm\nBare Mans - Bare Mans playing bare jams\nhttps://www.facebook.com/Bare-Mans-527763270957740/\nDr Love and the Love Brigade - feel good fun and dancey\nhttps://www.facebook.com/DrLoveAndTheLoveBrigade/\nSoft Edi...","time":"8:30 PM – 1:00 AM","location":"Handlebar"},{"year":2019,"month":3,"day":4,"title":"Beaches Adult Book Club","description":"Come out and join us the first Thursday of every month to discuss popular books in a fun and friendly atmosphere. The book club is free to join and new members are always welcome. Copies of the books are available to borrow at the branch. Call 416-393-7703 for...","time":"7:00 PM – 8:00 PM","location":"Beaches Branch, Toronto Public Library"},{"year":2019,"month":3,"day":4,"title":"Bredren, Commander and Thief and Jeremy Legault","description":"Bredren hosts a night of dub, groove fusion and rock roots reggae.","time":"10:00 PM – 2:00 AM","location":"Painted Lady"},{"year":2019,"month":3,"day":4,"title":"Casino for a Cause","description":"Casino for a Cause is a social evening out where all betting and games goes towards Horizons for Youth Toronto and the Humber Event Management Fund. With live entertainment, food, casino games and a cash bar available, this is one night you won't want to miss!...","time":"7:00 PM – 10:00 PM","location":"Adelaide Hall"},{"year":2019,"month":3,"day":4,"title":"Circles: In Concert","description":"Circles: In Concert is an open mic set in Hell inspired by Dante’s Inferno. It follows the three piece alternative rock band. The music of Circles varies from classical instrumentals to Tom Waits inspired growlers and singer/songwriter intimacy. It also rocks,...","time":"7:30 PM – 10:00 PM","location":"Lula Lounge"},{"year":2019,"month":3,"day":4,"title":"CONTEMPORANEITY 3.0","description":"– CONTEMPORANEITY 3.0 is a new presenting series by Anandam Dancetheatre in partnership with Toronto Dance Theatre, featuring new works and works-in-progress by artists practicing in Asian, African, Latin American, Arab and Indigenous dance forms.","time":"8:00 PM – 10:00 PM","location":"Toronto Dance Theatre"},{"year":2019,"month":3,"day":4,"title":"Create Your Own Decorative Hanging Planter","description":"This is a special new class that combines style, horticulture, weaving and macramé! Create a custom planter by making your own tasseled version using ribbon, yarn and lace that wraps onto a wrought iron planter! Your choice of black, or white materials or even...","time":"7:00 PM – 9:00 PM","location":"Design Department"},{"year":2019,"month":3,"day":4,"title":"Curated Dining Series Featuring Chefs Dustin Gallagher & Mike Kash & Artists Robert Cameron & Carlos Delgado","description":"Curated Dining Series Featuring Chefs Dustin Gallagher & Mike Kash, and Artists Robert Cameron & Carlos Delgado\nPlease join us at Emily Harding Gallery for our next \"Curated Dining” series, presented by Palette.\nThis collaborative dinner series is hosted by Je...","time":"6:30 PM – 11:00 PM","location":"EMILY HARDING GALLERY"},{"year":2019,"month":3,"day":4,"title":"Date Night Comedy: April Fooling","description":"The critically acclaimed comedy show's April line up stars \"Cash Cab\" host Adam Growe, Carol Zoccoli (Just For Laughs, CBC) and Kevin Matviw (The Second City Toronto). Hosted by Scott Faulconbridge (NBC, CBC's \"The Debaters\") and Anne McMaster (her parents wan...","time":"8:00 PM – 9:30 PM","location":"Comedy Bar"},{"year":2019,"month":3,"day":4,"title":"DesignMeets: Care Everywhere","description":"At this community gathering, we will investigate how design processes and thinking are helping to shape the next generation of HealthCare innovations in Canada and how we interact with existing services, physical environments and tools. Forces within and outsi...","time":"6:00 PM – 8:30 PM","location":"Sidewalk Labs"},{"year":2019,"month":3,"day":4,"title":"Elizabeth Babyn:Her Industry, Reclaimed & Ava Roth: Beeswax and Birch Bark","description":"Open Wed. &Thurs.;, 12pm-5pm, Fri. & Sat., 12pm-6pm, Sun., 1pm-4pm or by appointment.\nJoin Babyn and explore a variety of up-cycled textile processes: April 7th from 1-4 PM","time":"2:00 PM – 4:00 PM","location":"Loop Gallery"},{"year":2019,"month":3,"day":4,"title":"Fatoumata Diawara","description":"Hailed as one of the most vital standard-bearers of modern African music, Fatoumata Diawara takes her artistry to fresh and thrilling heights on her new album Fenfo, recently nominated for a 2019 Grammy Award - Best World Music Album. In addition, her collabor...","time":"8:00 PM – 10:00 PM","location":"Toronto Centre for the Arts"},{"year":2019,"month":3,"day":4,"title":"Free Japanese Film Screening! Hunt For Matsutake","description":"Directed by Alejandro Yoshizawa\nThis spring, we will feature a series of films, CHIKYU FILMS, which will share the stories and people who examine the close relationship to our environment, our earth, or Chikyu 地球 in Japanese.\nThis documentary looks at Japanese...","time":"6:30 PM – 7:40 PM","location":"The Japan Foundation"},{"year":2019,"month":3,"day":4,"title":"Guided Laughter & Meditation","description":"Experience how Laughter Yoga (aka Guided Laughter) can bring physical, mental, and social well-being in a short period of time. No physical yoga involved, only conscious play and experiential exercises such as laughter, meditation, and deep breathing.\nPresente...","time":"7:00 PM – 8:00 PM","location":"Fort York Library"},{"year":2019,"month":3,"day":4,"title":"Harm & Healing III","description":"Ryerson University’s Psychology Students' Association invites you to Harm & Healing III:\nA moderated panel discussion exploring the development and implementation of public, private, and academic policies that support the reintegration of individuals who have ...","time":"4:00 PM – 7:00 PM","location":"The Sandbox by DMZ"},{"year":2019,"month":3,"day":4,"title":"Homage by Briony Douglas","description":"An art show that cultivates mementos from the past to create works of art in the present. Every piece has been researched and sourced with elements coming from all over the world to make one work of art.\nBriony Douglas, a Toronto based artist, has been catchin...","time":"12:00 PM – 8:00 PM","location":"49 Ossington Ave"},{"year":2019,"month":3,"day":4,"title":"I Love Paint 3","description":"Opening Reception: Thursday April 4th, 7-9pm\nExhibition Dates: April 4-28, 2019\nLocation: 1151 Queen St East\nPatel Gallery is pleased to present an international group exhibition curated by Kim Dorland with works by:\nAaron Zulpo (New York City, USA)\nAnna Fidle...","time":"7:00 PM – 9:00 PM","location":"Patel Gallery"},{"year":2019,"month":3,"day":4,"title":"It's Alive!!! Comedy Show","description":"An evening of Stand Up Comedy from comics who have performed on Just For Laughs, JFL42, Yuk Yuk's, and the Halifax Comedy Festival, with a special appearance by a two-time Canadian Comedy Award Winner!\nFeaturing:\nSandra Battaglini, Andrew Barr, Patrick Haye, N...","time":"9:00 PM – 11:00 PM","location":"120 Diner"},{"year":2019,"month":3,"day":4,"title":"JNT Comedy - Canada's #1 Cannabis Comedy Show","description":"Comedian Andrew Packer hand picks a professional line up of touring comedians to deliver an incredible comedy experience.\nLine up:\nRebecca Reeds (Winnipeg Comedy Festival, Sirius XM Top Comic)\nJay Freeborn (420 Comedy Festival, Bite TV)\nBen Bankas (The Corner ...","time":"8:00 PM – 10:00 PM","location":"The Underground Cafe"},{"year":2019,"month":3,"day":4,"title":"Kids & Company Liberty Village GRAND OPENING!","description":"Join us for the Grand Opening of our Liberty Village location! Meet our CEO Victoria Sopik for the official Grand Opening and Ribbon Cutting Ceremony taking place on Thursday April 4, 2019. Light snacks and refreshments from the Kidco Kitchen with be served.\nT...","time":"10:00 AM – 12:00 PM","location":"Kids & Company Liberty Village"},{"year":2019,"month":3,"day":4,"title":"Kopernikus","description":"Montréalais composer Claude Vivier (1948–1983) lived a hard and fast life. Before he was found murdered in his hotel room in Paris at the age of 35, he had spent a career rejecting many traditional ideas of life, music and opera, which culminated in writing hi...","time":"8:00 PM – 9:30 PM","location":"Theatre Passe Muraille"},{"year":2019,"month":3,"day":4,"title":"Mahmood Schricker","description":"Mahmood Schricker tours \"El Muerte,\" his new album inspired by the Persian Dastgah System, laced with beats and electronics.\nWhere the delicate timbre of Persian setar adds to Sufism's thoughtful sadness, the album precipitates life on the verge of death. \"El ...","time":"8:00 PM – 10:00 PM","location":"Small World Music Centre"},{"year":2019,"month":3,"day":4,"title":"Megan Bonnell","description":"Tickets available at https://burdockto.com/shows/?show=1864\n19+ / Doors: 9:00pm, Show: 9:30pm\nTickets: $20.00 (incl tax)\n\" “Your Voice” is a breakaway and rising hit off Bonnell’s recent album \" - Atwood Magazine\n“a powerful collection of reflective, genre-def...","time":"9:00 PM – 11:00 PM","location":"Burdock"},{"year":2019,"month":3,"day":4,"title":"Mind Over Matter: Arts for Alzeheimer's","description":"Join us for a night of art, music, foods, raffle, silent auction, and cocktails to raise money for The Baycrest Foundation and George Brown College Scholarship Fund.\nTicket available at https://www.eventbrite.ca/e/mind-over-matter-art-for-alzheimers-tickets-57...","time":"7:00 PM – 11:00 PM","location":"The Delisle Space"},{"year":2019,"month":3,"day":4,"title":"Naughty & Nice Show","description":"A night of stand up featuring the Naughtiest and Nicest comedians in Toronto who you've seen on Just For Laughs, JFL42, and Kevin Hart's LOL Network! Hosted by Ryan Dillon & Kyle Lucey, featuring Dom Paré, Laurie Elliot, Ben Bankas, Craig Fay, Tamara Shevon, a...","time":"8:00 PM – 9:30 PM","location":"Comedy Bar"},{"year":2019,"month":3,"day":4,"title":"Opera Pub - Whose Opera Is It Anyway?","description":"There's a bar in Toronto where you can hear live opera—for free—with a pint in hand: AtG Opera Pub presents Whose Opera Is It Anyway?\nInspired by the famous TV show, \"Whose Opera Is It Anyway?\" is a hilarious marriage of opera and comedy using short-form, game...","time":"9:00 PM – 11:00 PM","location":"Amsterdam Bicycle Club"},{"year":2019,"month":3,"day":4,"title":"Our Righteous Mic","description":"A Night Of Stand-Up Comedy, Thursday April 4th, 8pm, pwyc, at Cranberries Restaurant - Room 601, Featuring:\nMitchell Alvis\nDarren Bourke\nTamlynn Bryson\nIan Fergus\nSam Sferrazza\nHosted by Johnathan Ramcharan","time":"8:00 PM – 9:30 PM","location":"Cranberries"},{"year":2019,"month":3,"day":4,"title":"PlusTime Comedy Show","description":"PlusTime Comedy Presents: Comedy Night at The Free Times Cafe.\nMonthly line-ups that boast Toronto's hottest professional stand-up acts, featuring comedians seen on CBC Television, Just For Laughs, SiriusXM, Edinburgh Fringe and more.\nDoors open 8:45 PM, Show ...","time":"9:00 PM – 10:30 PM","location":"Free Times Cafe"},{"year":2019,"month":3,"day":4,"title":"PSYCHEDELIC SOUL SHACK with D.B. BUX","description":"The best Soul, Funk & Psych record collection being played anywhere!","time":"10:00 PM – 2:00 AM","location":"Swan Dive"},{"year":2019,"month":3,"day":4,"title":"SlavinRaphael Sample Sale","description":"SlavinRaphael has been at the forefront of fashion style and sales for nearly 40 years, and continues to build its reputation as one of the most exciting and premier fashion wholesale companies in North America today. Step into our carefully-curated 15,000 squ...","time":"12:00 PM – 7:00 PM","location":"SlavinRaphael"},{"year":2019,"month":3,"day":4,"title":"Southern Ontario Butterflies at Toronto Botanical Garden","description":"Nature photographer and experienced butterfly gardener, Jay Cossey, will demonstrate how to attract and support butterflies in our gardens, and share his extensive collection of images detailing butterflies at all stages–egg, larva, chrysalis and adult. Specia...","time":"7:30 PM – 9:00 PM","location":"Toronto Botanical Garden"},{"year":2019,"month":3,"day":4,"title":"Spotlight on UNICEF Canada's President & CEO, David Morley, C.M., MEd'08","description":"Children are Canada’s future – but are we failing the next generation? Join UBC alumni and friends in Toronto for this special opportunity to hear from the President & CEO of UNICEF Canada, David Morley, C.M., MEd’08, about how Canada’s falling behind when it ...","time":"6:30 PM – 9:00 PM","location":"Glenn Gould Studios"},{"year":2019,"month":3,"day":4,"title":"Students Say No - Richmond Hill High School","description":"Students at Richmond Hill High School will be walking out of classes to show our discontent towards the new education cuts made by fordnation.","time":"1:15 PM – 3:30 PM","location":"Richmond Hill High School"},{"year":2019,"month":3,"day":4,"title":"The Chemical Valley Project","description":"Located in Sarnia, Ontario, the Aamjiwnaang First Nations reserve and its 900 residents are smothered by one of Canada’s largest petrochemical corridors: the Chemical Valley. Siblings Vanessa Gray and Lindsay Beze Gray have dedicated their lives to fighting th...","time":"7:30 PM – 9:00 PM","location":"16 Ryerson Ave"},{"year":2019,"month":3,"day":4,"title":"The Future is STeAM","description":"Central Toronto Academy (aka 6IX Academy) students have once again partnered up with Canadian business and fashion leaders for another innovative collaboration. Award winning NOGU Designs and Roger Gingerich of INTO will be unveiling 3D printed jewelry collect...","time":"6:00 PM – 9:00 PM","location":"Twist Gallery"},{"year":2019,"month":3,"day":4,"title":"The Shimmering Verge by Molly Peacock","description":"A Solo Show in Poems Featuring Readings by Toronto Poets In Celebration of National Poetry Month\nAbout:\nThe Shimmering Verge juxtaposes verse and prose in an exploration of the fine line between metaphor and reality in life and in art. In Molly's own words: \"L...","time":"8:00 PM – 9:30 PM","location":"Studio 21"},{"year":2019,"month":3,"day":4,"title":"Toronto Symphony Orchestra - EVENING EPIC","description":"On April 4, 2019, the Toronto Symphony Orchestra (TSO) introduces EVENING EPIC—a unique and unexpected evening of fantastic food and musical firsts. EVENING EPIC is a night unlike any other of the year—a party interwoven with live musical performances that del...","time":"6:00 PM – 12:00 AM","location":"The Carlu"},{"year":2019,"month":3,"day":4,"title":"Treating The Root: Five Simple Steps to Heal Your Flagging Practice","description":"When it comes to building a healthy and sustainable TCM or acupuncture practice, most practitioners focus on outside marketing to get new patients in the doors. But they often lack the skills to retain them long enough to provide effective treatment.\nAnd when ...","time":"6:30 PM – 8:00 PM","location":"Ontario College of Traditional Chinese Medicine, Toronto Campus"},{"year":2019,"month":3,"day":4,"title":"Vanguardia Dance Festival","description":"Vanguardia Dance Festival is thrilled to present a week of extended activities in its 5th bi-annual edition showcasing a curated selection of interdisciplinary dance performances, workshops, panel discussions, and video dance screenings. With the support of Na...","time":"5:00 PM – 10:00 PM","location":"Multiple Venues"},{"year":2019,"month":3,"day":4,"title":"Women's White Collar Boxing Fundraising Event for Parkinson's","description":"Step Through The Ropes with us on April 4th as On The Button Club Promotions is hosting its 2nd Annual Women's White Collar Boxing Event, fundraising for the Parkinson's organization Rock Steady Boxing at Undisputed.\nIn This Corner, Hope!\nFor 12 weeks, 12 wome...","time":"7:30 PM – 11:00 PM","location":"Crystal Fountain Event Venue"},{"year":2019,"month":3,"day":5,"title":"Earl Sweatshirt in Toronto","description":"RAPSEASON presents Earl Sweatshirt presents: With special guests Bbymutha and Liv.e (1st of 3). Some Rap Songs Tour Friday April 5, 2019 The Phoenix Concert Theatre 19+ Doors: 8pm Tickets $30.00 @ Ticketweb #RAPSEASON Pre-sale starts Thursday, Januar...","time":"8:00 PM – 11:00 PM","location":"Phoenix Concert Theatre"},{"year":2019,"month":3,"day":5,"title":"163 John St. : FRIDAY SHOWCASE @ THE CORNER","description":"It's taking place at the newest, hottest comedy club, THE CORNER! FRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna be ...","time":"7:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":3,"day":5,"title":"946 QUEEN ST. EAST : FRIDAY SHOWCASE @ THE CORNER EAST","description":"It's taking place at the newest, hottest comedy club, THE CORNER! FRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna be ...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":3,"day":5,"title":"AfterWerk - Traffic Light Party","description":"AfterWerk is hosting a TRAFFIC LIGHT PARTY! We're back at BUDDIES on a FRIDAY Apr 5th. Category is: Traffic Light Party! What’s a traffic light party? It’s a chance to meet your spring fling. Where Green, Yellow or Red to signal if your: SINGLE: Green OPEN: Ye...","time":"10:30 PM – 2:30 AM","location":"Buddies in Bad Times"},{"year":2019,"month":3,"day":5,"title":"Ali Hassan Live Comedy","description":"Join us Friday April 5th at 9:30pm, for a stellar comedy show with Ali Hassan!\nAli Hassan is an actor and chef who has performed on stages across Canada, in the U.S. and twice in the Middle East at the Amman Stand-Up Comedy Festival. Ali has graced the Big Scr...","time":"9:30 PM – 11:00 PM","location":"The Underground Cafe"},{"year":2019,"month":3,"day":5,"title":"Axes & Ales: The Ultimate Canadian Experience","description":"If you’re looking for the ultimate Canadian experience, look no further. Axes & Ales is the place to eat, drink, play and support all things Canadian! Bring your best plaid and get ready for an evening of...\nAxe & Knife Throwing featured by STRYKE\nPong Toss, G...","time":"6:30 PM – 10:00 PM","location":"The Extension Room"},{"year":2019,"month":3,"day":5,"title":"Baby & Me","description":"Meet other parents and caregivers, and enjoy adult learning and conversation in a baby-friendly atmosphere! With a Museum Teacher as your guide, explore a different gallery each week and discover extraordinary objects while your little one marvels at the new s...","time":"9:30 AM – 11:30 AM","location":"Royal Ontario Museum"},{"year":2019,"month":3,"day":5,"title":"BACH BRAHMS VASKS - Sinfonia Toronto concert","description":"BACH, BRAHMS, VASKS\nFriday April 5, 2019 8 pm Glenn Gould Studio\nMARINA THIBEAULT Violist / MARIO CARBOTTA Flutist\nSINFONIA TORONTO / NURHAN ARMAN Conductor\nTime travel - an enchanting journey through three centuries of melody\nProgram\nPETERIS VASKS Viola Conce...","time":"8:00 PM – 10:00 PM","location":"Glenn Gould Studio"},{"year":2019,"month":3,"day":5,"title":"Beam Me Up Disco: Now at The Drake!","description":"Beam Me Up’s Disco! Every. Single. Friday. Night. Different spot, same delicious disco flavour!\nGotta keep movin’ to the beat! We’re thrilled to be zipping up our boots and putting down roots at one of Toronto’s finest spots - the cultural hub that is the Drak...","time":"10:00 PM – 2:30 AM","location":"Drake Hotel"},{"year":2019,"month":3,"day":5,"title":"Brit Floyd","description":"Brit Floyd, the world’s greatest Pink Floyd tribute show, returns to the stage in 2019 with its most ambitious and best production yet, a very special 40th Anniversary retrospective of Pink Floyd’s iconic rock opera, The Wall.\nReleased in November 1979, a semi...","time":"8:00 PM – 10:00 PM","location":"Sony Centre for the Performing Arts"},{"year":2019,"month":3,"day":5,"title":"Caught in the Net by Ray Cooney - Scarborough Players' Production","description":"Teenagers, Gavin and Vicki, happen to meet surfing the internet. They are attracted to each other and yet are amazed by all the coincidences — each having a father with the same name, same age, and same occupation. Why? Find out in this uproarious farce as the...","time":"8:00 PM – 10:00 PM","location":"Scarborough Village Theatre"},{"year":2019,"month":3,"day":5,"title":"Choir! Choir! Choir! & Canadian Cancer Society: A community celebration of song and support","description":"The Canadian Cancer Society (CCS) knows that cancer changes people. But they believe that a cancer diagnosis doesn’t have to define who they are. Through their work, they aim to help people live longer and enhance the quality of life for all of those affected ...","time":"6:30 PM – 8:00 PM","location":"Nathan Phillips Square"},{"year":2019,"month":3,"day":5,"title":"CRAM Toronto: Extraordinary Ideas Unleashed","description":"CRAM is a brand new free learning festival coming to Toronto!\nOn Friday, April 5, 2019, Toronto’s four universities - OCAD University, Ryerson University, University of Toronto and York University - open their doors to give curious minds from across the city a...","time":"5:00 PM – 11:00 PM","location":"Multiple Venues"},{"year":2019,"month":3,"day":5,"title":"Dinner & Aboriginal Dot Art","description":"If you're between the ages of 21 and 35, join us for an interactive, fun evening of looking at community connections through Aboriginal dot-painting. We'll build connections and understand the place of faith and creativity in community. It's an opportunity to ...","time":"7:00 PM – 9:00 PM","location":"Beach United Church"},{"year":2019,"month":3,"day":5,"title":"Ekstasis: Lost Ancient Wisdom, Mystery Rites and Flow States","description":"There is a growing cloud of anxiety and disconnection from the natural order of things that hangs over the shiny consumerist veneer of our modern secular age.\nAnd it begs the question… why are we experiencing such an epidemic of anxiety in one of the richest a...","time":"7:30 PM – 9:30 PM","location":"Alternity"},{"year":2019,"month":3,"day":5,"title":"ENSO Showcase 2019","description":"ENSO Showcase 2019 is a student-organized event from Ryerson University that showcases the work and performances of young Asian creatives in the local community. ENSO Showcase is built on providing an inclusive platform where Asian-identifying individuals can ...","time":"7:00 PM – 11:00 PM","location":"Bonafide"},{"year":2019,"month":3,"day":5,"title":"Garage Baby and Giraffe","description":"Garage Baby continues it's monthly puck-rock residency with special musical mayhem guests; Giraffe.","time":"7:30 PM – 9:30 PM","location":"Painted Lady"},{"year":2019,"month":3,"day":5,"title":"Garters of the Galaxy Vol.2: A Marvel Burlesque Parody","description":"Peepshow ASSvengers Assemble!\nJoin the Marvel Burlesque Universe as your favourite characters are reimagined by PeepshowTO in a truly epic burlesque parody that is sure to leave you hulking and levitating out of your seat.\nAssemble your team and watch villains...","time":"8:00 PM – 11:00 PM","location":"The Great Hall"},{"year":2019,"month":3,"day":5,"title":"Hot Brown Honey","description":"For the Game Changers, Myth Slayers, Poets, Movers, Music Makers, Ground Breakers, Truth Sayers, Shake em up Women, Queens, Queers and Risk Takers!\nHot Brown Honey turns up the heat, delivering lashings of sass and a hot pinch of empowerment in the smash-hit t...","time":"8:00 PM – 10:00 PM","location":"St. Lawrence Centre for the Arts"},{"year":2019,"month":3,"day":5,"title":"Hot Damn its a Queer Slam","description":"THIS IS IT! The Championships! All year we've been traveling our show to towns, cities and hamlets to find the best in 2SLGBPTIPIA+ voices. We cannot wait to see who wins the grand prize of a trip to Capturing Fire Slam, the International Queer Summit & Slam i...","time":"7:00 PM – 10:00 PM","location":"Buddies In Bad Times Theatre"},{"year":2019,"month":3,"day":5,"title":"How To Beat Up Any Man","description":"Comedian and writer Carol Zoccoli (Winnipeg Comedy Festival, The Debaters, Comedy Central Brazil) tell us how it was like growing up as a woman in Brazil - and her story is told through the men she’s beaten up. How To Beat Up Any Man is a funny and raw tale of...","time":"10:00 PM – 11:15 PM","location":"JCB Theatre - Second City"},{"year":2019,"month":3,"day":5,"title":"Kickass Study Strategies for Math & Science! FOR KIDS WITH LDs","description":"Doing well on a test isn’t just about knowing course content - it’s about developing kickass study skills! This study strategy workshop will provide an overview of all the super important aspects of studying - from getting organized, to taking notes, to rememb...","time":"4:30 PM – 6:00 PM","location":"The Math Guru"},{"year":2019,"month":3,"day":5,"title":"Kitchen Stuff Plus Warehouse Sale","description":"Kitchen Stuff Plus is hosting a  warehouse sale this April 2019 in Toronto.\nScore up to 90% off furniture and cookware from Cuisinart, Henckel, Kitchen Aid, Umbra, Hamilton, Starfrit, Harman, Oster and more.","time":"2:00 PM – 10:00 PM","location":"Kitchen Stuff Plus Warehouse"},{"year":2019,"month":3,"day":5,"title":"MLSE Foundation Game Changers Championship Gala","description":"MLSE Foundation Game Changers proudly presents Championship Gala 2019 in support of MLSE Foundation and MLSE LaunchPad.\nChampionship Gala (formerly known as Toronto Plays) will be hosted in the beautiful Berkeley Church on Friday, April 5, 2019. Come celebrate...","time":"8:00 PM – 1:00 AM","location":"Berkeley Church"},{"year":2019,"month":3,"day":5,"title":"Neo Waistland","description":"Neo Waistland is a contemporary pop-up shop bringing forth revolutionary thoughts and creations. Join us on a three day exclusive experience of local Fashion, Music, Art & Food.\nThe masterful DJ nomad nala will be spinning opening night April the 5th from 8pm ...","time":"8:00 PM – 6:00 PM","location":"227 Sterling Rd"},{"year":2019,"month":3,"day":5,"title":"New Exhibition by Katie Bond Pretti","description":"April 5 - May 18\nOpening Reception: Friday, April 5 6-9pm\nExploring synaesthetic translations of the otherworldly and unknown, her works draw inspiration from personal vision quests and sensations of being under surveillance––varied experiences that, collectiv...","time":"6:00 PM – 9:00 PM","location":"Barbara Edwards Contemporary"},{"year":2019,"month":3,"day":5,"title":"No Box For Me. An Intersex Story","description":"M is 27 years old. Deborah is 25. Both are living in bodies that Western medicine — and often society — deems too taboo to discuss publicly. This beautifully crafted, poetic documentary from Swiss director Floriane Devigne joins these and other brave young peo...","time":"6:30 PM – 7:30 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":5,"title":"Opening Party Reception: The Art of Abstraction","description":"Opening Night Party: Fri Apr 5 | 7 - 9 pm (wine & cheese)\nOpening Reception: Sat Apr 6 | 1 - 3pm (family friendly)\nVibrant colours, bold brushstrokes and different perspectives abound in this exhibit. Abstract art inspires our imaginations and sparks our curio...","time":"7:00 PM – 9:00 PM","location":"Winged Canvas Art Hub"},{"year":2019,"month":3,"day":5,"title":"PAINT PUFF PASS","description":"Come enjoy the coolest thing since sliced bread.\nIts like Paint Night but like way better.\nExplore the creative side you didn't know you had.\nExpect to indulging in delicious treats, refreshing beverages all while laughing and creating with like minded locals ...","time":"8:00 PM – 10:00 PM","location":"Nameless"},{"year":2019,"month":3,"day":5,"title":"P A R T Y T O W N: April Shower Beer, Bro!","description":">>Grab some buds and come celebrate that spring cleaning with PARTYTOWN at the best P A R T Y in town.<<\nThis Canadian comedy award winning show features comedians from Second City, Bad Dog Theatre, and the CBC. Enjoy a high-octane night of comedy made up on t...","time":"11:00 PM – 12:00 AM","location":"Comedy Bar"},{"year":2019,"month":3,"day":5,"title":"Paul Cafcae & The 20 Flight Rockers","description":"20 Flight Rockers is Ontario’s most ambitious rock ’n’ roll party band.\nWe play a diverse repertoire of highly recognizable dance songs from 1950’s to 2010’s as well as original music delivered in an original rockabilly-themed live show, with the flavour of bl...","time":"8:00 PM – 11:59 PM","location":"The Cavern Bar"},{"year":2019,"month":3,"day":5,"title":"Phile Magazine x Untitled: HEAVY LOAD w/ Boris - Berghain - Ostgut","description":"Phile Magazine & Untitled present HEAVY LOAD feat. The Canadian Debut of Boris\nDJs:\nxx Boris [Berghain / Panorama Bar | Ostgut Ton] xx\nKnown for spinning marathons and being one of Berghain's main residents... Boris [Ostgut Ton] really is the master of all gen...","time":"11:00 PM – 6:00 AM","location":"500 Keele"},{"year":2019,"month":3,"day":5,"title":"Possibilities of Dialogue","description":"April 05 - April 07, 2019 8pm - Apr 5 and 6, 2pm - Apr 7\nFee: Standard ticket $28.25, Senior/Student/Arts Worker ticket $18.75\nCo-created and performed by TOES FOR DANCE Co-Director David Norsworthy and NYC-based dance artist Marielis Garcia, Possibilities of ...","time":"8:00 PM – 2:00 PM","location":"Toronto Centre for the Arts"},{"year":2019,"month":3,"day":5,"title":"Practically Petty, Canada's Top Tribute to Tom Petty Live at Drums N Flats","description":"Practically Petty always deliver a fantastic night of Tom Petty Music that makes you HAPPY! Canada's Top Tom Petty Band have been paying homage to one of rock's most beloved singer, song writers, the late great Tom Petty.\nThis show will sell out, so don't wait...","time":"9:00 PM – 12:30 AM","location":"Drums N Flats"},{"year":2019,"month":3,"day":5,"title":"QUEER POP: LGBTQ Music & Arts Festival","description":"\"QUEER POP: LGBTQ+ Music & Arts Festival\" comes back for a second year and she's BIGGER & QUEERER than ever!\nAMAZING performances from this year's lineup as well as SEXY dancing from our HOT male/female GoGo Dancers with some of today's top DJ's playing the be...","time":"10:00 PM – 3:00 AM","location":"Club 120"},{"year":2019,"month":3,"day":5,"title":"Roby Lakatos","description":"Virtuoso fiddler Roby Lakatos is a scorching player and a musician of extraordinary stylistic versatility. Born into the legendary family of Roma violinists, Lakatos is equally comfortable performing classical, jazz, and Hungarian folk music.","time":"8:00 PM – 10:00 PM","location":"Koerner Hall"},{"year":2019,"month":3,"day":5,"title":"Shiraz: A Romance of India","description":"Toronto Silent Film Festival opening night. Canadian premiere of the BFI restoration. World Premiere of a new score, composed and performed by Ensemble Polaris\nOne of the Crown Jewels of early Indian filmmaking up on the big screen.\nBased on the immortal 17th ...","time":"7:00 PM – 9:00 PM","location":"Revue Cinema"},{"year":2019,"month":3,"day":5,"title":"SOUL FLOWER with DJ General Eclectic","description":"Expertly selected Classic Psych, Soul & Rock tunes to make your Friday Night!","time":"10:00 PM – 2:00 AM","location":"Swan Dive"},{"year":2019,"month":3,"day":5,"title":"Spring Mystic Pop-Up Shop","description":"Celebrate the New Moon with us! Come to the first annual Spring Mystic Pop Up Shop at the Inner Arts Collective!\nGet a reading from a gifted local diviner, purchase some magical jewelry for yourself or a loved one, discover how to increase your energy and well...","time":"6:00 PM – 9:00 PM","location":"Inner Arts Collective"},{"year":2019,"month":3,"day":5,"title":"Taoist Tai Chi Open House: Free class April 5 at Knox Presbyterian Church","description":"Join us and try Taoist Tai Chi. Gentle movements promote well-being for people of all ages and in all conditions. They also serve as a moving meditation that reduces stress and provides a way to cultivate body and mind.","time":"9:30 AM – 11:30 AM","location":"Knox Presbyterian Church (please ring at back door on north side)"},{"year":2019,"month":3,"day":5,"title":"The Invisibles","description":"In 1943, Joseph Goebbels declared Berlin “free of Jews.” Though he did come markedly close to his goal, some 1,700 endured in secret. This gripping docu-drama traces the astonishingly-true stories of four young survivors who learned that sometimes the best pla...","time":"6:30 PM – 8:30 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":3,"day":5,"title":"The Liveable City?: Work","description":"As Impressionism in the Age of Industry takes viewers on a journey through a period of immense change in 19th century Paris, we invite speakers across various disciplines to enter into conversations around urgent issues facing Toronto today: work, affordable h...","time":"7:00 PM – 8:30 PM","location":"Art Gallery of Ontario"},{"year":2019,"month":3,"day":5,"title":"Violin Virtuoso Zoltan Maga","description":"Dazzling music is brought to life through the flair and passion of Hungary’s preeminent violin virtuoso, Zoltán Mága and his fiery orchestra: the Budapest Gypsy Virtuosi. After touring five continents and nearly 100 countries, Zoltán is returning to North Amer...","time":"8:00 PM – 10:30 PM","location":"Roy Thomson Hall"},{"year":2019,"month":3,"day":5,"title":"Where Does This Disco with DJ Digits","description":"No cover! Fun, silly, and strange pop transmissions received from an alternate-dimension Earth. Mutant disco, Italo, electronic indie pop, psych-pop, and unusual cover versions selected by DJ Digits.\nfeaturing the sounds of:\nSt Etienne\nMylene Farmer\nElle Barba...","time":"9:30 PM – 2:00 AM","location":"Farside"},{"year":2019,"month":3,"day":5,"title":"WONDERWALL","description":"An Art Exhibit by an interracial couple exploring growth, publicly as individuals.","time":"7:00 PM – 10:30 PM","location":"Capital Espresso"},{"year":2019,"month":3,"day":6,"title":"Olivia O'Brien","description":"Doors: 7pm Show: 8pm This is a LEGAL AGE 19+ event. Sale Dates and Times: Public Onsale : Fri, 21 Dec 2018 at 10:00 AM Live Nation Presale / LEGAL AGE 19+ : Thu, 20 Dec 2018 at 10:00 AM Password: CHILL Spotify Presale / LEGAL AGE 19+ : Wed, 19 Dec 2018...","time":"7:00 PM","location":"Velvet Underground"},{"year":2019,"month":3,"day":6,"title":"Slow Art Day 2019","description":"It’s not what you look at that matters, it’s what you see. Henry David Thoreau Slow Art Day is a global event with a simple mission: help more people discover for themselves the joy of looking at and loving art. Why slow? When people look slowly at a piece of...","time":"12:00 PM – 4:00 PM","location":"Multiple Venues"},{"year":2019,"month":3,"day":6,"title":"The Geeky Craftorium","description":"See-Scape and Toronto Cemetery Tours bring you: The Geeky Craftorium Handmade items to satisfy all your nerdy needs!! On Saturday April 6th, both floors of See-Scape will be packed will local vendors selling you their crafty creations, all with a nerdy flair! ...","time":"12:00 PM – 6:00 PM","location":"See Scape"},{"year":2019,"month":3,"day":6,"title":"163 John St. : SATURDAY SHOWCASE @ THE CORNER","description":"It's taking place at the newest, hottest comedy club, THE CORNER! SATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna b...","time":"7:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":3,"day":6,"title":"2019- From drawing to Painting: Workshop 1 -Realistic Drawing","description":"In this series of 3 workshops, you will learn the basics of drawing, composition to create unique style and painting to finish the artworks.\nThe first workshop will focus on elements of drawing: Aspect of the Line and edges, using positive and negative shapes....","time":"1:00 PM – 5:00 PM","location":"LucSculpture Art School"},{"year":2019,"month":3,"day":6,"title":"2019-Jewellery Making Workshop @ LucSculpture","description":"Create your own wire art and jewellery in one weekend workshop! All materials are included, but if you have any of your favorite beads, you can bring them in! In this class, you will learn the skills to work with the wires, have an understanding of the differe...","time":"10:00 AM – 12:00 PM","location":"LucSculpture Art School"},{"year":2019,"month":3,"day":6,"title":"5th Annual Rockin' For The Cure with I MOTHER EARTH","description":"BIG PARTY COMING!!!!!\nSaturday, April 6th/2019, we present our 5th Annual Rockin For The Cure Anniversary show with I Mother Earth live at the Phoenix Concert Theatre!\nTickets on sale now @ https://www.ticketscene.ca/events/22510","time":"7:00 PM – 2:00 AM","location":"Phoenix Concert Theatre"},{"year":2019,"month":3,"day":6,"title":"946 QUEEN ST. EAST : SATURDAY SHOWCASE @ THE CORNER EAST","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nSATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna b...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":3,"day":6,"title":"After the Snow:  Etobicoke Centennial Choir's Spring concert","description":"Etobicoke Centennial Choir (ECC) welcomes the rebirth of spring with a joyous concert of music that celebrates the wonder and diversity of creation. We will first melt away the winter blues with Antonin Dvorak’s lyrical Mass in D Major, a beautiful choral comp...","time":"7:30 PM – 9:30 PM","location":"Humber Valley United Church"},{"year":2019,"month":3,"day":6,"title":"Akin Creative: Life Drawing at Allan Gardens Conservatory","description":"Calling all plant enthusiasts and artists! Join us on Saturday, April 6th from 12-2pm for life drawing at Allan Gardens Park and Conservatory. We will meet at 12pm at the building's front entrance.\nFREE! Open / Drop In (no registration required)\nHaving trouble...","time":"12:00 PM – 2:00 PM","location":"Allan Gardens Conservatory"},{"year":2019,"month":3,"day":6,"title":"Albanian Film Association Comedy Fundraiser","description":"The Albanian Film Association is putting on a comedy fundraiser show! And you don’t need to be an Albo either, to have a good laugh!\nHosted by:\nBorana Makri & Nora Marku\nAnd featuring a line up of Toronto’s finest comics who have appeared on CBC, Just For Laug...","time":"7:00 PM – 10:30 PM","location":"Blua"},{"year":2019,"month":3,"day":6,"title":"Awkward Easter Pet Photos","description":"Let's face it: this Easter, you're probably going to put bunny ears on your pets anyway. You might as well capture the moment in an awkward photoshoot for charity!\nFor a $25 donation to Fetch & Releash, you and your pet will get:\n🐰 A 5-minute private photosho...","time":"12:00 PM – 3:00 PM","location":"Pet Uno"},{"year":2019,"month":3,"day":6,"title":"Best Of: A Stand Up Comedy Showcase","description":"'The Best Of' returns with an allstar lineup of the countries top stand up comedians. Featuring: Todd Graham(CBC The Debators), Hisham Kelati(JFL42), Sandra Battaglini(Just For Laughs) Rebecca Reeds (Winnipeg Comedy Gala), and Faisal Butt(Canada's Top Comic). ...","time":"7:00 PM – 8:30 PM","location":"Comedy Bar"},{"year":2019,"month":3,"day":6,"title":"Canyun, Lava Lava, Beams, Naomi Floods","description":"In celebration of our new release 'Leaving Hollowland,' we will be playing some music with some of our favourite music people at one of our favourite music places. Peep the deets...\n👽🤖👽🤖👽🤖👽😽👽🤖👽🤖👽🤖👽🤖👽\nNaomi Floods - Freak-folk looper\n👽\nhttps:/...","time":"9:00 PM – 1:00 AM","location":"Handlebar"},{"year":2019,"month":3,"day":6,"title":"CELEBRATION by Olivier Meyrou - YSL Documentary: The Canadian Premiere","description":"Toronto based fashion events startup Archival Toronto is brining another exciting piece of fashion cinema to the city.\nAfter 12 years, Celebration by Olivier Meyrou will finally be making its Canadian premiere.\nABOUT CELEBRATION by Olivier Meyrou\nBanned by Yve...","time":"4:00 PM – 6:00 PM","location":"Fox Theatre"},{"year":2019,"month":3,"day":6,"title":"Cocktails and Brushstrokes Paint and Sip","description":"BYOB Nude Male Model Painting Experience! This is not your typical flowers or landscape painting class, you'll be painting a LIVE NUDE male model. Our models are professionals who will be posing as you paint their exquisite bodies. This is for a fun girls nigh...","time":"8:00 PM – 9:30 PM","location":"Lindy Hop Revolution"},{"year":2019,"month":3,"day":6,"title":"Code Samurai Spring 2019 Hackathon","description":"Turing Fusion Labs is a Canadian Not for Profit Company whose mandate is to inspire young people to explore the world of technology and coding.\nWe are hosting a “Hackathon” for people aged 10-15 years old, called Code\nSamurai on April 6th 2019 at Pierre Elliot...","time":"9:00 AM – 4:00 PM","location":"Pierre Elliott Trudeau High School"},{"year":2019,"month":3,"day":6,"title":"Comedy for Dummies - FREE COMEDY","description":"A FREE monthly stand-up comedy show featuring some of Toronto's best comics! Hosted by Carolina DG and DJ'd by Mark Gonzaga (Beam Me Up Disco)! This month we welcome headliner Ben Miner (SiriusXM)! Lotto spots also offered to comics vying for stage time!","time":"6:00 PM – 8:00 PM","location":"The Piston"},{"year":2019,"month":3,"day":6,"title":"Discover The 6: High Park","description":"Discover The 6: High Park\nGet active. \nGet social. \nGet to know your city. \nDiscover The 6 is a scavenger-hunt/race style event.\nParticipants will work in teams of 4-6 (complete with fun team names and themed costumes) to discover clues, solve puzzles, and com...","time":"11:45 AM – 5:00 PM","location":"High Park Club"},{"year":2019,"month":3,"day":6,"title":"Drunken Cinema: Road House - 30th Anniversary Screening!","description":"*BACK BY POPULAR DEMAND! Revue Cinema partners with Drunken Cinema to screen one of the craziest bar-room brawling films ever made!\nPain don’t hurt…and neither does enjoying a drinking game to one of the greatest action films of all time with a great crowd! Dr...","time":"9:30 PM – 11:59 PM","location":"Revue Cinema"},{"year":2019,"month":3,"day":6,"title":"Easter Eggstravanganza at the Toronto Humane Society!","description":"On Saturday, April 6th the Toronto Humane Society will be hosting an Easter Eggstravaganza at their shelter. There will be 3 yoga classes to choose from, you can stretch and relax while enjoying our hoppy friends. Children as young as 5 can participate, but th...","time":"10:00 AM – 5:00 PM","location":"Toronto Humane Society"},{"year":2019,"month":3,"day":6,"title":"Friends in Art and Life","description":"Join three friends Susan Power, Kye Marshall and Catherine Maunsell at their shared art show. The three of them have followed different paths to the visual arts but as members of the Toronto Heliconian Club and as long time friends,they have come together to s...","time":"1:00 PM – 4:00 PM","location":"Heliconian Hall"},{"year":2019,"month":3,"day":6,"title":"Funny People","description":"Funny People produced and hosted by Anasimone George is BACK! Now at the Theatre Centre Cafe. Featuring: Desiree Walsh, Nikki Yee, Asaf Gerchek, Anubha Momin, and headlined by: Joe Vu!","time":"9:30 PM – 11:00 PM","location":"Theatre Centre Cafe"},{"year":2019,"month":3,"day":6,"title":"Ghost Fleet","description":"People normally think of slavery as a part of history. But in the global fishing industry, a modern form of slavery takes place far out at sea where no one can bear witness. Ghost Fleet follows a Thai human rights activist, Patima Tungpuchayakul, who has led a...","time":"7:00 PM – 8:30 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":6,"title":"Good and Gooder Makers Craft Market - Spring 2019","description":"A fun, modern maker’s market featuring a curated selection of local makers selling handmade goods. Featuring 30+ artisans, makers, and small shop owners from all over the GTA and surrounding areas. Live music by Brent Miller Live.\nApril 6 2019 10AM-3PM\nThe Ass...","time":"10:00 AM – 3:00 PM","location":"The Assembly Hall"},{"year":2019,"month":3,"day":6,"title":"GRAND CANYON Grand Opening Fete!","description":"Blood Pact Theatre, in association with The Storefront Arts Initiative, proudly unveils their brand-new venue: GRAND CANYON, and is celebrating with a Grand Opening Fête! This is a FREE EVENT and open invitation to the entire community to meet and mingle, whil...","time":"8:00 PM – 2:00 AM","location":"GRAND CANYON"},{"year":2019,"month":3,"day":6,"title":"In Ascend: Michael Adamson & Nicole Katsuras","description":"SAMARA Contemporary is pleased to present In Ascend, a new exhibition of paintings by Toronto-based artists Michael Adamson and Nicole Katsuras, curated by Rafi Ghanaghounian. Adamson and Katsuras explore the depths of abstraction within their respective bodie...","time":"4:00 PM – 7:00 PM","location":"SAMARA Contemporary"},{"year":2019,"month":3,"day":6,"title":"Jane's Party Album Release Show at The Horseshoe Tavern w/ Side Hustle","description":"Though they’ve been playing together since 2006, the members of Toronto-based pop-rock quartet Jane’s Party - Devon Richardson, Tom Ionescu, Jeff Giles, and Zach Sutton – feel like they’re just starting to gather steam.\nReady to take off after years roving Tor...","time":"9:00 PM – 11:30 PM","location":"The Horseshoe Tavern"},{"year":2019,"month":3,"day":6,"title":"Jazz & Reflection: The Barry Livingston Group","description":"Add some music to your Saturday afternoon at Jazz & Reflection, featuring amazing music by the Barry Livingston Group:\nBarry Livingston - piano, compositions\nColleen Allen - soprano saxophone, flute\nSuba Sankaran - voice\nKobi Hass - bass\nPaul Fitterer - drums\n...","time":"4:30 PM – 5:15 PM","location":"Beach United Church"},{"year":2019,"month":3,"day":6,"title":"Jests in Time","description":"No matter who we are or where we come from, we all love to laugh. For centuries, we have revelled in the humour of light-hearted jests and gags as vehicles to express our amusement and joy. But what happens when comedy takes a dark turn – when we use humour to...","time":"8:00 PM – 10:00 PM","location":"Alliance Francaise de Toronto"},{"year":2019,"month":3,"day":6,"title":"Keep The Faith - Bon Jovi Tribute Live at Drums N Flats","description":"Keep the Faith are Canada's Premiere Tribute to Rock and Roll Hall of Fame Inductees BON JOVI!\nA non-stop hit parade of Bon Jovi Music all night long, performed by incredibly talented musicians who share a passion for recreating the ultimate Bon Jovi Concert E...","time":"9:30 PM – 12:30 AM","location":"Drums N Flats"},{"year":2019,"month":3,"day":6,"title":"Krystal Beth/Spacelord/Conan Troutman/The Damnations/TopzZ","description":"Music for the Masses Presents - 4am last call - Sat Apr 6 at The Bovine\n- Krystal Beth performing the music of Kiss (Featuring members of Indian Handcrafts)\n- Spacelord performing the music of Monster Magnet\n- Conan Troutman performing the music of Kyuss\n- The...","time":"9:00 PM – 4:00 AM","location":"Bovine Sex Club"},{"year":2019,"month":3,"day":6,"title":"Landscape Design Class","description":"Meredyth Hilton knows gardens – she’s green and gifted! Plus, she’s an excellent teacher. You can learn from today’s hottest garden expert and, in a five week course, prepare your own landscape design!\nThis five week course is fun, and enables students to expl...","time":"2:00 PM – 4:00 PM","location":"Design Department"},{"year":2019,"month":3,"day":6,"title":"Learn to play Australian Rules Football with the Toronto Dingos FC","description":"Want to play the best sport in the world? Learn the fast paced sport of Australian rules football with the Toronto Dingos AFL Football Club. No previous experience necessary! Come on down to join us for a kick if you are interested in learning a new sport whil...","time":"2:15 PM – 4:30 PM","location":"Ballsports Polson Pier"},{"year":2019,"month":3,"day":6,"title":"Literally Dead Comedy","description":"A comedy show featuring Toronto's top comedians! Prizes to be won from Greenhouse Juice and Yoga Tree!","time":"6:30 PM – 8:30 PM","location":"Comedy Bar"},{"year":2019,"month":3,"day":6,"title":"Mindfulness through Art","description":"Be a part of this formative workshop held in the beautiful Artscape Youngplace building. Your child will be introduced to mindfulness practices and indulge in creative self-expression in an exuberant art studio experience!\nFor more info and to register, click ...","time":"9:30 AM – 11:30 AM","location":"Sketch @ Artscape Youngplace"},{"year":2019,"month":3,"day":6,"title":"Money Management for Kids","description":"Meet expert Maya Corbic for a workshop on financial literacy and management for parents and children. Suited for parents and older, school-age children.","time":"11:00 AM – 12:00 PM","location":"Jones Library"},{"year":2019,"month":3,"day":6,"title":"Monkey Toast: The Improvised Talk Show - April Edition","description":"We hope that you'll join us for our April show as we welcome special guests, from the hit CBC Podcast, The Secret Life of Canada, Leah-Simone Bowen and from The Nation Post and CBC's At Issue, journalist, Andrew Coyne!\nMonkey Toast is a six-time Canadian Comed...","time":"8:00 PM – 10:00 PM","location":"Social Capital Theatre"},{"year":2019,"month":3,"day":6,"title":"Neilson Park Creative Centre's Spring Handmade Art and Fine Craft Sale","description":"Visit NPCC’s Handmade Spring 2019 sale! The sale is from 10 am to 4 pm. Shop directly from local artists and artisans for fine arts and crafts. Demonstrations by artists in our six resident art groups in painting, quilting, rug crafting, spinning and weaving, ...","time":"10:00 AM – 4:00 PM","location":"Neilson Park Creative Centre"},{"year":2019,"month":3,"day":6,"title":"Oculus Go Hackathon 2019","description":"Aquent DEV6 and Facebook Developer Circles - Toronto will be hosting an Oculus Hackathon on April 6, 2019 at Lighthouse Labs Toronto! The day will begin at 8AM and end at 8PM. Get your team together and join us for a fun day of learning, competition, and netwo...","time":"8:00 AM – 8:00 PM","location":"Lighthouse Labs"},{"year":2019,"month":3,"day":6,"title":"\"OFF THE BEATEN PATH\" solo exhibition by photographic artist LORI RYERSON","description":"Thurs.April 4 to Sat.April 27, 2019\n\"My photography is usually the result of serendipity. I look for an alignment of things that convey a story, for the narrative in abandoned urban landscapes. I try to capture what silence looks like. These are the stories I ...","time":"2:00 PM – 5:00 PM","location":"Urban Gallery"},{"year":2019,"month":3,"day":6,"title":"Perfect 10 Presents: Saturday At Comedy Bar - April 6th","description":"‘Saturday At Comedy Bar’ returns April 6th. With humble beginnings in 2008 'Perfect 10 Comedy' has just celebrated their 10 Years at the famed Comedy Bar with some of Canada's Funniest Pro Comedians!\nONLY $10 ($15 door)\nhttps://comedybar.ca/show.php?Event_ID=1...","time":"10:30 AM – 12:30 AM","location":"Comedy Bar"},{"year":2019,"month":3,"day":6,"title":"Rock for Venezuela","description":"A charity show benefitting @venezolanosplv who are providing crucial help with the humanitarian crisis in Venezuela.\nFeaturing .carbonated., Gelax, People Walking By and Kobura\nPresented by A-Minor\nTickets $12 door/ $10 advance here: https://bit.ly/2Tsd8xx\nDoo...","time":"6:00 PM – 10:00 PM","location":"Sneaky Dee's"},{"year":2019,"month":3,"day":6,"title":"Sash & Bustle Annual Accessory Event!","description":"At this one day only event, S&B; will be transformed in to a magical accessory land! From veils to jewelry, shoes to boleros, flowers crowns to hair pieces, we will have everything your heart desires. All items will be 10% off at this event! Everyone is welcom...","time":"10:00 AM – 5:00 PM","location":"Sash and Bustle"},{"year":2019,"month":3,"day":6,"title":"Saturday Family Clay","description":"Every Saturday is a family art day at LucSculpture. Call us and book a spot for your family and friends to make clay sculpture and hand built ceramics. We will fire the clay pieces for you! Reunite the family doing art and it is fun for everyone!\nTime: Every S...","time":"1:00 PM – 4:00 PM","location":"LucSculpture School & Studios"},{"year":2019,"month":3,"day":6,"title":"Shane Pendergast Plays The Local","description":"Singer-songwriter Shane Pendergast of Prince Edward Island will play two sets of original and traditional maritime folk music from 2-4 PM on April 6th.","time":"2:00 PM – 4:00 PM","location":"The Local"},{"year":2019,"month":3,"day":6,"title":"Sheldon Holder Live w/ AFO at Alchemy Food and Drink","description":"The Band will be playing from 10 pm onward. We will play 3 sets for the night. We play until last orders!\nNo cover.\nKitchen open 12PM - 12AM","time":"10:00 PM – 2:00 AM","location":"Alchemy Food & Drink"},{"year":2019,"month":3,"day":6,"title":"SHINE Gentle Yoga in Nature at Kortright","description":"This program is ideal for seniors and older adults: a fun and gentle yoga practice that honours where your body is today and helps to mold it for tomorrow.\nOur Gentle Yoga series is designed specifically for those individuals who want to improve their activity...","time":"10:00 AM – 11:00 AM","location":"Kortright Centre for Conservation"},{"year":2019,"month":3,"day":6,"title":"#SHOPMYEIVEY Pop Up Shopping Event","description":"Preloved Designer Sale!\nShop curated closets from Toronto's finest Eivey Sellers and join the movement of sustainable shopping.\nNOTE: At the time of the event all transactions will be conducted through the eivey.ca website. Register now to expedite Check Out a...","time":"11:00 AM – 5:00 PM","location":"Shine PR Office"},{"year":2019,"month":3,"day":6,"title":"Slay! A Murder Mystery with Drag Queens - Our 2 Year Anniversary show!","description":"It's our two year anniversary! So... we go back to where it all started, when a \"Mayor got Murdered!\"\nLast year we revisited the sleepy town a year later, and ANOTHER mayor got murdered!\nThis year, the election for mayor is on again... and it's not looking goo...","time":"11:00 PM – 11:59 PM","location":"Bad Dog Comedy Theatre"},{"year":2019,"month":3,"day":6,"title":"Slow Art Day","description":"Onsite Gallery is pleased to participate in the annual international event, Slow Art Day.\nEvery hour on the hour (12:00 p.m., 1:00 p.m., 2:00 p.m., 3:00 p.m. and 4:00 p.m.), one artwork in our current exhibition, How to Breathe Forever, will be selected for fo...","time":"12:00 PM – 4:00 PM","location":"Onsite Gallery"},{"year":2019,"month":3,"day":6,"title":"Slow Art Day 2019","description":"Slow Art Day is a global event with a simple mission: Help more people discover for themselves the joy of looking at and loving art.\n\r\nHeld each year on the second Saturday in April, Slow Art Day has more than 100 institutions participating around the world, e...","time":"2:00 PM – 3:00 PM","location":"Power Plant"},{"year":2019,"month":3,"day":6,"title":"Slow Art Day - Tour with Lisa Steele","description":"How can slow viewership apply to the experience of time-based media? Join artist Lisa Steele for a slow viewing of Daniel Young & Christian Giroux’s exhibition Film Path / Camera Path with under-titles. Steele will lead a critical and durational viewing of the...","time":"2:00 PM – 4:00 PM","location":"InterAccess"},{"year":2019,"month":3,"day":6,"title":"Sophisticated Funk","description":"No cover! Joining the musical dots - soul, hip-hop, house, latin, electronica, jazz and beyond all on vinyl.","time":"10:00 PM – 2:00 AM","location":"Farside"},{"year":2019,"month":3,"day":6,"title":"Spring Breakaway Ice Hockey Tournament","description":"WHAT:\n5 on 5 Ice Hockey Tournament. All games will be refereed. All teams play a minimum of 3 games (12-15-15 run-time). Potential to play more based on tournament record. This is a 2 day tournament. All teams will play games on both Saturday and Sunday.\nSKILL...","time":"9:00 AM – 7:00 PM","location":"Canlan Ice Sports"},{"year":2019,"month":3,"day":6,"title":"Spring Celebration of Sales Event - FREE ADMISSION","description":"Spring is in the air and so are red hot deals. Over 30 local vendors with items for everyone. Access to 2nd floor by elevator. Tons of great items. FREE admission and tons of FREE parking\nHope to see you there!","time":"9:00 AM – 5:00 PM","location":"ETOBICOKE OLYMPIUM"},{"year":2019,"month":3,"day":6,"title":"Spring has sprung at Hillcrest with Spring Sweets Pop-up Market","description":"Hillcrest’s Centre Court will blossom into a spring spectacle on April 6 and 7 with its Spring Sweets pop-up market. It will feature 12 food vendors providing visitors with a sweet experience. Vendors include All you Knead, Paletta America, Vapz Tastebudz, Ros...","time":"9:30 AM – 9:00 PM","location":"Hillcrest - Centre Court"},{"year":2019,"month":3,"day":6,"title":"Spring Tune-Up Football Tournament","description":"WHAT:\nSTU is a 5 on 5 turf Flag Football Tournament. This is a co-ed tournament (minimum of 2 of each gender on the field at all times). All teams play a minimum of 4 x 30 minute games. Games will be self-officiated like all SSC league games.\nThis tournament i...","time":"12:00 PM – 8:00 PM","location":"Varsity Stadium"},{"year":2019,"month":3,"day":6,"title":"Spring Tune-Up Ultimate Tournament","description":"WHAT:\nSTU is a 4 on 4 Ultimate Speedpoint Tournament. This is a co-ed tournament (minimum of two 2 of each gender on the field at all times). All teams play 4 x 30 minute games. Like all TSSC Leagues, this tournament is self-officiated.\nThis tournament is bein...","time":"12:00 PM – 8:00 PM","location":"Varsity Stadium"},{"year":2019,"month":3,"day":6,"title":"Teen Volunteer and Job Fair","description":"Find out about volunteer and job opportunities. Talk to representatives from local agencies and learn how you can make a difference. Discover ways you can earn your community service hours, get a part-time job or summer employment.\nPlease call 416-395-5710 to ...","time":"2:00 PM – 4:00 PM","location":"Don Mills Library"},{"year":2019,"month":3,"day":6,"title":"THE 4TH OF ITS KIND SPRING FLING CRAFT AND FOODIE AFFAIR","description":"Free. Not for profit community event.\n50 vendors. Food and craft. Free gift for the first 300.\nGrand prizes, giveaways. Parking. ATM. WIFI.\n700 expected.","time":"9:30 AM – 2:30 PM","location":"Legion Hall 11"},{"year":2019,"month":3,"day":6,"title":"The Baby Show","description":"Find everything pregnancy, baby and toddler for the modern parent at Toronto’s premium early parenting show. The Baby Show features workshops, seminars and demos from Canada’s leading parenting experts. Shop products from top brands as well as local and handma...","time":"9:00 AM – 6:00 PM","location":"Enercare Centre, Exhibition Place, Toronto"},{"year":2019,"month":3,"day":6,"title":"THE GROOVE with Brother Wayne","description":"🎶Motown🎶Soul🎶Rock🎶Pop🎶\nCome get yer groove on!\n*FREE*","time":"10:00 PM – 2:00 AM","location":"Swan Dive"},{"year":2019,"month":3,"day":6,"title":"The Red Nose Cabaret","description":"The Red Nose Cabaret returns on Saturday, April 6th for our season 3 finale with your hosts, Philip & Lucinda!\nHelp us warm our new home at Sweet Action Theatre located at Artscape Youngplace (180 Shaw Street - Unit #106)\nDoors: 8:00pm\nShow 8:30-10:00pm\n$15.00...","time":"8:30 PM – 10:00 PM","location":"Sweet Action Theatre"},{"year":2019,"month":3,"day":6,"title":"The Song Shul's Shabbat Hachodesh","description":"The Song Shul's Parshat Tazria — SHABBAT HACHODESH\nNo registration/ticket required to attend this service.\nCantor Simon Spiro and the amazing Toronto Festival Singers begin the month of Nissan with the most superb a cappella Shabbat morning music. There is no ...","time":"9:00 AM – 11:30 AM","location":"Bialik Hebrew Day School"},{"year":2019,"month":3,"day":6,"title":"The Temptress","description":"Toronto Silent Film Festival presents The Temptress 1926\nA director once said of Garbo that she had a rapport with an audience…that she could let them know she was thinking things, and thinking them uncensored. The Temptress shows us that even at the young age...","time":"4:15 PM – 6:00 PM","location":"Revue Cinema"},{"year":2019,"month":3,"day":6,"title":"The ThrowDown Dance Convention","description":"UrbanArts presents the ‘ThrowDown’ Dance Convention– a 1-day annual urban dance platform aimed at promoting the importance of accessible and inclusive dance programs, highlighting the importance of physical literacy, offering new and exciting opportunities for...","time":"10:30 AM – 5:00 PM","location":"Toronto Centre for the Arts"},{"year":2019,"month":3,"day":6,"title":"Thorrablót 2019","description":"Come and enjoy wonderful Icelandic food, musical entertainment, a chance to bid on lots of great items in our Silent Auction and Live Auction and be a part of the incredible camaraderie and fun of Þorrablót. You won’t want to miss this event. We always sell ou...","time":"6:00 PM – 9:00 PM","location":"Latvian Canadian Cultural Centre"},{"year":2019,"month":3,"day":6,"title":"Todd Graham Live Comedy","description":"Join us Saturday Apr 6 for a hilarious stand-up comedy show with the only and only Todd Graham!\nDoors open 8:30, showtime is 9:30, just $15 admission!\nAdv tix here: https://www.universe.com/events/todd-graham-live-comedy-tickets-toronto-7JGSM6\nTodd Graham has ...","time":"9:30 PM – 11:00 PM","location":"The Underground Cafe"},{"year":2019,"month":3,"day":6,"title":"Use Nature to Support Well-Being at Toronto Botanical Garden","description":"Many people face challenges such as stress, anxiety and trauma that can degrade their quality of life. Horticultural therapy supports emotional wellness and provides a catalyst for meaningful change. This indoor/outdoor workshop invites participants to explore...","time":"10:00 AM – 4:00 PM","location":"Toronto Botanical Garden"},{"year":2019,"month":3,"day":6,"title":"Vienna Boys Choir","description":"The “breathtaking” choir is “totally disciplined voices tempered by a singular sense of ease and consistency” (Washington Post).  The Vienna Boys Choir has delighted music lovers for six centuries with their purity of tone, charm, and crowd-pleasing repertoire...","time":"3:00 PM – 5:00 PM","location":"Koerner Hall"},{"year":2019,"month":3,"day":6,"title":"Visionville Warehouse Sale","description":"Designer demo and secondhand eyewear in excellent condition, at warehouse prices!\n\r\nMajor fashion branded frames and sunglasses starting at $29\n\r\nON SITE ~ prescription Rx lenses starting from $39\n\r\nWe are located in North York near Sheppard West Station: 3975...","time":"12:00 PM – 5:00 PM","location":"Visionville Optical Lab"},{"year":2019,"month":3,"day":6,"title":"VOICES IN VERSE II","description":"Join the Scarborough Poetry Club for VOICES IN VERSE II: Celebrating Nature with poetry for National Poetry Month 2019","time":"1:00 PM – 3:00 PM","location":"Agincourt Library"},{"year":2019,"month":3,"day":6,"title":"When Stan Met Ollie-Shorts Programme","description":"Toronto Silent Film Festival presents: 1000 Laffs Comedy Shorts Programme\nBefore there was even a first “another nice mess”, Stan Laurel and Oliver Hardy each spent a decade as cinematic soloists until destiny (with a little help from the Hal Roach Studios) un...","time":"1:30 PM – 3:30 PM","location":"Revue Cinema"},{"year":2019,"month":3,"day":6,"title":"With It 60s Mod Soul Record Dance Party","description":"Monthly all vinyl record dance party\n60s Mod Soul R&B; R&R; Garage Beat Surf Funk\nGuest DJs from Toronto, New York, Montreal, Ottawa\nDJ Nico + Guest DJs\nSponsors: Kops Records\n10pm, $10, 19+\nfacebook.com/getwithitparty","time":"10:00 PM – 2:30 AM","location":"The Piston"},{"year":2019,"month":3,"day":6,"title":"Women of Comedy","description":"Comedy Nuggets brings you a professional line up of women stand-up comedians, including: Hannah Lawrence (Edinburgh Fringe Festival, NXNE Festival) Moniquea Marion (Toronto Sketch Fest, Toronto Fringe, Big City Improv Festival) Ashley Cooper (JFL42, Brantford ...","time":"8:00 PM – 9:15 PM","location":"Social Capital Theatre"},{"year":2019,"month":3,"day":6,"title":"Women Own Your Badassery: Design Your Path To Success & Fulfillment","description":"This full-day workshop is designed for women only who are professional, in a leadership role, business owners or aspiring leaders.\nAn essential part of growth is shedding the weight collected when we begin to carry things we are convinced are necessary to our ...","time":"8:30 AM – 4:00 AM","location":"CSI Annex"},{"year":2019,"month":3,"day":7,"title":"Middleditch and Schwartz in Toronto","description":"All Ages Event  Doors - 5:30pm Sale Dates and Times: Public Onsale : Fri, 14 Dec 2018 at 10:00 AM Artist Presale : Tue, 11 Dec 2018 at 10:00 AM Just For Laughs Presale : Tue, 11 Dec 2018 at 10:00 AM Media Presale : Tue, 11 Dec 2018 at 10:00 AM Danforth...","time":"7:30 PM","location":"The Danforth Music Hall"},{"year":2019,"month":3,"day":7,"title":"Toronto Art Crawl SPRING POP UP","description":"Ring in Spring at the Toronto Art Crawl SPRING POP UP, taking place at The Great Hall, Sunday April 7th, 2019! - Shop directly from the hands of 50 SUPER talented local artists and designers, - Choose from original art, fashion, jewelry, home decor, vintage, p...","time":"11:00 AM – 5:00 PM","location":"The Great Hall"},{"year":2019,"month":3,"day":7,"title":"163 John St. : THE DANGER ROOM @ THE CORNER","description":"THE DANGER ROOM HOSTS: DAN GUIRY & MORGAN O'SHEA 'The Danger Room' is marathon style show with a variety of professional and amateur comedians testing their most dangerous and explicit material. Audience members are encouraged to boo and heckle comedians durin...","time":"9:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":3,"day":7,"title":"2019-Intuitive Art Workshop","description":"Unleash your creativity! Let go of your mind and create something uniquely our own. Natasha will lead you through some warmups and visualizations to awaken your senses and then you will immerse yourself in painting. This will be a safe and supportive environme...","time":"1:00 PM – 4:00 PM","location":"Luc Sculpture"},{"year":2019,"month":3,"day":7,"title":"2019 Swimming Trials Afterparty","description":"Hey Torontonians, This year the Canadian Swimming Nationals will be held here in Toronto and you know what that means? A massive party afterwards!!! Come get down with world class athletes and Olympians 🎉 We are going to be hosting an Afterparty at Tequila Ja...","time":"10:30 PM – 2:00 AM","location":"Tequila Jacks"},{"year":2019,"month":3,"day":7,"title":"946 QUEEN ST. EAST : SUNDAY BEST @ THE CORNER EAST","description":"Every Sunday at The Corner Comedy Club EAST, TAMARA SHEVON will be hosting SUNDAY BEST! A lineup of Canada’s best comedians.\nThere's gonna be 2 shows, 8PM & 10PM, each with a different set of comics. Credits include Just For Laughs, JFL 42, CBC, Comedy Network...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":3,"day":7,"title":"AMAZE - a night of magic and mystery featuring The Sentimentalists","description":"Welcome to Amaze - the first magic and mentalism night at The Rec Room of its kind. Join world-renowned mentalists The Sentimentalists, stars and foolers of Penn & Teller’s Fool Us, accompanied by the up-and-coming duo of Beyond Mental Borders, and The Wandere...","time":"7:30 PM – 10:30 PM","location":"The Rec Room"},{"year":2019,"month":3,"day":7,"title":"Arts & Culture Volunteer Fair","description":"Interested in volunteering? Join us to learn about arts and cultural organizations looking for people just like YOU!\nAre you interested in building your resume, creating professional contacts or meeting new & interesting people? Then volunteering within Toront...","time":"11:00 AM – 3:00 PM","location":"Harbourfront Centre"},{"year":2019,"month":3,"day":7,"title":"Beaches Life 2nd Annual Wellness & Beauty Show","description":"Come and meet local business owners face-to-face, discover the wide range of Wellness & Beauty products they offer and get a personal consultation.\nThe Event features live demonstrations and fashion shows. Free admission. Free parking.","time":"10:00 AM – 4:00 PM","location":"Ashbridge's Bay Yacht Club"},{"year":2019,"month":3,"day":7,"title":"Between Worlds","description":"Presented by Toronto Jewish Film Society.\nA quiet understated Israeli drama that challenges our notions of faith, truth, understanding and, possibly, acceptance. Tickets: $15, $10 for ages 18-35.","time":"2:00 PM – 3:30 PM","location":"Innis Town Hall"},{"year":2019,"month":3,"day":7,"title":"Black Sheep Comedy's Stand Up @ People's Pint Brewing Company, April Edition","description":"Join Black Sheep Comedy @ People's Pint for the best stand-up comedy show and craft beer in The Junction!\nSip a complimentary 12oz beer while watching an insanely talented lineup.\nHeadliner Jeff Elliott! As seen on CBC’s Winnipeg andHalifax Comedy Festivals, I...","time":"7:00 PM – 9:30 PM","location":"People's Pint Brewing Company"},{"year":2019,"month":3,"day":7,"title":"Celebrate your love with Toronto Bridal Brunch","description":"Celebrate your love with your #bridalsquad at Toronto’s one of a kind luxury bridal show and brunch. Join us on Sunday, April 7th, 2019 at The Globe and Mail Centre from 10 a.m. to 3 p.m. for an unforgettable day of mingling, brunching, and celebratory snapsho...","time":"10:00 AM – 3:00 PM","location":"The Globe and Mail Centre"},{"year":2019,"month":3,"day":7,"title":"Colin Fowlie - Party Music Release show","description":"Colin is releasing his full length album \"party music'! Colin strives for lyrical depth and compelling stories in his songs, fusing elements of folk, rock, blues, and Americana/Canadiana.\nBrooklyn Doran at 8:00 PM\nClaire Coupland Music at 9:PM\nColin Fowlie at ...","time":"8:00 PM – 11:00 PM","location":"Painted Lady"},{"year":2019,"month":3,"day":7,"title":"Dinosaurs for Grown-Ups","description":"Do you ever feel like the kids in your life know more about T. rex and Triceratops than you do? Discover the basics of dinosaurs, evolution, and fossils with ROM Educator Kelly Hodgins in this full-day workshop where you will explore the James and Louise Temer...","time":"10:30 AM – 3:30 PM","location":"ROM"},{"year":2019,"month":3,"day":7,"title":"Diverse Dishes","description":"Diverse Dishes is a cooking event, hosting unique cooking classes in Toronto. The event will take place on April 7th, 2019 at Kitchen 24 in North York, Toronto. This event is for those who are curious about cooking and always strive to learn more about what co...","time":"11:00 AM – 9:00 PM","location":"Kitchen 24"},{"year":2019,"month":3,"day":7,"title":"DIY Natural Deodorant Workshop by Make This Universe","description":"Ever wanted to make your own DIY Skincare products at home, but not sure where to start? Trying to transition to a Zero Waste lifestyle by creating your own natural deodorant, but can't find the right ingredients? Or, are you just tired of trying natural deodo...","time":"12:00 PM – 3:00 PM","location":"Milk Glass Co."},{"year":2019,"month":3,"day":7,"title":"Douglas Fairbanks: When the Clouds Roll By","description":"Toronto Silent Film Festival -Day 3\nIt's the 100th anniversary of the founding of United Artists so a celebration of one of the founders, Douglas Fairbanks is in order!\nWe’re all familiar with the classic image of Douglas Fairbanks as the swashbuckling hero of...","time":"3:15 PM – 5:30 PM","location":"Royal Cinema"},{"year":2019,"month":3,"day":7,"title":"Etobicoke Beer Run","description":"WHEN DOES THE EVENT START?\n\r\nCome join us for a pre-race warmup at 11:00am but the first wave pre-party starts at 11:10am!\n\r\nWHERE DO I START THIS BEER RUN THING?!\n\r\nDon’t worry we got you covered! Put it into your GPS so you can get there on time! Yeah!\n\r\nBig...","time":"11:00 AM – 4:00 PM","location":"Big Rock Brewery"},{"year":2019,"month":3,"day":7,"title":"JARRED DUNN: The Art of the Piano","description":"The Art of the Piano: Jarred Dunn\nSunday, April 7, 2019 at 7:30 pm\nTickets: $25/$10 Student (Cash only at the door)\nReserve tickets at info@gallery345.com\nPurchase advance tickets on Eventbrite\nProgram\nBeethoven Sonata Op. 110\nChopin Nocturne Op. 48 nr. 1\nChop...","time":"7:30 PM – 9:30 PM","location":"Gallery 345"},{"year":2019,"month":3,"day":7,"title":"Jodhpur Kingdom: Gender, Class and Caste","description":"Examine the socio-cultural realities of gender, class and caste depicted in the spectacular royal arts of Jodhpur, Rajasthan. From gendered architecture and elaborate furniture to textiles and jewellery, find out who would have made and used these objects. How...","time":"10:30 AM – 3:30 PM","location":"ROM"},{"year":2019,"month":3,"day":7,"title":"Kids Workshop: Italian Easter Bread Making","description":"Easter egg painting, bread to take home, hot chocolate and LOTS of fun!!\nYour little chef will learn how to make their very own traditional Italian Easter Bread!\nAlso known as Pane di Pasqua, this fluffy and eggy bread is served during Easter time in Italian c...","time":"10:00 AM – 11:30 AM","location":"Cucinato Studio"},{"year":2019,"month":3,"day":7,"title":"LEGENDS OF TIME: Exhibition and Sale of Paintings By Oleh Nedoshytko","description":"The Taras Shevchenko Museum is pleased to announce Legends of Time –an exhibition and sale of paintings by the Ukrainian artist, Oleh Nedoshytko, who will introduce over 20 of his recent works. Opening with a reception on Sunday, April 7, 2019 from 2:30 to 5:3...","time":"2:30 PM – 4:00 PM","location":"Taras Shevchenko Museum"},{"year":2019,"month":3,"day":7,"title":"National Initiative for Eating Disorders 7th Annual Honouring the Journey Event","description":"Join NIED for our 7th Annual 'Honouring the Journey' event. This event is dedicated to inspiring, honouring, commemorating, and celebrating caregivers. Our panel of caregivers will share their experiences of grappling, wrestling, caring, and loving their loved...","time":"3:00 PM – 5:00 PM","location":"Adath Isreal Congregation"},{"year":2019,"month":3,"day":7,"title":"Photography Workshop for Women","description":"Do you have a camera and have no idea where to start? This workshop is an intensive on how to use your DSLR, designed for true beginners! So you shoot on Automatic, and want to learn how to use the Manual settings but feel overwhelmed on where to even start an...","time":"9:00 AM – 12:00 PM","location":"Lovt Studio"},{"year":2019,"month":3,"day":7,"title":"Rayannah & Ponteix : Album Release","description":"Western Canadian francophone artists Rayannah (MB) and Ponteix (SK) will share three tour dates this spring to celebrate the release of their respective albums, “Nos repaires (Our Haunts)” and “Bastion”. The Trille Or-nominated acts will present their latest l...","time":"8:00 PM – 10:00 PM","location":"Small World Music Centre"},{"year":2019,"month":3,"day":7,"title":"Richard Goode","description":"“It is virtually impossible to walk away from one of Mr. Goode’s recitals without the sense of having gained some new insight, subtle or otherwise, into the works he played or about pianism itself.” (The New York Times) Richard Goode will perform an all Ludwig...","time":"3:00 PM – 5:00 PM","location":"Koerner Hall"},{"year":2019,"month":3,"day":7,"title":"Sistema Spirit Gala","description":"The Sistema Spirit Gala is a party and fundraiser featuring amazing live music from jazz and world musicians Neil Brathwaite and Ruth Mathiang. Ticket price includes music, food, and beverages and 100% of the proceeds support bringing more students into Sistem...","time":"7:00 PM – 10:00 PM","location":"The Spoke Club"},{"year":2019,"month":3,"day":7,"title":"Skinner's Dress Suit","description":"Toronto Silent Film Festival continues with the newly restored by Universal Pictures, this Rom-Com is a snappy comedy of errors, delightfully brimming with wit and sass that puts it right up there with the best. Reginald Denny & Laura La Plante richly deserved...","time":"1:00 PM – 2:40 PM","location":"Royal Cinema"},{"year":2019,"month":3,"day":7,"title":"Spring has sprung at Hillcrest with Spring Sweets Pop-up Market","description":"Hillcrest’s Centre Court will blossom into a spring spectacle on April 6 and 7 with its Spring Sweets pop-up market. It will feature 12 food vendors providing visitors with a sweet experience. Vendors include All you Knead, Paletta America, Vapz Tastebudz, Ros...","time":"11:00 AM – 7:00 PM","location":"Hillcrest - Centre Court"},{"year":2019,"month":3,"day":7,"title":"Tassles & Tea: Create Your Own Pasties!","description":"Interested in a crafternoon of breast positivity and sassy pasties? Get your craft on during this Make Your Own Nipple Pasties workshop.\nLuna Matatas will walk you through designing, creating and applying pasties. You'll make up to two pairs of pasties to take...","time":"6:00 PM – 7:30 PM","location":"Kink Toronto"},{"year":2019,"month":3,"day":7,"title":"The Cleaners","description":"Viewers meet five “digital scavengers,” among thousands of people outsourced by Silicon Valley companies, whose job is to delete “inappropriate” web content. A typical cleaner must observe and rate thousands of often deeply disturbing images and videos every d...","time":"4:00 PM – 5:30 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":7,"title":"The Song Shul's first Women's Seder","description":"The Song Shul's Women's Seder\nAliza Spiro leads Toronto’s first WOMEN’S SEDER, shining new light on the Pesach experience.\nNot a “Feminist Seder” — it’s a Women’s Seder! Song-filled and jam-packed with exciting insights about the contribution of women to the s...","time":"2:00 PM – 4:00 PM","location":"Rinx Entertainment Centre"},{"year":2019,"month":3,"day":7,"title":"Toronto Arrows Rugby Football Club's First Official Home Game","description":"The Toronto Arrows Rugby Club, Canada’s first professional rugby union team was added to Major League Rugby for the 2019 season. Come watch the Toronto Arrows first home game and cheer them on as they play against the Nola Gold Rugby team.","time":"2:00 PM – 5:00 PM","location":"York Alumni Stadium"},{"year":2019,"month":3,"day":7,"title":"Toronto Lettering Crew 2019 Meetup","description":"Lettering Lovers! - Join us April 7th for the first TLC Meetup of the year!\nSpring is slowly making its way in and what better way to celebrate than a meetup with fellow creatives?\nWe are excited to be hosting TLC @torontoletteringcrew first meetup of the year...","time":"1:00 PM – 4:00 PM","location":"Paper Plus Cloth"},{"year":2019,"month":3,"day":7,"title":"Toronto R&b Sounds","description":"Join us for a dreamy evening of rare, live performances from Toronto's rising R&B; artists at The Baby G.\nHere is what previous guests have had to say:\n\"It was such a beautiful and authentic experience. So inspiring to see all the talented singers/artist. Beyo...","time":"8:00 PM – 11:00 PM","location":"The Baby G"},{"year":2019,"month":3,"day":7,"title":"Tristana & Ashtanga Yoga Fundamentals Workshop","description":"Sunday, April 7, 1- 4pm\nTristana and Ashtanga Yoga Fundamentals Workshop with Mark Morra\nThe foundation of Ashtanga Yoga was described in Yoga Mala by PattabhiJois as Tristana: Breath, Asana, and Dristi. When practiced simultaneously, Ashtanga becomes a moving...","time":"1:00 AM – 4:00 PM","location":"The Basement Yoga & Fitness Studio"},{"year":2019,"month":3,"day":7,"title":"Unclutter Emotions with Master Teresa","description":"Rare opportunity to experience group Chi healing with Master Teresa with over 20 years experience. She will demonstrate how to practice Chi Gong; how to project Chi and balance your emotions.\nShe has special ability to scan and read your from a distance. So th...","time":"2:00 PM – 3:30 PM","location":"New Age Healing Centre"},{"year":2019,"month":3,"day":7,"title":"WrestleMania 35 Viewing Party with Dinner!","description":"Are you ready for the most important wrestling event of the year? Come join us at the Law Office of Caryma Sa’d Downtown Toronto. We are hosting a private event with DINNER\nBUFFET. (including non-alcoholic drinks)\nWrestleMania 35 will be the thirty-fifth annua...","time":"6:00 PM – 11:59 PM","location":"Law Office of Caryma Sa'd"},{"year":2019,"month":3,"day":8,"title":"Alternative Film Festival Spring Edition","description":"Jenell Diegor and Asian On A Mission Productions presents the Alternative Film Festival. Due to technical difficulties, we had to reschedule the original screening from March 18 to April 8. Please join us in watching Don't Feed These Animals, Cheetah, Rebel Wi...","time":"6:30 PM – 7:30 PM","location":"2469 Dundas St. West"},{"year":2019,"month":3,"day":8,"title":"Escape the Upside Down","description":"Ever wanted to experience the world of Stranger Things in real life? Now you can! On April 8th come to a one of a kind escape room event: “Escape The Upside Down”. In teams of 8, you will compete against other teams to see who can complete their escape room fi...","time":"7:00 PM – 11:00 PM","location":"DevHub Toronto"},{"year":2019,"month":3,"day":8,"title":"Fleetwood Mac in Toronto","description":"Sale Dates and Times: Public Onsale : Mon, 12 Nov 2018 at 10:00 AM A limited number of LaneOne VIP Packages will also be available, including amazing seats with premium benefits such as transportation, preferred entrance and more. https://www.laneone.com/e...","time":"8:00 PM","location":"Scotiabank Arena"},{"year":2019,"month":3,"day":8,"title":"163 John St. : DO OR DIE OPEN MIC @ THE CORNER","description":"HOSTS: JOEY HARLEM & JEREMY DOBSKI The Corner Comedy Club weekly Open Mic Monday Nights at 8PM - 11PM Amateurs, Pros and Room Regulars get up on stage and try out something new! DURATION: 180 MINUTES $5 TICKETS TICKETS AVAILABLE @ thecornercomedy.com SIGN UP E...","time":"8:00 PM – 11:00 PM","location":"The Corner"},{"year":2019,"month":3,"day":8,"title":"33rd Annual World Dentistry Summit","description":"Welcome at the CDE & CPD accredited 33rd Annual World Dentistry Summit | April 08-09, 2019 | Toronto, Canada. The subject of the social occasion is around “Modern dental excellence with compassionate care\"and major highlights are Dentist, Dental, Scaling, Orth...","time":"9:00 AM – 6:00 PM","location":"Holiday Inn"},{"year":2019,"month":3,"day":8,"title":"Affordable Improv for Newbies. Promise you'll leave with the BIGGEST smile","description":"You'll learn to let go and re-discover your playful and creative side It's a chance to be a kid again from speaking gibberish to doing your best impression of your grandma. Spend a few hours with others in a safe space to gradually come out of your shell. No p...","time":"6:30 PM – 9:00 PM","location":"CSI Annex"},{"year":2019,"month":3,"day":8,"title":"Barista Workshop and Introduction to Latte Art","description":"Have you ever wished you could create gourmet coffee beverages like the Barista does at your local coffeehouse? This hands on tasting workshop will teach you the secrets to pulling the perfect shot of Espresso and techniques to help you create mouth watering m...","time":"6:30 PM – 8:30 PM","location":"1690 Queen St W, Toronto, ON M6R 1B3, Canada"},{"year":2019,"month":3,"day":8,"title":"Christine Jakel","description":"Christine Jakel brings her folk/alternative vibes to the Painted Lady. With songs ranging from tales of heartbreak to fun tunes that’ll have you snapping along, listeners can expect to be taken on a journey at her live show.","time":"8:00 PM – 10:00 PM","location":"Painted Lady"},{"year":2019,"month":3,"day":8,"title":"Digital Psychology and Emotional Design Training Week","description":"Upgrade your qualifications and skills, through a series of 3-workshops on how to apply psychology and emotional design neuroscience to websites, apps and digital campaigns.\nPractical design psychology\nOur training is science-based with a focus on practical ap...","time":"9:00 AM – 5:00 PM","location":"193 Augusta Ave"},{"year":2019,"month":3,"day":8,"title":"Focus Group","description":"Join some of Toronto's best improvisers as they watch the strangest, most unintentionally comedic videos the internet has to offer and turn them into the greatest, intentionally comedic scenes they have to offer!\nThis month's cast:\nLisa Amerongen! Conor Bradbu...","time":"9:30 PM – 10:30 PM","location":"Bad Dog Comedy Theatre"},{"year":2019,"month":3,"day":8,"title":"History on Film Series - Operation Finale - 2018 Movie","description":"Director Chris Weitz's historical thriller is based on the story of how a group of Israeli secret agents arrested notorious SS officer Adolf Eichmann - the man who masterminded the \"Final Solution\" - in Argentina. Oscar Isaac plays the legendary Mossad agent P...","time":"6:00 PM – 8:00 PM","location":"Brentwood Library"},{"year":2019,"month":3,"day":8,"title":"ICFF Youth Festival 2019","description":"The ICFF Youth program is aimed at students aged 8-18, and works in close collaboration with the Toronto Catholic District School Board (TCDSB) and York Catholic District School Board (YCDSB), inviting 4000 students from over 40 schools to see unique, challeng...","time":"10:30 AM – 12:30 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":8,"title":"Imperfect Journey, part of the film series Resistance & Revolution: The Cinema of Haile Gerima","description":"Film\nImperfect Journey\nDir. Haile Gerima\n1994 | 88 min\nIn this BBC commissioned film, Haile Gerima and Polish journalist Ryszard Kapuscinski travel around Ethiopia talking to people about their political and psychic recovery of the Ethiopian people after the a...","time":"6:00 PM – 8:00 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":3,"day":8,"title":"Mixology and Bitters 101 at Toronto Botanical Garden","description":"Join Phil and Maria from Kinsip House of Fine Spirits as they walk you through basic techniques of mixology and bitters usage that will have you mixing up cocktails to impress your guests. Learn when to shake and when to stir and how to up your cocktail game!","time":"7:00 PM – 9:00 PM","location":"Toronto Botanical Garden"},{"year":2019,"month":3,"day":8,"title":"Poetry Workshops","description":"April is National Poetry Month! To celebrate, we are hosting two poetry workshops at the Anansi Bookshop.\nThe workshops are for writers of all levels, from first-timers to seasoned artists. We will work with prompts to produce poetry to be shared and taken hom...","time":"6:00 PM – 8:00 PM","location":"House of Anansi Press"},{"year":2019,"month":3,"day":8,"title":"Steve Poudrier","description":"“Steve Poudrier, a Quebec-based artist launching his first art exhibition “Emotions” in Toronto”\nA formal launch of his exhibition will be held on 8th April 2019 ay WAYLA at\nand you can get a glimpse of Steve’s work at\nhttps://stevepoudrierartiste.com/","time":"7:00 PM – 2:00 AM","location":"Wayla"},{"year":2019,"month":3,"day":9,"title":"Ben & Jerry's Free Cone Day 2019","description":"Free Cone Day is coming on April 9th! Since 1979, it’s our way to celebrate and say thanks to our awesome fans for another year of support, and we've kept it up every year since, spreading the peace, love & FREE ice cream around the world! You'd better sta...","time":"11:00 AM – 4:00 PM","location":"Ryerson University"},{"year":2019,"month":3,"day":9,"title":"High Minded: Samsara","description":"It’s legal now. A screening series for the high minded, featuring the biggest-thinking, most visually profound and psychedelic documentary cinema. A trance-inducing and visually intoxicating instant-classic, Samsara takes us to spiritual centres, industrial co...","time":"7:00 PM – 8:42 PM","location":"Hot Docs Ted Rogers Cinema"},{"year":2019,"month":3,"day":9,"title":"Awaken Your Feminine Presence - A Workshop for Women","description":"The Feminine is a source of Strength, Power, & Beauty. In a world so badly and clearly out of balance, we need to make way for the presence of the Feminine in our lives. Many of us women are longing for this. Are you yearning, like me, for a world where the Fe...","time":"7:00 PM – 9:00 PM","location":"Source Centre for Health & Wellness"},{"year":2019,"month":3,"day":9,"title":"Batsheva Dance Company - Venezuela","description":"Batsheva’s Ohad Naharin is known worldwide for his adventurous vision and distinctive choreographic voice. He is widely considered to be one of the great dance pioneers of his generation. Under Naharin’s direction for the past 27 years, Batsheva has become one...","time":"8:00 PM – 10:00 PM","location":"Sony Centre for the Performing Arts"},{"year":2019,"month":3,"day":9,"title":"Boneshaker Reading Series","description":"Authors Michael Fraser and Lillian Necakov read from their work.","time":"7:00 PM – 8:30 PM","location":"Bloor Gladstone Library"},{"year":2019,"month":3,"day":9,"title":"CFE Film Series: Kanehsatake: 270 Years of Resistance","description":"Synopsis:\nIn July 1990, a dispute over a proposed golf course to be built on Kanien’kéhaka (Mohawk) lands in Oka, Quebec, set the stage for a historic confrontation that would grab international headlines and sear itself into the Canadian consciousness. Direct...","time":"7:00 PM – 10:00 PM","location":"Ryerson School of Image Arts"},{"year":2019,"month":3,"day":9,"title":"Copenhagen","description":"Two tiny particles colliding can cause a nuclear reaction. It is 1941, nations race to perfect The Bomb, and two scientists meet in occupied Denmark for a conversation that will change the course of history. Michael Frayn (Noises Off, Democracy) invites us to ...","time":"7:30 PM – 9:30 PM","location":"Young Centre for the Performing Arts"},{"year":2019,"month":3,"day":9,"title":"Film Screening: Yeh Freedom Life/This Freedom Life by Priya Sen","description":"SAVAC is pleased to invite you to attend the screening of Yeh Freedom Life/This Freedom Life, the latest film by Delhi-based filmmaker Priya Sen. Filmed over the course of a year in Ambedkar Nagar, a dense, largely working class area in South Delhi, Yeh Freedo...","time":"7:00 PM – 8:30 PM","location":"Toronto Media Arts Centre"},{"year":2019,"month":3,"day":9,"title":"Intro to Google Analytics","description":"Want to know the secret to making your website better than your competition's? It's not the code, it's not your online marketing, it's not even your design. Successful businesses spend time analyzing their web traffic stats, sources, page performance and so mu...","time":"1:00 PM – 4:00 PM","location":"Camp Tech"},{"year":2019,"month":3,"day":9,"title":"Jewels of India - Designs for a Contemporary World","description":"Celebrate the rich history of adornment in India, and how these and traditional influences translate to modern South-Asian inspired jewelry design with award-winning designer Reena Ahluwalia. Explore the long history of jewellery design in India through the hi...","time":"7:00 PM – 8:00 PM","location":"Royal Ontario Museum"},{"year":2019,"month":3,"day":9,"title":"Lake Ontario Evening on Rouge National Urban Park","description":"A wilderness area in Canada’s largest urban center? That’s right! Only one hour from downtown Toronto, Rouge National Urban Park is an easily accessible wilderness get-away that encompasses wetlands, meadows, mature trees, and historic farms. Join us at this f...","time":"6:00 PM – 8:30 PM","location":"Gladstone Ballroom"},{"year":2019,"month":3,"day":9,"title":"Lee Airton on Gender: Your Guide: A Gender-Friendly Primer on What to Know, What to Say, and What to Do in the New Gender Culture","description":"Join Gender and the Economy Speaker Series at Rotman for a discussion on \"Your Guide: A Gender-Friendly Primer on What to Know, What to Say, and What to Do in the New Gender Culture\" (Adams Media, 2018)\nSPEAKER: Lee Airton, Assistant Professor - Gender and Sex...","time":"5:00 PM – 6:00 PM","location":"Rotman School of Management"},{"year":2019,"month":3,"day":9,"title":"Life Without Basketball","description":"Bilqis Abdul-Qaadir broke records and barriers on her way to becoming the first Division I basketball player to play wearing a hijab. When a controversial ban on religious headgear ends her chances at playing professionally, she is forced to re-examine her fai...","time":"6:30 PM – 8:00 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":9,"title":"Marketing Hall of Legends: A Fireside Chat","description":"The Marketing Hall of Legends was created to honour Canadians who have dedicated their lives to the pursuit of excellence in the field of marketing and to inspire and build marketing leaders as well as future legends. AMA Toronto is broadening the property to ...","time":"5:30 PM – 8:30 PM","location":"Revival"},{"year":2019,"month":3,"day":9,"title":"Mind-Altering Film Screening & live talk with Jordan Peterson & Norman Doidge","description":"Tickets: https://mailchi.mp/d3c603b1642b/film-talk-norman-doidge-jordan-peterson\nABOUT THE DIVIDED BRAIN DOCUMENTARY\nThe Divided Brain is a mind-altering wakeup call that challenges our understanding of how we see the world and ourselves. Renowned psychiatrist...","time":"7:00 PM – 9:30 PM","location":"Isabel Bader Theatre"},{"year":2019,"month":3,"day":9,"title":"#MPAHT Presents: Chelsea's Story","description":"PLEASE JOIN US on Tuesday, April 9th, 2019 at The Westin Harbour Castle, Toronto for a powerful play based on the real experience related to Human Tracking of a 15-year old girl by Sean McGrath F.R.S.A. performed by JM Drama Alumn such as Abbi Longmire.\n📅: Tu...","time":"6:00 PM – 9:00 PM","location":"Westin Harbour Castle"},{"year":2019,"month":3,"day":9,"title":"Pay What You Can't- A Davidson/Woods Spectacular","description":"Well the Day of Finnish Language is coming on April 9th!!! And I for one am #firedup!! And as someone who's never been there nor do I speak the language, but do love me some Angry Birds (the movie not the game), I always celebrate. So I thought why not celebra...","time":"9:30 PM – 11:00 PM","location":"Comedy Bar"},{"year":2019,"month":3,"day":9,"title":"Players' Championship - Pinty's Grand Slam of Curling","description":"The sixth event and final major of the Pinty’s Grand Slam of Curling season returns to Ryerson’s Mattamy Athletic Centre in Toronto running April 9-14, 2019. This marquee tournament features 12 of the top men’s teams and 12 of the top women’s teams from around...","time":"9:00 AM – 10:00 PM","location":"Ryerson's Mattamy Athletic Centre"},{"year":2019,"month":3,"day":9,"title":"PowerPoint Basics 2","description":"Using PowerPoint 2013, learn how to add and edit tables, charts, SmartArt and more. Basic keyboarding and mouse skills required. Register in person at the Information Desk or by calling 416-394-5240.","time":"1:00 PM – 3:00 PM","location":"Brentwood Library"},{"year":2019,"month":3,"day":9,"title":"Self-Publishing: What You Need to Know","description":"This seminar provides aspiring authors with the knowledge they need to successfully navigate the self-publishing world. Gain a solid foundation upon which to evaluate what is being offered, and the company offering it, to make informed decisions.\nWorkshop is r...","time":"6:00 PM – 7:30 PM","location":"Spadina Road Library - Toronto Public Library"},{"year":2019,"month":3,"day":9,"title":"Stand Up, Stand Out! Relationship Marketing in the Digital World!","description":"Women Disrupting Business Presents:\nStand Up, Stand Out!\nRelationship Marketing in a Digital World\nIf you want to build a thriving, sustainable business and get profitable results, you need to build relationships.\nIf you are an entrepreneur, speaker, trainer, ...","time":"9:00 AM – 4:00 PM","location":"Montgomery's Inn"},{"year":2019,"month":3,"day":9,"title":"Swipe Right Night","description":"Join us for Toronto’s most interactive singles club night for young adults. At Swipe Right Night, spend a fun night mingling over DRINKS and APPETIZERS, GAMES, enjoy a hilarious COMEDIAN and then dance the night away to music from a top-40 DJ. We will also hav...","time":"8:00 PM – 12:00 AM","location":"3030 Dundas West"},{"year":2019,"month":3,"day":9,"title":"Tim Moxam Album Release w/ special guest Kelly Sloan","description":"Buy tickets: https://burdockto.com/shows/?show=1835\n$12 in advance, $15 at the door\nDoors at 6 p.m., Show at 6:30 p.m.\n// Tim Moxam\nTim Moxam’s quietly dazzling folk/pop practically begs for adjectives, that is until its mesmerizing mood takes hold. Then the o...","time":"6:00 PM – 8:00 PM","location":"Burdock"},{"year":2019,"month":3,"day":9,"title":"Tinder Tales Celebrates 100 Shows","description":"Tinder Tales is celebrating its 100th Toronto show! Join us at our home base Gladstone Hotel for an evening of (real) ridiculous dating stories from Toronto storytellers and comedians. Hosted by Lori Lane Murphy with:\nMarito Lopez\nEmily Ferrier\nPatrick Fishman...","time":"8:00 PM – 10:00 PM","location":"Gladstone Melody Bar"},{"year":2019,"month":3,"day":10,"title":"The Claypool Lennon Delirium","description":"19+ Event/Valid Photo ID Required Doors - 7:00pm Support: Uni Sale Dates and Times: Public Onsale : Fri, 14 Dec 2018 at 10:00 AM Embrace Presents Presale (19+) : Thu, 13 Dec 2018 at 10:00 AM VIP Package Presale : Wed, 12 Dec 2018 at 10:00 AM VIP Packa...","time":"7:00 PM","location":"The Danforth Music Hall"},{"year":2019,"month":3,"day":10,"title":"163 John St. : DIRTY WEDNESDAY @ THE CORNER","description":"A weekly showcase of some of the dirtiest/uncensored comics in Toronto & It's taking place at the newest, hottest comedy club, THE CORNER! Two shows NOW! @ 8 & 10 PM, comedians credits include Just For Laughs, JFL 42, CBC, Comedy Network + more. Everything Dir...","time":"8:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":3,"day":10,"title":"2019 Drop In Figure Drawing","description":"Come to LucSculpture on Wednesday night, 6:30 pm– 9:30 pm, for a drop-in figure drawing Toronto sessions! We have a different model each week and occationally a special costume event, too. Enjoy the relaxing atmosphere! Drop-in: $20, session passes (12 session...","time":"6:30 PM – 9:30 PM","location":"LucSculpture"},{"year":2019,"month":3,"day":10,"title":"946 QUEEN ST. EAST : THE RENEGADE SHOW @ THE CORNER EAST","description":"Every Wednesday at The Corner Comedy Club EAST, the young killer Kyle Lucey will be hosting THE RENEGADE SHOW! A lineup of Canada’s best comedians showcasing dark and twisted material. Featuring comedians from Just For Laughs, CBC, Sirius XM, and The Comedy Ne...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":3,"day":10,"title":"Battle of the Bands TO","description":"Tickets are now on sale for Battle of the Bands TO, a 1-night fundraising competition, taking place Wednesday, April 10, 2019, at Revival Bar. Performing on the same stage that has welcomed artists such as Justin Timberlake, Black Eyed Peas, Kid Rock, Sara McL...","time":"7:00 PM – 12:00 AM","location":"Revival Bar"},{"year":2019,"month":3,"day":10,"title":"Cover Me Urban","description":"The neighbourhoods of Toronto come to life in an electric celebration of urban sights and sounds in support of the homeless youth at Youth Without Shelter (YWS). Enjoy street foods from around the world prepared by Toronto chefs, as well as wine, beer and stre...","time":"6:30 PM – 10:00 PM","location":"The Rec Room"},{"year":2019,"month":3,"day":10,"title":"Dante Matas and ZINNIA at Burdock","description":"Music starts at 9, $10 cover.\nDante Matas: Dante Matas and his band, The Infernal Racket, are an indie pop group from Toronto. In 2018 they released the album “A Colourful Headache” and toured the east coast of Canada. Live, they combine their melodic, hook-fi...","time":"9:00 PM – 2:00 AM","location":"Burdock"},{"year":2019,"month":3,"day":10,"title":"Draw by Night Toronto","description":"Draw by Night is Toronto's biggest social drawing event and we're hosting a Brain Splittin' party! Come out and join other designers, illustrators and art enthusiasts for a night of drawing, drinks and games.\nYour ticket buys you entry and a free drink at the ...","time":"7:30 PM – 11:00 PM","location":"Station Bar & Kitchen"},{"year":2019,"month":3,"day":10,"title":"Eating Insects Dinner","description":"Welcome back to the new Eating Insects Series. This series has been a work of love, looking for new recipes of how to integrate insects in our diet, getting rid of the Yuk perception of eating insects. I will be preparing for a four-course dinner menu.\nThe men...","time":"6:30 PM – 9:30 PM","location":"Cookie Martinez"},{"year":2019,"month":3,"day":10,"title":"Embiria presents Intro to Calligraphy","description":"Do you want to discover how to do calligraphy for greeting cards or upcoming wedding DIY's? Looking to improve your writing for your planner? Kickstart your new found hobby with this popular class led by the talented Sylvia of @viacalligraphy at the beautiful ...","time":"6:30 PM – 8:30 PM","location":"Drake Commissary"},{"year":2019,"month":3,"day":10,"title":"Excel Basics 1","description":"Learn to open, create and edit a simple table using Microsoft Excel 2013. Basic keyboarding and mouse skills required.\nRegister in person at the Information Desk or by calling 416-394-5240.","time":"6:00 PM – 8:00 PM","location":"Brentwood Library"},{"year":2019,"month":3,"day":10,"title":"Free ANIMATION & DANCE Film Festival - Thur. April 11th, 7pm. Carlton Cinemas","description":"A showcase of the best of Short Films from around the world today: Thursday April 11th. 7pm. Carlton Cinemas in downtown Toronto. Best of ANIMATION & DANCE Short Films.\nAn event for everyone!\nSee the full program and info for each film and filmmaker https://fe...","time":"7:00 PM – 9:00 PM","location":"Carlton Cinemas"},{"year":2019,"month":3,"day":10,"title":"Freelance Finances","description":"Taxes, HST, GST, revenue, expenses...when you work for yourself, your business finances ARE your personal finances, and if you're not careful, things can get very messy!\nThis workshop is where you start to learn how to run your sole-proprietorship finances. Yo...","time":"6:30 PM – 8:00 PM","location":"Beaches Branch, Toronto Public Library"},{"year":2019,"month":3,"day":10,"title":"Hacking Success, Her Way featuring Ann Kaplan Mulholland & Tosca Reno","description":"Project Her Inc. is proud to present Hacking Success, Her Way. This event will give rising women entrepreneurs access to the stories and insights of business powerhouses who have cracked the glass ceiling—with a vengeance. Intimate stories of tragedy and resil...","time":"6:30 PM – 10:00 PM","location":"The Albany Club"},{"year":2019,"month":3,"day":10,"title":"InkWell Workshops - Fiction with Kathy","description":"InkWell Workshops offers free, drop-in creative-writing workshops to people living with mental-health or addictions issues led by award-winning professional writers with lived experience of mental illness. Explore the basics of writing fiction in a fun, relaxe...","time":"2:00 PM – 4:00 PM","location":"Routes Community Centre"},{"year":2019,"month":3,"day":10,"title":"Navigating the Media","description":"Please join Professor Megan Boler (Social Justice Education, OISE/University of Toronto) and the Navigating News Research Team: Andrea Vela Alarcon, Kate Jackson, Gordon Katic, Michael Primrose for an informative and thought provoking discussion. The panel pro...","time":"6:30 PM – 8:00 PM","location":"Diane Frankling Co-operative Homes"},{"year":2019,"month":3,"day":10,"title":"Pink Craft Day","description":"Come to Jones Branch and make a pink t-shirt badge to wear for Pink Day. Show your support for anti bullying on April 11th by wearing your signature pink badge. (no pins involved)","time":"3:30 PM – 5:00 PM","location":"Jones Library"},{"year":2019,"month":3,"day":10,"title":"Rise & Fall of the Gooderham & Worts Empire Whisky Pairing Dinner","description":"Talk Whisky & History with Canadian Whisky Ambassador Spencer Gooderham\nWednesday, April 10\n7:00pm - 9:30pm\n$84 Including Tax & Gratuity\nDelight in a four-course meal prepared by Executive Chef David Caban, inspired by the four grains in whisky production – ba...","time":"7:00 PM – 9:30 PM","location":"Boku Noodle Bar"},{"year":2019,"month":3,"day":10,"title":"Roll Red Roll","description":"“Why didn’t anyone stop it?” Roll Red Roll goes beyond the headlines to unpack the factors that led to a sexual assault at a high-school football party in Steubenville, Ohio, and shaped its aftermath — from peer pressure, victim blaming, and the deeply ingrain...","time":"6:30 PM – 8:00 PM","location":"TIFF Bell Lightbox"},{"year":2019,"month":3,"day":10,"title":"Slime Time! at Albert Campbell District Library","description":"Exciting, free SLIME event for kids at Albert Campbell District Library on Wednesday, April 10 at 4-5pm! Make your own squishy slime to take home! Using safe, grocery store ingredients that we provide, we will make slime and have fun together!\nFor school-age c...","time":"4:00 PM – 5:00 PM","location":"Albert Campbell District Library"},{"year":2019,"month":3,"day":10,"title":"Spring Job Fair","description":"JVS Employment Source Markham is hosting a job fair for full-time and part-time positions in Customer Service, Administration, Technology, Finance, Insurance, Hospitality, Healthcare, Sales, and more!\nOn-site interview with employers like:\n- York University\n- ...","time":"1:30 PM – 3:30 PM","location":"Milliken Mills Library"},{"year":2019,"month":3,"day":10,"title":"Spring Sample Sale","description":"Spring is here! That means it's time for another fantastic sale on designer men's and women's clothing, denim, intimates, sleep and lounge wear and more! Don't miss it!","time":"9:00 AM – 6:00 PM","location":"90 Tycos Drive"},{"year":2019,"month":3,"day":10,"title":"Terrarium Workshop","description":"Design Department has exquisite terrariums and in this class guests will create their own personalized custom terrarium with expert guidance by expert gardener/designer Meredyth Hilton. Sip and tasted too, with beverage and treats!\nIncluded in the class:\n- One...","time":"7:00 PM – 8:30 PM","location":"Design Department"},{"year":2019,"month":3,"day":10,"title":"The Ernestine Affair","description":"Ernestine’s Women’s Shelter would like to welcome you to the 25th annual Ernestine Affair! On April 10, 2019, Ernestine’s will welcome 500 friends and supporters to the annual awards and fundraising gala. The event has grown from a lively but modest badminton ...","time":"6:00 PM – 10:30 PM","location":"The Carlu"},{"year":2019,"month":3,"day":10,"title":"Urban Field Speaker Series: Ivan Navarro","description":"The Chilean artist speaks about the relationship between his sculptural installations and his experience of being raised under the dictatorship of Augusto Pinochet. Moderated by Tamara Toledo, director and curator of Sur Gallery. Presented in partnership with ...","time":"7:00 PM – 9:00 PM","location":"Prefix Institute of Contemporary Art"},{"year":2019,"month":3,"day":10,"title":"Wednesday Afternoon at the Movies: For Your Eyes Only, 1981","description":"Join us for a series of cinematic classics, new releases, foreign films and documentaries.\nApril 10, 2019 showing - For Your Eyes Only (1981) - Agent 007 is assigned to hunt for a lost British encryption device and prevent it from falling into enemy hands. Sta...","time":"2:00 PM – 4:00 PM","location":"Beaches Branch, Toronto Public Library"},{"year":2019,"month":3,"day":10,"title":"YSDN Graduation Showcase","description":"The York University / Sheridan College Program in Design is hosting its annual grad show! YSDN is known for being a leader in Toronto's graphic design programs, and its annual grad show attracts hundreds of visitors each year. This year's show, In Real Life, i...","time":"6:00 PM – 11:00 PM","location":"FREE"},{"year":2019,"month":3,"day":11,"title":"AGO Massive XV","description":"Thursday April 11, 2019 9:00 PM - 1:00 AM Art Gallery of Ontario #AGOMassive AGO Massive is Toronto's ultimate contemporary art party, this year with creative direction by Director X! To celebrate AGO Massive’s 15th year, we are inspired by the anniversary’s t...","time":"9:00 PM – 1:00 AM","location":"Art Gallery of Ontario"},{"year":2019,"month":3,"day":11,"title":"Images Festival 2019","description":"Images showcases artistic excellence in contemporary moving image culture through screenings, exhibitions and performances, providing artists with a supportive forum in which to present their work and make professional connections with the media arts community...","time":"7:00 PM – 11:00 PM","location":"Multiple Venues"},{"year":2019,"month":3,"day":11,"title":"163 JOHN ST. : THURSDAY SURPRISE SHOW @ THE CORNER","description":"PAUL THOMPSON'S SURPRISE SHOW Paul Thompson hosts a surprise line up of special guests. Featuring comics making their first appearance at The Corner as well as comics visiting Toronto from New York, Los Angeles, United Kingdom, and all over the world. TWO SHOW...","time":"8:00 PM – 12:00 AM","location":"The Corner"},{"year":2019,"month":3,"day":11,"title":"401 Art Hunt","description":"Art Hunt, a scavenger hunt is back this year at 401 Richmond! Our building-wide event takes place on Thursday, April 11, 2019 from 5-6pm. Folks will be given a series of clues, taking them around the basement and first floor of the building to discover the sec...","time":"5:00 PM – 7:00 PM","location":"401 Richmond"},{"year":2019,"month":3,"day":11,"title":"946 QUEEN ST. EAST : THE BANANAS SHOW @ THE CORNER EAST","description":"Every Thursday at The Corner Comedy Club EAST, JOEY HARLEM & JEREMY DOBSKI will be hosting THE BANANAS SHOW! A lineup of Canada’s best comedians showcasing their fun and weird material.\nFeaturing comedians from Just For Laughs, CBC, Sirius XM, and The Comedy N...","time":"8:00 PM – 12:00 AM","location":"The Corner East"},{"year":2019,"month":3,"day":11,"title":"Andrea Spaziani's The Right Eye of Clint","description":"A new solo work that deals with notions of the West and with Western film tropes. Choreography & Performance: Andrea Spaziani; Music Score: Matt Smith (aka Prince Nifty); Outside Eye: Danny Grossman. Tickets: $15/$20 on line and at the door","time":"8:00 PM – 9:00 PM","location":"Dancemakers Centre for Creation"},{"year":2019,"month":3,"day":11,"title":"Art Pour","description":"Art Pour is an event for those who enjoy indulging their senses, engaging\ntheir palate, and are intrigued by the art behind hosting and hospitality.\nAttending guests will learn more about what goes into hosting their own dinner party by expanding their knowled...","time":"7:00 PM – 10:00 PM","location":"Jam Factory"},{"year":2019,"month":3,"day":11,"title":"Beer and Cheese Night with BeerXca","description":"Have you ever wondered why beer and cheese taste so good together? Have you ever wanted to learn how to pair them yourself?\nJoin Certified Master Beer Sommeliers® Heather and Maddie from Beerx.ca as they take you on a taste adventure through five Muddy York Br...","time":"7:00 PM – 9:00 PM","location":"Muddy York Brewing Co."},{"year":2019,"month":3,"day":11,"title":"Bon Villan Video Release Party with Most People and Rachel Romu","description":"We're back and thrilled to announce the release of our next single and accompanying video \"All The Way\". To celebrate we're throwing a release party at The Piston April 11th and hope you'll all come party with us. We'll be playing alongside Most People and Rac...","time":"9:00 PM – 1:00 AM","location":"The Piston"},{"year":2019,"month":3,"day":11,"title":"Book Launch, Alexa Conradi's Fear, Love and Liberation in Contemporary Quebec","description":"In response to rapid and unsettling social, economic, and climate changes, fearmongering now features as a main component of public life. Right-wing nationalist populism has become a hallmark of politics around the world. No less so in Quebec. Alexa Conradi ha...","time":"7:00 PM – 9:00 PM","location":"Another Story"},{"year":2019,"month":3,"day":11,"title":"Collage Workshop with Danielle Cole","description":"This is a hands-on workshop where you will be shown strategies for creating collages that are seamlessly built. We will go beyond the glue stick, learning techniques for gluing fine and large pieces of collage without causing the material to bubble or tear. Da...","time":"7:00 PM – 9:30 PM","location":"918 Bathurst St"},{"year":2019,"month":3,"day":11,"title":"Digital Product Management for  Creating and Managing Best-In-Class Products","description":"MUST RSVP THROUGH EVENT PAGE HERE: http://bit.ly/2TxIXqd\nMore than ever before, savvy product management has a huge impact on company success. But what does that entail in the digital economy? Join us as local experts share what it takes to successfully lead p...","time":"6:15 PM – 8:00 PM","location":"BrainStation Toronto"},{"year":2019,"month":3,"day":11,"title":"Emerging Writers Salon","description":"The Hart House Literary and Library Committee invites all emerging writers from any background—especially students—to connect, engage, support, and learn from each other. This year’s salon features talented student writers, and our featured alumna, Doyali Isla...","time":"7:00 PM – 9:30 PM","location":"Hart House"},{"year":2019,"month":3,"day":11,"title":"Four Old Legs","description":"Citadel + Compagnie presents the world premiere of Canadian dance luminary James Kudelka’s Four Old Legs, running April 12-13 & 17-20, 2019 at 8pm, and on April 14 at 4pm, at the Citadel: Ross Centre for Dance. Citadel + Compagnie’s resident choreographer and ...","time":"8:00 PM – 10:00 PM","location":"The Citadel: Ross Centre for Dance"},{"year":2019,"month":3,"day":11,"title":"Free Expression and National Interests: The Case of China","description":"As U.S. cultural influence slips, China is ramping up its use of cultural, educational and diplomatic initiatives to influence and control expression and its image in Canada and elsewhere.\nJoin a panel of experts to explore current Chinese government initiativ...","time":"7:00 PM – 9:00 PM","location":"Ryerson University"},{"year":2019,"month":3,"day":11,"title":"Gardening in the Shade - Toronto Master Gardener Workshop","description":"Say yes! To a lush and lively shade garden: (1) Types of shade and how to identify them; (2) Why shade is an opportunity; (3) Bringing more light into the garden; (4) Improving soil to enhance plant vigor; (5) Choosing the right plants for your garden; (6) Per...","time":"7:00 PM – 8:00 PM","location":"Brentwood Library"},{"year":2019,"month":3,"day":11,"title":"Gianna Lauren and Joshua Van Tassel","description":"Join ambient singer-songwriter Gianna Lauren from Halifax with electro-acoustic composer Joshua Van Tassel for a special evening at Enoch Turner Schoolhouse in Toronto, ON.\nHosted by Enoch Turner Schoolhouse, and booked by Side Door.\nTickets $20.00. Visit the ...","time":"8:00 PM – 10:30 PM","location":"Enoch Turner Schoolhouse"},{"year":2019,"month":3,"day":11,"title":"Great Dramas Series - Madame Bovary - 2014 Movie","description":"Bored in her marriage to a country doctor and stifled by life in a small town, the restless Emma Bovary pursues her dreams of passion and excitement, whatever they may cost.\nBased on the novel by Gustave Flaubert.\n2014 Movie. 118 minutes. Rated 14A. Ratings no...","time":"1:00 PM – 3:00 PM","location":"Brentwood Library"},{"year":2019,"month":3,"day":11,"title":"Healing: A Collection of New Paintings by Sonya Spilkin","description":"“Healing” explores processes of recovery, mending, and regeneration while working through the challenges and celebrating the milestones which accompany them.\nCreated as a response to and as a way of coping with recovery from an accident, Spilkin addresses ways...","time":"7:00 PM – 9:00 PM","location":"Liberty Market Lofts Gallery"},{"year":2019,"month":3,"day":11,"title":"Life - four billion years in the making","description":"Discover the ROM's newest permanent gallery project dedicated to the story of the dawn of life. This new space will bring visitors on a journey from the origin of life itself, close to 4 billion years ago, to the dawn of dinosaurs, roughly 200 million years ag...","time":"11:00 AM – 1:00 PM","location":"Royal Ontario Museum"},{"year":2019,"month":3,"day":11,"title":"Lighthouse Labs Toronto Demo Day","description":"It's time for our new grads to show off what they've learned in just 10 weeks!\nDemo Day is back! Our new Web grads are about to start their careers as professional web developers; but first they want to show you what they've learned to build in just 10 weeks w...","time":"6:00 PM – 8:00 PM","location":"Shopify"},{"year":2019,"month":3,"day":11,"title":"Mindbender Supreme, Ekelle, Peppermint","description":"It's finally here! The official album release party of MINDBENDER Supreme and PEPPERMINT's new double album JOURNEY INTO SOUND: New Colours; New Dimensions; New Values.\nPlease bring your SEXY selves out to a night of innovative live MUSIC and also to celebrate...","time":"9:00 PM – 2:00 AM","location":"Handlebar"},{"year":2019,"month":3,"day":11,"title":"Mockingbird: An Improv Comedy Mockery","description":"Toronto's best improvisers perform in this daring and innovative improv comedy show. Talented and hilarious improvisers recreate and exaggerate an entire long form set, which leads to high energy performances and unexpected moments.","time":"9:30 PM – 10:30 PM","location":"Social Capital Theatre"},{"year":2019,"month":3,"day":11,"title":"PUNK 'TILL YER DRUNK! with DJ Ol' Nerdy Bastard","description":"Punk Rock & Cheap drinks!\n*FREE*","time":"10:00 PM – 2:00 AM","location":"Swan Dive"},{"year":2019,"month":3,"day":11,"title":"Secret RSVP Live-Matched Movies & Travel Singles Games Night","description":"Don't enjoy the awkward, run-of-the-mill speed dating and singles events? Tired of endless swiping dating app games? We don't blame you.\nSecret RSVP, the world's 1ST LIVE-MATCHED singles events experience, launched in Toronto to a sold-out crowd of close to 60...","time":"7:00 PM – 9:30 PM","location":"Firkin on Bloor"},{"year":2019,"month":3,"day":11,"title":"Throwback Thursday","description":"Relive some memories with a night of Throwback Live music with Lynn Moffat and with DJ Sarah Jane Reigler !!\n90\"s and 2000's hits with Fun , food & drinks","time":"8:00 PM – 11:00 PM","location":"Station Bar & Kitchen"},{"year":2019,"month":3,"day":11,"title":"Toast","description":"Toast is the newest cooking class series in Toronto focused on providing a unique and memorable culinary experience. Our master classes educate and entertain, by showcasing classic and modern cuisines. Our professional chefs and mixologists bring a wealth of k...","time":"6:30 PM – 10:30 PM","location":"477 Richmond Street West"},{"year":2019,"month":3,"day":11,"title":"Trials & Tribulations of Growing Tomatoes at Toronto Botanical Garden","description":"Emma Biggs, garden blogging teenager, knows a lot about growing tomatoes. She will discuss how to fit many tomatoes into a small space, ways to prune and train them, and how to start and save seeds. Emma has grown more than 100 tomato varieties and will share ...","time":"7:00 PM – 9:00 PM","location":"Toronto Botanical Garden"},{"year":2019,"month":3,"day":11,"title":"Wonk Prom","description":"Are you a wonk? Do you have a passion for public policy, politics and change-making?\nRyerson Leadership Lab invites you to attend Wonk Prom 2019 and join friends from across the country for a night of networking, music and celebration.\nWhen: Thursday, April 11...","time":"8:30 PM – 12:00 AM","location":"Steam Whistle Brewing"}]}