{"events":[{"title":"Ex Hex","date":"2019-04-07T00:30:00.000Z","endTime":"2019-04-07T03:59:00.000Z","location":"The Horseshoe Tavern","description":"The Horseshoe Tavern Presents Ex Hex Moaning Sunday Apr 7, 2019 Doors: 8:30 PM 19 and over $20 The Horseshoe Tavern  370 Queen Street West  Toronto, ON  Advance tickets also available at Rotate This & Soundscapes "},{"title":"Flipside DJ & Collectors Vintage Record sale","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Gladstone Hotel","description":"FLIPSIDE DJ & Collectors Vintage Vinyl Record Sale SUNDAY - APRIL 7th 2019 Doors open 10am - 4pm (Early Bird 9am) Over 30,000 used vintage records in one room JAZZ , FUNK, SOUL, LATIN, CARIBBEAN, ROCK, LIBRARY HIP-HOP, DISCO, BRAZIL, REGGAE, HOUSE, BRE..."},{"title":"Free Movie & Discussion: The Woman Who Loves Giraffes w/ Guests","date":"2019-04-06T14:30:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Fox Theatre","description":"Join host MP Nathaniel Erskine-Smith for a FREE MOVIE NIGHT. At the Fox Theatre on April 7, 2019 at 10:30 AM WE HAVE ADDED A SECOND SHOWING. SEE SCHEDULE BELOW Our Q&A; discussion will feature advocate and educator Farrah Khan, filmmaker Alison Reid, and..."},{"title":"Middleditch and Schwartz in Toronto","date":"2019-04-06T23:30:00.000Z","endTime":"2019-04-07T03:59:00.000Z","location":"The Danforth Music Hall","description":"Comedians Thomas Middleditch from Silicon Valley and Ben Schwartz of Parks and Recreation have teamed up for a hilarious evening of laughs as they drop by Toronto for the night. All Ages Event  Doors - 5:30pm Sale Dates and Times: Public Onsale : Fri, 14 D..."},{"title":"Toronto Art Crawl SPRING POP UP","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"The Great Hall","description":"Ring in Spring at the Toronto Art Crawl SPRING POP UP, taking place at The Great Hall, Sunday April 7th, 2019! - Shop directly from the hands of 50 SUPER talented local artists and designers, - Choose from original art, fashion, jewelry, home decor, vintage, p..."},{"title":"Toronto R&b Sounds","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T03:00:00.000Z","location":"The Baby G","description":"Join us for a dreamy evening of rare, live performances from Toronto's rising R&B; artists at The Baby G. Here is what previous guests have had to say: \"It was such a beautiful and authentic experience. So inspiring to see all the talented singers/artist. Beyo..."},{"title":"163 John St. : THE DANGER ROOM @ THE CORNER","date":"2019-04-07T01:00:00.000Z","endTime":"2019-04-06T04:00:00.000Z","location":"The Corner","description":"THE DANGER ROOM HOSTS: DAN GUIRY & MORGAN O'SHEA 'The Danger Room' is marathon style show with a variety of professional and amateur comedians testing their most dangerous and explicit material. Audience members are encouraged to boo and heckle comedians durin..."},{"title":"2019-Intuitive Art Workshop","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Luc Sculpture","description":"Unleash your creativity! Let go of your mind and create something uniquely our own. Natasha will lead you through some warmups and visualizations to awaken your senses and then you will immerse yourself in painting. This will be a safe and supportive environme..."},{"title":"2019 Partner Dance Classes","date":"2019-04-06T22:00:00.000Z","endTime":"2019-04-07T00:00:00.000Z","location":"Lucsculpture","description":"Sunday Evenings 6-8 Enjoy a casual night of partner dancing! Each week will cater to teaching you the fundamentals of basic Ballroom & partner dancing, introducing a different style each week. These classes are for beginners & will break down the techniques an..."},{"title":"2019 SOL Yoga for CLearing away the old & making way for the New","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T18:00:00.000Z","location":"LucSculpture","description":"Select SUndays from April 7-June 23 Check Link for exact dates class starts 1pm-2:15 This is a classic Asana class, that is designed to get your body moving, increase flexibility, release tension (especially in the upper back, shoulders, and legs), improving c..."},{"title":"2019 Swimming Trials Afterparty","date":"2019-04-07T02:30:00.000Z","endTime":"2019-04-06T06:00:00.000Z","location":"Tequila Jacks","description":"Hey Torontonians, This year the Canadian Swimming Nationals will be held here in Toronto and you know what that means? A massive party afterwards!!! Come get down with world class athletes and Olympians 🎉 We are going to be hosting an Afterparty at Tequila Ja..."},{"title":"946 QUEEN ST. EAST : SUNDAY BEST @ THE CORNER EAST","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-06T04:00:00.000Z","location":"The Corner East","description":"Every Sunday at The Corner Comedy Club EAST, TAMARA SHEVON will be hosting SUNDAY BEST! A lineup of Canada’s best comedians. There's gonna be 2 shows, 8PM & 10PM, each with a different set of comics. Credits include Just For Laughs, JFL 42, CBC, Comedy Network..."},{"title":"AMAZE - a night of magic and mystery featuring The Sentimentalists","date":"2019-04-06T23:30:00.000Z","endTime":"2019-04-07T02:30:00.000Z","location":"The Rec Room","description":"Welcome to Amaze - the first magic and mentalism night at The Rec Room of its kind. Join world-renowned mentalists The Sentimentalists, stars and foolers of Penn & Teller’s Fool Us, accompanied by the up-and-coming duo of Beyond Mental Borders, and The Wandere..."},{"title":"And a Scotch Egg - Magic, Monsters, & The Occult","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-07T00:30:00.000Z","location":"Comedy Bar","description":"And a Scotch Egg is everything you love about British comedy panel shows, brought to you live on stage at Comedy Bar! This month Team Cultist will face off against Team Cryptid in a battle of wit and wisdom to see who gets to bring about the end of the world! ..."},{"title":"Aries New Moon Cacao Ceremony Soundbath Meditation","date":"2019-04-06T23:30:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"The House of Yoga","description":"Let us journey into a night of Sacred Cacao, Sound Healing and intentional meditation as we work with the energy of the New Moon in Aries and plant our seeds for the coming lunar cycle. New moons are potent times to shed the old, plant seeds of the new and man..."},{"title":"Arts & Culture Volunteer Fair","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"Harbourfront Centre","description":"Interested in volunteering? Join us to learn about arts and cultural organizations looking for people just like YOU! Are you interested in building your resume, creating professional contacts or meeting new & interesting people? Then volunteering within Toront..."},{"title":"Bart // Mother Tongues / Carinae","date":"2019-04-07T01:00:00.000Z","endTime":"2019-04-06T04:00:00.000Z","location":"Monarch Tavern","description":"Sunday, April 7 @ Monarch Tavern... Bart (Idée Fixe Records) > https://www.youtube.com/watch?v=wYMKZghkWls Mother Tongues (Buzz Records) > https://exclaim.ca/music/article/mother_tongues_sign_to_buzz_records_share_new_single Carinae (Hadley.MA) > https://ca..."},{"title":"Beaches Life 2nd Annual Wellness & Beauty Show","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Ashbridge's Bay Yacht Club","description":"Come and meet local business owners face-to-face, discover the wide range of Wellness & Beauty products they offer and get a personal consultation. The Event features live demonstrations and fashion shows. Free admission. Free parking."},{"title":"Between Worlds","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T19:30:00.000Z","location":"Innis Town Hall","description":"Presented by Toronto Jewish Film Society. A quiet understated Israeli drama that challenges our notions of faith, truth, understanding and, possibly, acceptance. Tickets: $15, $10 for ages 18-35."},{"title":"Black Sheep Comedy's Stand Up @ People's Pint Brewing Company, April Edition","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-07T01:30:00.000Z","location":"People's Pint Brewing Company","description":"Join Black Sheep Comedy @ People's Pint for the best stand-up comedy show and craft beer in The Junction! Sip a complimentary 12oz beer while watching an insanely talented lineup. Headliner Jeff Elliott! As seen on CBC’s Winnipeg andHalifax Comedy Festivals, I..."},{"title":"Blood Simple","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"The Royal Cinema","description":"Join The Royal Cinema for a 35th Anniversary screening of Joel and Ethan Coen's BLOOD SIMPLE \"There are debut features, and there are throw downs. Every couple of years you get your ALIEN 3, and every couple of decades you get your CITIZEN KANEs. Obviously, ..."},{"title":"Blues Sunday in April w The Jerome Tucker Band at the Linsmore Tavern!","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-06T04:00:00.000Z","location":"Linsmore Tavern","description":"The first Sunday of the month is April 7th and every first Sunday of the Month, the Linsmore Tavern's, Molson Canadian Sponsored, Blues Sunday Series features the Jerome Tucker Band! If you have not seen Jerome Tucker and his amazing band before, make sure you..."},{"title":"Celebrate your love with Toronto Bridal Brunch","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"The Globe and Mail Centre","description":"Celebrate your love with your #bridalsquad at Toronto’s one of a kind luxury bridal show and brunch. Join us on Sunday, April 7th, 2019 at The Globe and Mail Centre from 10 a.m. to 3 p.m. for an unforgettable day of mingling, brunching, and celebratory snapsho..."},{"title":"Colin Fowlie - Party Music Release show","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T03:00:00.000Z","location":"Painted Lady","description":"Colin is releasing his full length album \"party music'! Colin strives for lyrical depth and compelling stories in his songs, fusing elements of folk, rock, blues, and Americana/Canadiana. Brooklyn Doran at 8:00 PM Claire Coupland Music at 9:PM Colin Fowlie at ..."},{"title":"Dinosaurs for Grown-Ups","date":"2019-04-06T14:30:00.000Z","endTime":"2019-04-06T19:30:00.000Z","location":"ROM","description":"Do you ever feel like the kids in your life know more about T. rex and Triceratops than you do? Discover the basics of dinosaurs, evolution, and fossils with ROM Educator Kelly Hodgins in this full-day workshop where you will explore the James and Louise Temer..."},{"title":"Diverse Dishes","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-07T01:00:00.000Z","location":"Kitchen 24","description":"Diverse Dishes is a cooking event, hosting unique cooking classes in Toronto. The event will take place on April 7th, 2019 at Kitchen 24 in North York, Toronto. This event is for those who are curious about cooking and always strive to learn more about what co..."},{"title":"DIY Natural Deodorant Workshop by Make This Universe","date":"2019-04-06T16:00:00.000Z","endTime":"2019-04-06T19:00:00.000Z","location":"Milk Glass Co.","description":"Ever wanted to make your own DIY Skincare products at home, but not sure where to start? Trying to transition to a Zero Waste lifestyle by creating your own natural deodorant, but can't find the right ingredients? Or, are you just tired of trying natural deodo..."},{"title":"Douglas Fairbanks: When the Clouds Roll By","date":"2019-04-06T19:15:00.000Z","endTime":"2019-04-06T21:30:00.000Z","location":"Royal Cinema","description":"Toronto Silent Film Festival -Day 3 It's the 100th anniversary of the founding of United Artists so a celebration of one of the founders, Douglas Fairbanks is in order! We’re all familiar with the classic image of Douglas Fairbanks as the swashbuckling hero of..."},{"title":"Etobicoke Beer Run","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Big Rock Brewery","description":"WHEN DOES THE EVENT START? Come join us for a pre-race warmup at 11:00am but the first wave pre-party starts at 11:10am! WHERE DO I START THIS BEER RUN THING?! Don’t worry we got you covered! Put it into your GPS so you can get there on time! Yeah! Big..."},{"title":"in/progress magazine launch","date":"2019-04-06T19:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"University College","description":"Join us for the launch of in/progress, an arts-literary based magazine. Our magazine is a platform for sharing creative narratives. Through artworks, poetry, and short-story, we explore our current expressions of art-making and reveal the unique memories, hist..."},{"title":"JARRED DUNN: The Art of the Piano","date":"2019-04-06T23:30:00.000Z","endTime":"2019-04-07T01:30:00.000Z","location":"Gallery 345","description":"The Art of the Piano: Jarred Dunn Sunday, April 7, 2019 at 7:30 pm Tickets: $25/$10 Student (Cash only at the door) Reserve tickets at info@gallery345.com Purchase advance tickets on Eventbrite Program Beethoven Sonata Op. 110 Chopin Nocturne Op. 48 nr. 1 Chop..."},{"title":"Job search workshop","date":"2019-04-06T16:30:00.000Z","endTime":"2019-04-06T17:45:00.000Z","location":"Make Lemonade","description":"Learn how to connect to your dream job and stop dreading Mondays! Workshop will take place at Make Lemonade - 326 Adelaide St W on Sunday, April 7th 2019 at 12:30pm. Buy your tickets here: https://www.eventbrite.ca/e/job-search-workshop-tickets-58617457393"},{"title":"Jodhpur Kingdom: Gender, Class and Caste","date":"2019-04-06T14:30:00.000Z","endTime":"2019-04-06T19:30:00.000Z","location":"ROM","description":"Examine the socio-cultural realities of gender, class and caste depicted in the spectacular royal arts of Jodhpur, Rajasthan. From gendered architecture and elaborate furniture to textiles and jewellery, find out who would have made and used these objects. How..."},{"title":"Kids Workshop: Italian Easter Bread Making","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T15:30:00.000Z","location":"Cucinato Studio","description":"Easter egg painting, bread to take home, hot chocolate and LOTS of fun!! Your little chef will learn how to make their very own traditional Italian Easter Bread! Also known as Pane di Pasqua, this fluffy and eggy bread is served during Easter time in Italian c..."},{"title":"LEGENDS OF TIME: Exhibition and Sale of Paintings By Oleh Nedoshytko","date":"2019-04-06T18:30:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Taras Shevchenko Museum","description":"The Taras Shevchenko Museum is pleased to announce Legends of Time –an exhibition and sale of paintings by the Ukrainian artist, Oleh Nedoshytko, who will introduce over 20 of his recent works. Opening with a reception on Sunday, April 7, 2019 from 2:30 to 5:3..."},{"title":"National Initiative for Eating Disorders 7th Annual Honouring the Journey Event","date":"2019-04-06T19:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Adath Isreal Congregation","description":"Join NIED for our 7th Annual 'Honouring the Journey' event. This event is dedicated to inspiring, honouring, commemorating, and celebrating caregivers. Our panel of caregivers will share their experiences of grappling, wrestling, caring, and loving their loved..."},{"title":"Nite Comfort: Syngja, Spectral Tambours","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T03:30:00.000Z","location":"Handlebar","description":"This episode brings an exciting visit from Montréalers Syngja, and a beautiful new ambient percussion/concrete project from Robin Buckley and Jakob Thiesen, Spectral Tambours. SYNGJA 10pm Experimental and psychedelic, Syngja’s music is both haunting and timele..."},{"title":"Photography Workshop for Women","date":"2019-04-06T13:00:00.000Z","endTime":"2019-04-06T16:00:00.000Z","location":"Lovt Studio","description":"Do you have a camera and have no idea where to start? This workshop is an intensive on how to use your DSLR, designed for true beginners! So you shoot on Automatic, and want to learn how to use the Manual settings but feel overwhelmed on where to even start an..."},{"title":"Puppy Love Yoga","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T15:00:00.000Z","location":"The Redwood Studio","description":"It's Yoga with puppies! We provide the puppies and mats and you help socialize the little guys. Special GROUP DISCOUNT. Book at least 4 spots and enter code TEN at checkout for 10% OFF. Because puppies!"},{"title":"PupsYoga Classes","date":"2019-04-06T14:00:00.000Z","endTime":"2019-04-06T17:30:00.000Z","location":"PupsYoga Toronto","description":"Whether you’re a beginner or an experienced yogi, you’ll find our PupsYoga classes are the best way to relieve stress and get a dose of pure love from our little puppies. An experienced instructor will guide you through a relaxing yoga session while our puppie..."},{"title":"Rayannah & Ponteix : Album Release","date":"2019-04-07T00:00:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"Small World Music Centre","description":"Western Canadian francophone artists Rayannah (MB) and Ponteix (SK) will share three tour dates this spring to celebrate the release of their respective albums, “Nos repaires (Our Haunts)” and “Bastion”. The Trille Or-nominated acts will present their latest l..."},{"title":"Richard Goode","date":"2019-04-06T19:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"Koerner Hall","description":"“It is virtually impossible to walk away from one of Mr. Goode’s recitals without the sense of having gained some new insight, subtle or otherwise, into the works he played or about pianism itself.” (The New York Times) Richard Goode will perform an all Ludwig..."},{"title":"Sistema Spirit Gala","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-07T02:00:00.000Z","location":"The Spoke Club","description":"The Sistema Spirit Gala is a party and fundraiser featuring amazing live music from jazz and world musicians Neil Brathwaite and Ruth Mathiang. Ticket price includes music, food, and beverages and 100% of the proceeds support bringing more students into Sistem..."},{"title":"Skinner's Dress Suit","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T18:40:00.000Z","location":"Royal Cinema","description":"Toronto Silent Film Festival continues with the newly restored by Universal Pictures, this Rom-Com is a snappy comedy of errors, delightfully brimming with wit and sass that puts it right up there with the best. Reginald Denny & Laura La Plante richly deserved..."},{"title":"Spring has sprung at Hillcrest with Spring Sweets Pop-up Market","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T23:00:00.000Z","location":"Hillcrest - Centre Court","description":"Hillcrest’s Centre Court will blossom into a spring spectacle on April 6 and 7 with its Spring Sweets pop-up market. It will feature 12 food vendors providing visitors with a sweet experience. Vendors include All you Knead, Paletta America, Vapz Tastebudz, Ros..."},{"title":"Sweat & Sip with Camp Fuel","date":"2019-04-06T18:30:00.000Z","endTime":"2019-04-06T20:30:00.000Z","location":"Elle Fitness","description":"Sweat, sip & be social! We'll Hiit it up with a super sweaty fitness class and then hang around after, get to know each other over beer provided by Glutenberg Beer & Temple Vodka. Your sweat session will be a full body workout. We'll bounce between strength tr..."},{"title":"Tassles & Tea: Create Your Own Pasties!","date":"2019-04-06T22:00:00.000Z","endTime":"2019-04-06T23:30:00.000Z","location":"Kink Toronto","description":"Interested in a crafternoon of breast positivity and sassy pasties? Get your craft on during this Make Your Own Nipple Pasties workshop. Luna Matatas will walk you through designing, creating and applying pasties. You'll make up to two pairs of pasties to take..."},{"title":"The Cleaners","date":"2019-04-06T20:00:00.000Z","endTime":"2019-04-06T21:30:00.000Z","location":"TIFF Bell Lightbox","description":"Viewers meet five “digital scavengers,” among thousands of people outsourced by Silicon Valley companies, whose job is to delete “inappropriate” web content. A typical cleaner must observe and rate thousands of often deeply disturbing images and videos every d..."},{"title":"The Femme! Experience","date":"2019-04-06T18:30:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Dancemakers","description":"House of Joy presents the Femme! Experience - a 90-minute fusion movement class. * Honour your sexy soulfulness * Unleash yourself to the sounds of live djembe drumming by Walter Maclean * Explore movement as a form of creativity, celebration, self-expression ..."},{"title":"The Song Shul's first Women's Seder","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Rinx Entertainment Centre","description":"The Song Shul's Women's Seder Aliza Spiro leads Toronto’s first WOMEN’S SEDER, shining new light on the Pesach experience. Not a “Feminist Seder” — it’s a Women’s Seder! Song-filled and jam-packed with exciting insights about the contribution of women to the s..."},{"title":"Toronto Arrows Rugby Football Club's First Official Home Game","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T21:00:00.000Z","location":"York Alumni Stadium","description":"The Toronto Arrows Rugby Club, Canada’s first professional rugby union team was added to Major League Rugby for the 2019 season. Come watch the Toronto Arrows first home game and cheer them on as they play against the Nola Gold Rugby team."},{"title":"Toronto Homeless Outreach","date":"2019-04-06T15:00:00.000Z","endTime":"2019-04-06T17:00:00.000Z","location":"Canadian Tire at Bay St and Dundas St W","description":"Rallying all citizens of Toronto! Have fun and help out Toronto's homeless while meeting like-minded Torontonians followed by a group lunch at Yonge and Dundas! We will be meeting at Canadian Tire at 65 Dundas St W, at 11:00 AM on Sunday April 7 to purchase gi..."},{"title":"Toronto Lettering Crew 2019 Meetup","date":"2019-04-06T17:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"Paper Plus Cloth","description":"Lettering Lovers! - Join us April 7th for the first TLC Meetup of the year! Spring is slowly making its way in and what better way to celebrate than a meetup with fellow creatives? We are excited to be hosting TLC @torontoletteringcrew first meetup of the year..."},{"title":"Tristana & Ashtanga Yoga Fundamentals Workshop","date":"2019-04-06T05:00:00.000Z","endTime":"2019-04-06T20:00:00.000Z","location":"The Basement Yoga & Fitness Studio","description":"Sunday, April 7, 1- 4pm Tristana and Ashtanga Yoga Fundamentals Workshop with Mark Morra The foundation of Ashtanga Yoga was described in Yoga Mala by PattabhiJois as Tristana: Breath, Asana, and Dristi. When practiced simultaneously, Ashtanga becomes a moving..."},{"title":"Unclutter Emotions with Master Teresa","date":"2019-04-06T18:00:00.000Z","endTime":"2019-04-06T19:30:00.000Z","location":"New Age Healing Centre","description":"Rare opportunity to experience group Chi healing with Master Teresa with over 20 years experience. She will demonstrate how to practice Chi Gong; how to project Chi and balance your emotions. She has special ability to scan and read your from a distance. So th..."},{"title":"WrestleMania 35 Viewing Party with Dinner!","date":"2019-04-06T22:00:00.000Z","endTime":"2019-04-07T03:59:00.000Z","location":"Law Office of Caryma Sa'd","description":"Are you ready for the most important wrestling event of the year? Come join us at the Law Office of Caryma Sa’d Downtown Toronto. We are hosting a private event with DINNER BUFFET. (including non-alcoholic drinks) WrestleMania 35 will be the thirty-fifth annua..."},{"title":"YOUTHSing! 2019: Sure on this Shining Night","date":"2019-04-06T23:00:00.000Z","endTime":"2019-04-07T01:30:00.000Z","location":"Eglinton St. George's United Church","description":"The Toronto Youth Choir is excited to host YOUTHSing 2019, with guest clinician and composer Dr. Cristian Grases. Join us at 7PM for an inspiring concert featuring youth choirs from across the GTA, including Bach Chamber Youth Choir, Mississauga Festival Choir..."},{"title":"Ex Hex","date":"2019-04-08T00:30:00.000Z","endTime":"2019-04-08T03:59:00.000Z","location":"The Horseshoe Tavern","description":"The Horseshoe Tavern Presents Ex Hex Moaning Sunday Apr 7, 2019 Doors: 8:30 PM 19 and over $20 The Horseshoe Tavern  370 Queen Street West  Toronto, ON  Advance tickets also available at Rotate This & Soundscapes "},{"title":"Flipside DJ & Collectors Vintage Record sale","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Gladstone Hotel","description":"FLIPSIDE DJ & Collectors Vintage Vinyl Record Sale SUNDAY - APRIL 7th 2019 Doors open 10am - 4pm (Early Bird 9am) Over 30,000 used vintage records in one room JAZZ , FUNK, SOUL, LATIN, CARIBBEAN, ROCK, LIBRARY HIP-HOP, DISCO, BRAZIL, REGGAE, HOUSE, BRE..."},{"title":"Free Movie & Discussion: The Woman Who Loves Giraffes w/ Guests","date":"2019-04-07T14:30:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Fox Theatre","description":"Join host MP Nathaniel Erskine-Smith for a FREE MOVIE NIGHT. At the Fox Theatre on April 7, 2019 at 10:30 AM WE HAVE ADDED A SECOND SHOWING. SEE SCHEDULE BELOW Our Q&A; discussion will feature advocate and educator Farrah Khan, filmmaker Alison Reid, and..."},{"title":"Middleditch and Schwartz in Toronto","date":"2019-04-07T23:30:00.000Z","endTime":"2019-04-08T03:59:00.000Z","location":"The Danforth Music Hall","description":"Comedians Thomas Middleditch from Silicon Valley and Ben Schwartz of Parks and Recreation have teamed up for a hilarious evening of laughs as they drop by Toronto for the night. All Ages Event  Doors - 5:30pm Sale Dates and Times: Public Onsale : Fri, 14 D..."},{"title":"Toronto Art Crawl SPRING POP UP","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"The Great Hall","description":"Ring in Spring at the Toronto Art Crawl SPRING POP UP, taking place at The Great Hall, Sunday April 7th, 2019! - Shop directly from the hands of 50 SUPER talented local artists and designers, - Choose from original art, fashion, jewelry, home decor, vintage, p..."},{"title":"Toronto R&b Sounds","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T03:00:00.000Z","location":"The Baby G","description":"Join us for a dreamy evening of rare, live performances from Toronto's rising R&B; artists at The Baby G. Here is what previous guests have had to say: \"It was such a beautiful and authentic experience. So inspiring to see all the talented singers/artist. Beyo..."},{"title":"163 John St. : THE DANGER ROOM @ THE CORNER","date":"2019-04-08T01:00:00.000Z","endTime":"2019-04-07T04:00:00.000Z","location":"The Corner","description":"THE DANGER ROOM HOSTS: DAN GUIRY & MORGAN O'SHEA 'The Danger Room' is marathon style show with a variety of professional and amateur comedians testing their most dangerous and explicit material. Audience members are encouraged to boo and heckle comedians durin..."},{"title":"2019-Intuitive Art Workshop","date":"2019-04-07T17:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Luc Sculpture","description":"Unleash your creativity! Let go of your mind and create something uniquely our own. Natasha will lead you through some warmups and visualizations to awaken your senses and then you will immerse yourself in painting. This will be a safe and supportive environme..."},{"title":"2019 Partner Dance Classes","date":"2019-04-07T22:00:00.000Z","endTime":"2019-04-08T00:00:00.000Z","location":"Lucsculpture","description":"Sunday Evenings 6-8 Enjoy a casual night of partner dancing! Each week will cater to teaching you the fundamentals of basic Ballroom & partner dancing, introducing a different style each week. These classes are for beginners & will break down the techniques an..."},{"title":"2019 SOL Yoga for CLearing away the old & making way for the New","date":"2019-04-07T17:00:00.000Z","endTime":"2019-04-07T18:00:00.000Z","location":"LucSculpture","description":"Select SUndays from April 7-June 23 Check Link for exact dates class starts 1pm-2:15 This is a classic Asana class, that is designed to get your body moving, increase flexibility, release tension (especially in the upper back, shoulders, and legs), improving c..."},{"title":"2019 Swimming Trials Afterparty","date":"2019-04-08T02:30:00.000Z","endTime":"2019-04-07T06:00:00.000Z","location":"Tequila Jacks","description":"Hey Torontonians, This year the Canadian Swimming Nationals will be held here in Toronto and you know what that means? A massive party afterwards!!! Come get down with world class athletes and Olympians 🎉 We are going to be hosting an Afterparty at Tequila Ja..."},{"title":"946 QUEEN ST. EAST : SUNDAY BEST @ THE CORNER EAST","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-07T04:00:00.000Z","location":"The Corner East","description":"Every Sunday at The Corner Comedy Club EAST, TAMARA SHEVON will be hosting SUNDAY BEST! A lineup of Canada’s best comedians. There's gonna be 2 shows, 8PM & 10PM, each with a different set of comics. Credits include Just For Laughs, JFL 42, CBC, Comedy Network..."},{"title":"AMAZE - a night of magic and mystery featuring The Sentimentalists","date":"2019-04-07T23:30:00.000Z","endTime":"2019-04-08T02:30:00.000Z","location":"The Rec Room","description":"Welcome to Amaze - the first magic and mentalism night at The Rec Room of its kind. Join world-renowned mentalists The Sentimentalists, stars and foolers of Penn & Teller’s Fool Us, accompanied by the up-and-coming duo of Beyond Mental Borders, and The Wandere..."},{"title":"And a Scotch Egg - Magic, Monsters, & The Occult","date":"2019-04-07T23:00:00.000Z","endTime":"2019-04-08T00:30:00.000Z","location":"Comedy Bar","description":"And a Scotch Egg is everything you love about British comedy panel shows, brought to you live on stage at Comedy Bar! This month Team Cultist will face off against Team Cryptid in a battle of wit and wisdom to see who gets to bring about the end of the world! ..."},{"title":"Aries New Moon Cacao Ceremony Soundbath Meditation","date":"2019-04-07T23:30:00.000Z","endTime":"2019-04-08T02:00:00.000Z","location":"The House of Yoga","description":"Let us journey into a night of Sacred Cacao, Sound Healing and intentional meditation as we work with the energy of the New Moon in Aries and plant our seeds for the coming lunar cycle. New moons are potent times to shed the old, plant seeds of the new and man..."},{"title":"Arts & Culture Volunteer Fair","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T19:00:00.000Z","location":"Harbourfront Centre","description":"Interested in volunteering? Join us to learn about arts and cultural organizations looking for people just like YOU! Are you interested in building your resume, creating professional contacts or meeting new & interesting people? Then volunteering within Toront..."},{"title":"Bart // Mother Tongues / Carinae","date":"2019-04-08T01:00:00.000Z","endTime":"2019-04-07T04:00:00.000Z","location":"Monarch Tavern","description":"Sunday, April 7 @ Monarch Tavern... Bart (Idée Fixe Records) > https://www.youtube.com/watch?v=wYMKZghkWls Mother Tongues (Buzz Records) > https://exclaim.ca/music/article/mother_tongues_sign_to_buzz_records_share_new_single Carinae (Hadley.MA) > https://ca..."},{"title":"Beaches Life 2nd Annual Wellness & Beauty Show","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Ashbridge's Bay Yacht Club","description":"Come and meet local business owners face-to-face, discover the wide range of Wellness & Beauty products they offer and get a personal consultation. The Event features live demonstrations and fashion shows. Free admission. Free parking."},{"title":"Between Worlds","date":"2019-04-07T18:00:00.000Z","endTime":"2019-04-07T19:30:00.000Z","location":"Innis Town Hall","description":"Presented by Toronto Jewish Film Society. A quiet understated Israeli drama that challenges our notions of faith, truth, understanding and, possibly, acceptance. Tickets: $15, $10 for ages 18-35."},{"title":"Black Sheep Comedy's Stand Up @ People's Pint Brewing Company, April Edition","date":"2019-04-07T23:00:00.000Z","endTime":"2019-04-08T01:30:00.000Z","location":"People's Pint Brewing Company","description":"Join Black Sheep Comedy @ People's Pint for the best stand-up comedy show and craft beer in The Junction! Sip a complimentary 12oz beer while watching an insanely talented lineup. Headliner Jeff Elliott! As seen on CBC’s Winnipeg andHalifax Comedy Festivals, I..."},{"title":"Blood Simple","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T02:00:00.000Z","location":"The Royal Cinema","description":"Join The Royal Cinema for a 35th Anniversary screening of Joel and Ethan Coen's BLOOD SIMPLE \"There are debut features, and there are throw downs. Every couple of years you get your ALIEN 3, and every couple of decades you get your CITIZEN KANEs. Obviously, ..."},{"title":"Blues Sunday in April w The Jerome Tucker Band at the Linsmore Tavern!","date":"2019-04-07T23:00:00.000Z","endTime":"2019-04-07T04:00:00.000Z","location":"Linsmore Tavern","description":"The first Sunday of the month is April 7th and every first Sunday of the Month, the Linsmore Tavern's, Molson Canadian Sponsored, Blues Sunday Series features the Jerome Tucker Band! If you have not seen Jerome Tucker and his amazing band before, make sure you..."},{"title":"Celebrate your love with Toronto Bridal Brunch","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T19:00:00.000Z","location":"The Globe and Mail Centre","description":"Celebrate your love with your #bridalsquad at Toronto’s one of a kind luxury bridal show and brunch. Join us on Sunday, April 7th, 2019 at The Globe and Mail Centre from 10 a.m. to 3 p.m. for an unforgettable day of mingling, brunching, and celebratory snapsho..."},{"title":"Colin Fowlie - Party Music Release show","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T03:00:00.000Z","location":"Painted Lady","description":"Colin is releasing his full length album \"party music'! Colin strives for lyrical depth and compelling stories in his songs, fusing elements of folk, rock, blues, and Americana/Canadiana. Brooklyn Doran at 8:00 PM Claire Coupland Music at 9:PM Colin Fowlie at ..."},{"title":"Dinosaurs for Grown-Ups","date":"2019-04-07T14:30:00.000Z","endTime":"2019-04-07T19:30:00.000Z","location":"ROM","description":"Do you ever feel like the kids in your life know more about T. rex and Triceratops than you do? Discover the basics of dinosaurs, evolution, and fossils with ROM Educator Kelly Hodgins in this full-day workshop where you will explore the James and Louise Temer..."},{"title":"Diverse Dishes","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-08T01:00:00.000Z","location":"Kitchen 24","description":"Diverse Dishes is a cooking event, hosting unique cooking classes in Toronto. The event will take place on April 7th, 2019 at Kitchen 24 in North York, Toronto. This event is for those who are curious about cooking and always strive to learn more about what co..."},{"title":"DIY Natural Deodorant Workshop by Make This Universe","date":"2019-04-07T16:00:00.000Z","endTime":"2019-04-07T19:00:00.000Z","location":"Milk Glass Co.","description":"Ever wanted to make your own DIY Skincare products at home, but not sure where to start? Trying to transition to a Zero Waste lifestyle by creating your own natural deodorant, but can't find the right ingredients? Or, are you just tired of trying natural deodo..."},{"title":"Douglas Fairbanks: When the Clouds Roll By","date":"2019-04-07T19:15:00.000Z","endTime":"2019-04-07T21:30:00.000Z","location":"Royal Cinema","description":"Toronto Silent Film Festival -Day 3 It's the 100th anniversary of the founding of United Artists so a celebration of one of the founders, Douglas Fairbanks is in order! We’re all familiar with the classic image of Douglas Fairbanks as the swashbuckling hero of..."},{"title":"Etobicoke Beer Run","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Big Rock Brewery","description":"WHEN DOES THE EVENT START? Come join us for a pre-race warmup at 11:00am but the first wave pre-party starts at 11:10am! WHERE DO I START THIS BEER RUN THING?! Don’t worry we got you covered! Put it into your GPS so you can get there on time! Yeah! Big..."},{"title":"in/progress magazine launch","date":"2019-04-07T19:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"University College","description":"Join us for the launch of in/progress, an arts-literary based magazine. Our magazine is a platform for sharing creative narratives. Through artworks, poetry, and short-story, we explore our current expressions of art-making and reveal the unique memories, hist..."},{"title":"JARRED DUNN: The Art of the Piano","date":"2019-04-07T23:30:00.000Z","endTime":"2019-04-08T01:30:00.000Z","location":"Gallery 345","description":"The Art of the Piano: Jarred Dunn Sunday, April 7, 2019 at 7:30 pm Tickets: $25/$10 Student (Cash only at the door) Reserve tickets at info@gallery345.com Purchase advance tickets on Eventbrite Program Beethoven Sonata Op. 110 Chopin Nocturne Op. 48 nr. 1 Chop..."},{"title":"Job search workshop","date":"2019-04-07T16:30:00.000Z","endTime":"2019-04-07T17:45:00.000Z","location":"Make Lemonade","description":"Learn how to connect to your dream job and stop dreading Mondays! Workshop will take place at Make Lemonade - 326 Adelaide St W on Sunday, April 7th 2019 at 12:30pm. Buy your tickets here: https://www.eventbrite.ca/e/job-search-workshop-tickets-58617457393"},{"title":"Jodhpur Kingdom: Gender, Class and Caste","date":"2019-04-07T14:30:00.000Z","endTime":"2019-04-07T19:30:00.000Z","location":"ROM","description":"Examine the socio-cultural realities of gender, class and caste depicted in the spectacular royal arts of Jodhpur, Rajasthan. From gendered architecture and elaborate furniture to textiles and jewellery, find out who would have made and used these objects. How..."},{"title":"Kids Workshop: Italian Easter Bread Making","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T15:30:00.000Z","location":"Cucinato Studio","description":"Easter egg painting, bread to take home, hot chocolate and LOTS of fun!! Your little chef will learn how to make their very own traditional Italian Easter Bread! Also known as Pane di Pasqua, this fluffy and eggy bread is served during Easter time in Italian c..."},{"title":"LEGENDS OF TIME: Exhibition and Sale of Paintings By Oleh Nedoshytko","date":"2019-04-07T18:30:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Taras Shevchenko Museum","description":"The Taras Shevchenko Museum is pleased to announce Legends of Time –an exhibition and sale of paintings by the Ukrainian artist, Oleh Nedoshytko, who will introduce over 20 of his recent works. Opening with a reception on Sunday, April 7, 2019 from 2:30 to 5:3..."},{"title":"National Initiative for Eating Disorders 7th Annual Honouring the Journey Event","date":"2019-04-07T19:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"Adath Isreal Congregation","description":"Join NIED for our 7th Annual 'Honouring the Journey' event. This event is dedicated to inspiring, honouring, commemorating, and celebrating caregivers. Our panel of caregivers will share their experiences of grappling, wrestling, caring, and loving their loved..."},{"title":"Nite Comfort: Syngja, Spectral Tambours","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T03:30:00.000Z","location":"Handlebar","description":"This episode brings an exciting visit from Montréalers Syngja, and a beautiful new ambient percussion/concrete project from Robin Buckley and Jakob Thiesen, Spectral Tambours. SYNGJA 10pm Experimental and psychedelic, Syngja’s music is both haunting and timele..."},{"title":"Photography Workshop for Women","date":"2019-04-07T13:00:00.000Z","endTime":"2019-04-07T16:00:00.000Z","location":"Lovt Studio","description":"Do you have a camera and have no idea where to start? This workshop is an intensive on how to use your DSLR, designed for true beginners! So you shoot on Automatic, and want to learn how to use the Manual settings but feel overwhelmed on where to even start an..."},{"title":"Puppy Love Yoga","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T15:00:00.000Z","location":"The Redwood Studio","description":"It's Yoga with puppies! We provide the puppies and mats and you help socialize the little guys. Special GROUP DISCOUNT. Book at least 4 spots and enter code TEN at checkout for 10% OFF. Because puppies!"},{"title":"PupsYoga Classes","date":"2019-04-07T14:00:00.000Z","endTime":"2019-04-07T17:30:00.000Z","location":"PupsYoga Toronto","description":"Whether you’re a beginner or an experienced yogi, you’ll find our PupsYoga classes are the best way to relieve stress and get a dose of pure love from our little puppies. An experienced instructor will guide you through a relaxing yoga session while our puppie..."},{"title":"Rayannah & Ponteix : Album Release","date":"2019-04-08T00:00:00.000Z","endTime":"2019-04-08T02:00:00.000Z","location":"Small World Music Centre","description":"Western Canadian francophone artists Rayannah (MB) and Ponteix (SK) will share three tour dates this spring to celebrate the release of their respective albums, “Nos repaires (Our Haunts)” and “Bastion”. The Trille Or-nominated acts will present their latest l..."},{"title":"Richard Goode","date":"2019-04-07T19:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"Koerner Hall","description":"“It is virtually impossible to walk away from one of Mr. Goode’s recitals without the sense of having gained some new insight, subtle or otherwise, into the works he played or about pianism itself.” (The New York Times) Richard Goode will perform an all Ludwig..."},{"title":"Sistema Spirit Gala","date":"2019-04-07T23:00:00.000Z","endTime":"2019-04-08T02:00:00.000Z","location":"The Spoke Club","description":"The Sistema Spirit Gala is a party and fundraiser featuring amazing live music from jazz and world musicians Neil Brathwaite and Ruth Mathiang. Ticket price includes music, food, and beverages and 100% of the proceeds support bringing more students into Sistem..."},{"title":"Skinner's Dress Suit","date":"2019-04-07T17:00:00.000Z","endTime":"2019-04-07T18:40:00.000Z","location":"Royal Cinema","description":"Toronto Silent Film Festival continues with the newly restored by Universal Pictures, this Rom-Com is a snappy comedy of errors, delightfully brimming with wit and sass that puts it right up there with the best. Reginald Denny & Laura La Plante richly deserved..."},{"title":"Spring has sprung at Hillcrest with Spring Sweets Pop-up Market","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T23:00:00.000Z","location":"Hillcrest - Centre Court","description":"Hillcrest’s Centre Court will blossom into a spring spectacle on April 6 and 7 with its Spring Sweets pop-up market. It will feature 12 food vendors providing visitors with a sweet experience. Vendors include All you Knead, Paletta America, Vapz Tastebudz, Ros..."},{"title":"Sweat & Sip  with Camp Fuel","date":"2019-04-07T18:30:00.000Z","endTime":"2019-04-07T20:30:00.000Z","location":"Elle Fitness","description":"Sweat, sip & be social! We'll Hiit it up with a super sweaty fitness class and then hang around after, get to know each other over beer provided by Glutenberg Beer & Temple Vodka.\nYour sweat session will be a full body workout. We'll bounce between strength tr..."},{"title":"Tassles & Tea: Create Your Own Pasties!","date":"2019-04-07T22:00:00.000Z","endTime":"2019-04-07T23:30:00.000Z","location":"Kink Toronto","description":"Interested in a crafternoon of breast positivity and sassy pasties? Get your craft on during this Make Your Own Nipple Pasties workshop.\nLuna Matatas will walk you through designing, creating and applying pasties. You'll make up to two pairs of pasties to take..."},{"title":"The Cleaners","date":"2019-04-07T20:00:00.000Z","endTime":"2019-04-07T21:30:00.000Z","location":"TIFF Bell Lightbox","description":"Viewers meet five “digital scavengers,” among thousands of people outsourced by Silicon Valley companies, whose job is to delete “inappropriate” web content. A typical cleaner must observe and rate thousands of often deeply disturbing images and videos every d..."},{"title":"The Femme! Experience","date":"2019-04-07T18:30:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Dancemakers","description":"House of Joy presents the Femme! Experience - a 90-minute fusion movement class.\n* Honour your sexy soulfulness\n* Unleash yourself to the sounds of live djembe drumming by Walter Maclean\n* Explore movement as a form of creativity, celebration, self-expression ..."},{"title":"The Song Shul's first Women's Seder","date":"2019-04-07T18:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Rinx Entertainment Centre","description":"The Song Shul's Women's Seder\nAliza Spiro leads Toronto’s first WOMEN’S SEDER, shining new light on the Pesach experience.\nNot a “Feminist Seder” — it’s a Women’s Seder! Song-filled and jam-packed with exciting insights about the contribution of women to the s..."},{"title":"Toronto Arrows Rugby Football Club's First Official Home Game","date":"2019-04-07T18:00:00.000Z","endTime":"2019-04-07T21:00:00.000Z","location":"York Alumni Stadium","description":"The Toronto Arrows Rugby Club, Canada’s first professional rugby union team was added to Major League Rugby for the 2019 season. Come watch the Toronto Arrows first home game and cheer them on as they play against the Nola Gold Rugby team."},{"title":"Toronto Homeless Outreach","date":"2019-04-07T15:00:00.000Z","endTime":"2019-04-07T17:00:00.000Z","location":"Canadian Tire at Bay St and Dundas St W","description":"Rallying all citizens of Toronto! Have fun and help out Toronto's homeless while meeting like-minded Torontonians followed by a group lunch at Yonge and Dundas!\nWe will be meeting at Canadian Tire at 65 Dundas St W, at 11:00 AM on Sunday April 7 to purchase gi..."},{"title":"Toronto Lettering Crew 2019 Meetup","date":"2019-04-07T17:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"Paper Plus Cloth","description":"Lettering Lovers! - Join us April 7th for the first TLC Meetup of the year!\nSpring is slowly making its way in and what better way to celebrate than a meetup with fellow creatives?\nWe are excited to be hosting TLC @torontoletteringcrew first meetup of the year..."},{"title":"Tristana & Ashtanga Yoga Fundamentals Workshop","date":"2019-04-07T05:00:00.000Z","endTime":"2019-04-07T20:00:00.000Z","location":"The Basement Yoga & Fitness Studio","description":"Sunday, April 7, 1- 4pm\nTristana and Ashtanga Yoga Fundamentals Workshop with Mark Morra\nThe foundation of Ashtanga Yoga was described in Yoga Mala by PattabhiJois as Tristana: Breath, Asana, and Dristi. When practiced simultaneously, Ashtanga becomes a moving..."},{"title":"Unclutter Emotions with Master Teresa","date":"2019-04-07T18:00:00.000Z","endTime":"2019-04-07T19:30:00.000Z","location":"New Age Healing Centre","description":"Rare opportunity to experience group Chi healing with Master Teresa with over 20 years experience. She will demonstrate how to practice Chi Gong; how to project Chi and balance your emotions.\nShe has special ability to scan and read your from a distance. So th..."},{"title":"WrestleMania 35 Viewing Party with Dinner!","date":"2019-04-07T22:00:00.000Z","endTime":"2019-04-08T03:59:00.000Z","location":"Law Office of Caryma Sa'd","description":"Are you ready for the most important wrestling event of the year? Come join us at the Law Office of Caryma Sa’d Downtown Toronto. We are hosting a private event with DINNER\nBUFFET. (including non-alcoholic drinks)\nWrestleMania 35 will be the thirty-fifth annua..."},{"title":"YOUTHSing! 2019: Sure on this Shining Night","date":"2019-04-07T23:00:00.000Z","endTime":"2019-04-08T01:30:00.000Z","location":"Eglinton St. George's United Church","description":"The Toronto Youth Choir is excited to host YOUTHSing 2019, with guest clinician and composer Dr. Cristian Grases. Join us at 7PM for an inspiring concert featuring youth choirs from across the GTA, including Bach Chamber Youth Choir, Mississauga Festival Choir..."},{"title":"Alternative Film Festival Spring Edition","date":"2019-04-08T22:30:00.000Z","endTime":"2019-04-08T23:30:00.000Z","location":"2469 Dundas St. West","description":"Jenell Diegor and Asian On A Mission Productions presents the Alternative Film Festival. Due to technical difficulties, we had to reschedule the original screening from March 18 to April 8. Please join us in watching Don't Feed These Animals, Cheetah, Rebel Wi..."},{"title":"Escape the Upside Down","date":"2019-04-08T23:00:00.000Z","endTime":"2019-04-09T03:00:00.000Z","location":"DevHub Toronto","description":"Ever wanted to experience the world of Stranger Things in real life? Now you can! On April 8th come to a one of a kind escape room event: “Escape The Upside Down”. In teams of 8, you will compete against other teams to see who can complete their escape room fi..."},{"title":"Fleetwood Mac in Toronto","date":"2019-04-09T00:00:00.000Z","endTime":"2019-04-09T03:59:00.000Z","location":"Scotiabank Arena","description":"Sale Dates and Times: Public Onsale : Mon, 12 Nov 2018 at 10:00 AM A limited number of LaneOne VIP Packages will also be available, including amazing seats with premium benefits such as transportation, preferred entrance and more. https://www.laneone.com/e..."},{"title":"Trampoline Hall Monday April 8th Emily M. Keeler and Charles Yao Curate","date":"2019-04-08T23:40:00.000Z","endTime":"2019-04-09T02:40:00.000Z","location":"Garrison","description":"The next Trampoline Hall is on Monday, April 8th, 2019 at The Garrison. All speakers chosen by Emily M. Keeler + Charles Yao. Chantal Braganza - \"La Cucina Futurista\" Laura Fisher - The Porky Feast Anupa Mistry - The Bind Set by Ansel Schmidt & Nilou Ghaemi. T..."},{"title":"163 John St. : DO OR DIE OPEN MIC @ THE CORNER","date":"2019-04-09T00:00:00.000Z","endTime":"2019-04-09T03:00:00.000Z","location":"The Corner","description":"HOSTS: JOEY HARLEM & JEREMY DOBSKI The Corner Comedy Club weekly Open Mic Monday Nights at 8PM - 11PM Amateurs, Pros and Room Regulars get up on stage and try out something new! DURATION: 180 MINUTES $5 TICKETS TICKETS AVAILABLE @ thecornercomedy.com SIGN UP E..."},{"title":"33rd Annual World Dentistry Summit","date":"2019-04-08T13:00:00.000Z","endTime":"2019-04-08T22:00:00.000Z","location":"Holiday Inn","description":"Welcome at the CDE & CPD accredited 33rd Annual World Dentistry Summit | April 08-09, 2019 | Toronto, Canada. The subject of the social occasion is around “Modern dental excellence with compassionate care\"and major highlights are Dentist, Dental, Scaling, Orth..."},{"title":"Affordable Improv for Newbies. Promise you'll leave with the BIGGEST smile","date":"2019-04-08T22:30:00.000Z","endTime":"2019-04-09T01:00:00.000Z","location":"CSI Annex","description":"You'll learn to let go and re-discover your playful and creative side It's a chance to be a kid again from speaking gibberish to doing your best impression of your grandma. Spend a few hours with others in a safe space to gradually come out of your shell. No p..."},{"title":"Barista Workshop and Introduction to Latte Art","date":"2019-04-08T22:30:00.000Z","endTime":"2019-04-09T00:30:00.000Z","location":"1690 Queen St W, Toronto, ON M6R 1B3, Canada","description":"Have you ever wished you could create gourmet coffee beverages like the Barista does at your local coffeehouse? This hands on tasting workshop will teach you the secrets to pulling the perfect shot of Espresso and techniques to help you create mouth watering m..."},{"title":"Boards & Beers Game Night","date":"2019-04-08T23:00:00.000Z","endTime":"2019-04-09T02:00:00.000Z","location":"Dominion Pub & Kitchen","description":"We are back at Dominion Pub and Kitchen on Queen East! In fact we will be here the 2nd Monday every month. As usual, we are bringing all the games and rules. Come learn new games and make new friends! $6 for unlimited play all night! Dominion is providing us t..."},{"title":"Christine Jakel","date":"2019-04-09T00:00:00.000Z","endTime":"2019-04-09T02:00:00.000Z","location":"Painted Lady","description":"Christine Jakel brings her folk/alternative vibes to the Painted Lady. With songs ranging from tales of heartbreak to fun tunes that’ll have you snapping along, listeners can expect to be taken on a journey at her live show."},{"title":"Digital Psychology and Emotional Design Training Week","date":"2019-04-08T13:00:00.000Z","endTime":"2019-04-08T21:00:00.000Z","location":"193 Augusta Ave","description":"Upgrade your qualifications and skills, through a series of 3-workshops on how to apply psychology and emotional design neuroscience to websites, apps and digital campaigns. Practical design psychology Our training is science-based with a focus on practical ap..."},{"title":"DJ Jason Parker Quinton","date":"2019-04-09T00:00:00.000Z","endTime":"2019-04-09T03:59:00.000Z","location":"Handlebar","description":"No cover! $6 pint special. DJ Jason Parker Quinton presents a vinyl odyssey through the classics you rarely hear out, to the best songs of all time, all the while stoking the dancefloor and cultivating a vibe. Populist crowd pleasing musicology with a hip-hop ..."},{"title":"Focus Group","date":"2019-04-09T01:30:00.000Z","endTime":"2019-04-09T02:30:00.000Z","location":"Bad Dog Comedy Theatre","description":"Join some of Toronto's best improvisers as they watch the strangest, most unintentionally comedic videos the internet has to offer and turn them into the greatest, intentionally comedic scenes they have to offer! This month's cast: Lisa Amerongen! Conor Bradbu..."},{"title":"History on Film Series - Operation Finale - 2018 Movie","date":"2019-04-08T22:00:00.000Z","endTime":"2019-04-09T00:00:00.000Z","location":"Brentwood Library","description":"Director Chris Weitz's historical thriller is based on the story of how a group of Israeli secret agents arrested notorious SS officer Adolf Eichmann - the man who masterminded the \"Final Solution\" - in Argentina. Oscar Isaac plays the legendary Mossad agent P..."},{"title":"ICFF Youth Festival 2019","date":"2019-04-08T14:30:00.000Z","endTime":"2019-04-08T16:30:00.000Z","location":"TIFF Bell Lightbox","description":"The ICFF Youth program is aimed at students aged 8-18, and works in close collaboration with the Toronto Catholic District School Board (TCDSB) and York Catholic District School Board (YCDSB), inviting 4000 students from over 40 schools to see unique, challeng..."},{"title":"Imperfect Journey, part of the film series Resistance & Revolution: The Cinema of Haile Gerima","date":"2019-04-08T22:00:00.000Z","endTime":"2019-04-09T00:00:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Film Imperfect Journey Dir. Haile Gerima 1994 | 88 min In this BBC commissioned film, Haile Gerima and Polish journalist Ryszard Kapuscinski travel around Ethiopia talking to people about their political and psychic recovery of the Ethiopian people after the a..."},{"title":"Jeopardy Rejects Support Group - a trivia night","date":"2019-04-08T23:30:00.000Z","endTime":"2019-04-09T01:30:00.000Z","location":"Tequila Bookworm","description":"A theme-less trivia night for all the Jeopardy hopefuls out there. No cover, $6 Collingwood beer special and weekly prizes."},{"title":"Mental Health in the Black Community","date":"2019-04-08T09:00:00.000Z","endTime":"2019-04-08T23:00:00.000Z","location":"Mechanical Engineering Building","description":"The Black Medical Students Association Mental Health Series will be focusing on the social determinants of mental health in the Black Canadian population. Our speakers are highly qualified healthcare professionals and researchers with a great depth of knowledg..."},{"title":"Mixology and Bitters 101 at Toronto Botanical Garden","date":"2019-04-08T23:00:00.000Z","endTime":"2019-04-09T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Join Phil and Maria from Kinsip House of Fine Spirits as they walk you through basic techniques of mixology and bitters usage that will have you mixing up cocktails to impress your guests. Learn when to shake and when to stir and how to up your cocktail game!"},{"title":"Our2030: Pop-Up Lab","date":"2019-04-08T21:00:00.000Z","endTime":"2019-04-09T01:00:00.000Z","location":"Centre for Social Innovation - Regent Park","description":"Interested in tackling important social and environmental issues and preparing yourself for a career in the Age of Disruption? Are you working on a project or idea relating to the UN Sustainable Development Goals (SDG), and want to access resources to accelera..."},{"title":"Poetry Workshops","date":"2019-04-08T22:00:00.000Z","endTime":"2019-04-09T00:00:00.000Z","location":"House of Anansi Press","description":"April is National Poetry Month! To celebrate, we are hosting two poetry workshops at the Anansi Bookshop. The workshops are for writers of all levels, from first-timers to seasoned artists. We will work with prompts to produce poetry to be shared and taken hom..."},{"title":"Raghuram Rajan on \"The Third Pillar: How Markets and the State Leave the Community Behind\"","date":"2019-04-08T21:00:00.000Z","endTime":"2019-04-08T22:00:00.000Z","location":"Rotman School of Management","description":"From one of the most important economic thinkers of our time, a brilliant and far-seeing analysis of the current populist backlash against globalization. Raghuram Rajan, distinguished University of Chicago professor, former IMF chief economist, head of India's..."},{"title":"Steve Poudrier","date":"2019-04-08T23:00:00.000Z","endTime":"2019-04-08T06:00:00.000Z","location":"Wayla","description":"“Steve Poudrier, a Quebec-based artist launching his first art exhibition “Emotions” in Toronto” A formal launch of his exhibition will be held on 8th April 2019 ay WAYLA at and you can get a glimpse of Steve’s work at https://stevepoudrierartiste.com/"},{"title":"Wisdom At Work with Chip Conley - Presented in partnership with BoomersPlus","date":"2019-04-08T20:00:00.000Z","endTime":"2019-04-08T21:30:00.000Z","location":"Toronto Region Board of Trade","description":"Stepping down never means slowing down for Chip Conley. After selling his successful boutique hotel chain, Chip took on a mentorship role for the young founders of Airbnb. But as he helped grow the Silicon Valley start-up into a global tech leader, he learned ..."},{"title":"Alternative Film Festival Spring Edition","date":"2019-04-09T22:30:00.000Z","endTime":"2019-04-09T23:30:00.000Z","location":"2469 Dundas St. West","description":"Jenell Diegor and Asian On A Mission Productions presents the Alternative Film Festival. Due to technical difficulties, we had to reschedule the original screening from March 18 to April 8. Please join us in watching Don't Feed These Animals, Cheetah, Rebel Wi..."},{"title":"Escape the Upside Down","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T03:00:00.000Z","location":"DevHub Toronto","description":"Ever wanted to experience the world of Stranger Things in real life? Now you can! On April 8th come to a one of a kind escape room event: “Escape The Upside Down”. In teams of 8, you will compete against other teams to see who can complete their escape room fi..."},{"title":"Fleetwood Mac in Toronto","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-10T03:59:00.000Z","location":"Scotiabank Arena","description":"Sale Dates and Times: Public Onsale : Mon, 12 Nov 2018 at 10:00 AM A limited number of LaneOne VIP Packages will also be available, including amazing seats with premium benefits such as transportation, preferred entrance and more. https://www.laneone.com/e..."},{"title":"Trampoline Hall Monday April 8th Emily M. Keeler and Charles Yao Curate","date":"2019-04-09T23:40:00.000Z","endTime":"2019-04-10T02:40:00.000Z","location":"Garrison","description":"The next Trampoline Hall is on Monday, April 8th, 2019 at The Garrison. All speakers chosen by Emily M. Keeler + Charles Yao. Chantal Braganza - \"La Cucina Futurista\" Laura Fisher - The Porky Feast Anupa Mistry - The Bind Set by Ansel Schmidt & Nilou Ghaemi. T..."},{"title":"163 John St. : DO OR DIE OPEN MIC @ THE CORNER","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-10T03:00:00.000Z","location":"The Corner","description":"HOSTS: JOEY HARLEM & JEREMY DOBSKI The Corner Comedy Club weekly Open Mic Monday Nights at 8PM - 11PM Amateurs, Pros and Room Regulars get up on stage and try out something new! DURATION: 180 MINUTES $5 TICKETS TICKETS AVAILABLE @ thecornercomedy.com SIGN UP E..."},{"title":"33rd Annual World Dentistry Summit","date":"2019-04-09T13:00:00.000Z","endTime":"2019-04-09T22:00:00.000Z","location":"Holiday Inn","description":"Welcome at the CDE & CPD accredited 33rd Annual World Dentistry Summit | April 08-09, 2019 | Toronto, Canada. The subject of the social occasion is around “Modern dental excellence with compassionate care\"and major highlights are Dentist, Dental, Scaling, Orth..."},{"title":"Affordable Improv for Newbies. Promise you'll leave with the BIGGEST smile","date":"2019-04-09T22:30:00.000Z","endTime":"2019-04-10T01:00:00.000Z","location":"CSI Annex","description":"You'll learn to let go and re-discover your playful and creative side It's a chance to be a kid again from speaking gibberish to doing your best impression of your grandma. Spend a few hours with others in a safe space to gradually come out of your shell. No p..."},{"title":"Barista Workshop and Introduction to Latte Art","date":"2019-04-09T22:30:00.000Z","endTime":"2019-04-10T00:30:00.000Z","location":"1690 Queen St W, Toronto, ON M6R 1B3, Canada","description":"Have you ever wished you could create gourmet coffee beverages like the Barista does at your local coffeehouse? This hands on tasting workshop will teach you the secrets to pulling the perfect shot of Espresso and techniques to help you create mouth watering m..."},{"title":"Boards & Beers Game Night","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T02:00:00.000Z","location":"Dominion Pub & Kitchen","description":"We are back at Dominion Pub and Kitchen on Queen East! In fact we will be here the 2nd Monday every month. As usual, we are bringing all the games and rules. Come learn new games and make new friends! $6 for unlimited play all night! Dominion is providing us t..."},{"title":"Christine Jakel","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-10T02:00:00.000Z","location":"Painted Lady","description":"Christine Jakel brings her folk/alternative vibes to the Painted Lady. With songs ranging from tales of heartbreak to fun tunes that’ll have you snapping along, listeners can expect to be taken on a journey at her live show."},{"title":"Digital Psychology and Emotional Design Training Week","date":"2019-04-09T13:00:00.000Z","endTime":"2019-04-09T21:00:00.000Z","location":"193 Augusta Ave","description":"Upgrade your qualifications and skills, through a series of 3-workshops on how to apply psychology and emotional design neuroscience to websites, apps and digital campaigns. Practical design psychology Our training is science-based with a focus on practical ap..."},{"title":"DJ Jason Parker Quinton","date":"2019-04-10T00:00:00.000Z","endTime":"2019-04-10T03:59:00.000Z","location":"Handlebar","description":"No cover! $6 pint special. DJ Jason Parker Quinton presents a vinyl odyssey through the classics you rarely hear out, to the best songs of all time, all the while stoking the dancefloor and cultivating a vibe. Populist crowd pleasing musicology with a hip-hop ..."},{"title":"Focus Group","date":"2019-04-10T01:30:00.000Z","endTime":"2019-04-10T02:30:00.000Z","location":"Bad Dog Comedy Theatre","description":"Join some of Toronto's best improvisers as they watch the strangest, most unintentionally comedic videos the internet has to offer and turn them into the greatest, intentionally comedic scenes they have to offer! This month's cast: Lisa Amerongen! Conor Bradbu..."},{"title":"History on Film Series - Operation Finale - 2018 Movie","date":"2019-04-09T22:00:00.000Z","endTime":"2019-04-10T00:00:00.000Z","location":"Brentwood Library","description":"Director Chris Weitz's historical thriller is based on the story of how a group of Israeli secret agents arrested notorious SS officer Adolf Eichmann - the man who masterminded the \"Final Solution\" - in Argentina. Oscar Isaac plays the legendary Mossad agent P..."},{"title":"ICFF Youth Festival 2019","date":"2019-04-09T14:30:00.000Z","endTime":"2019-04-09T16:30:00.000Z","location":"TIFF Bell Lightbox","description":"The ICFF Youth program is aimed at students aged 8-18, and works in close collaboration with the Toronto Catholic District School Board (TCDSB) and York Catholic District School Board (YCDSB), inviting 4000 students from over 40 schools to see unique, challeng..."},{"title":"Imperfect Journey, part of the film series Resistance & Revolution: The Cinema of Haile Gerima","date":"2019-04-09T22:00:00.000Z","endTime":"2019-04-10T00:00:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Film\nImperfect Journey\nDir. Haile Gerima\n1994 | 88 min\nIn this BBC commissioned film, Haile Gerima and Polish journalist Ryszard Kapuscinski travel around Ethiopia talking to people about their political and psychic recovery of the Ethiopian people after the a..."},{"title":"Jeopardy Rejects Support Group - a trivia night","date":"2019-04-09T23:30:00.000Z","endTime":"2019-04-10T01:30:00.000Z","location":"Tequila Bookworm","description":"A theme-less trivia night for all the Jeopardy hopefuls out there. No cover, $6 Collingwood beer special and weekly prizes."},{"title":"Mental Health in the Black Community","date":"2019-04-09T09:00:00.000Z","endTime":"2019-04-09T23:00:00.000Z","location":"Mechanical Engineering Building","description":"The Black Medical Students Association Mental Health Series will be focusing on the social determinants of mental health in the Black Canadian population. Our speakers are highly qualified healthcare professionals and researchers with a great depth of knowledg..."},{"title":"Mixology and Bitters 101 at Toronto Botanical Garden","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-10T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Join Phil and Maria from Kinsip House of Fine Spirits as they walk you through basic techniques of mixology and bitters usage that will have you mixing up cocktails to impress your guests. Learn when to shake and when to stir and how to up your cocktail game!"},{"title":"Our2030: Pop-Up Lab","date":"2019-04-09T21:00:00.000Z","endTime":"2019-04-10T01:00:00.000Z","location":"Centre for Social Innovation - Regent Park","description":"Interested in tackling important social and environmental issues and preparing yourself for a career in the Age of Disruption? Are you working on a project or idea relating to the UN Sustainable Development Goals (SDG), and want to access resources to accelera..."},{"title":"Poetry Workshops","date":"2019-04-09T22:00:00.000Z","endTime":"2019-04-10T00:00:00.000Z","location":"House of Anansi Press","description":"April is National Poetry Month! To celebrate, we are hosting two poetry workshops at the Anansi Bookshop.\nThe workshops are for writers of all levels, from first-timers to seasoned artists. We will work with prompts to produce poetry to be shared and taken hom..."},{"title":"Raghuram Rajan on \"The Third Pillar: How Markets and the State Leave the Community Behind\"","date":"2019-04-09T21:00:00.000Z","endTime":"2019-04-09T22:00:00.000Z","location":"Rotman School of Management","description":"From one of the most important economic thinkers of our time, a brilliant and far-seeing analysis of the current populist backlash against globalization. Raghuram Rajan, distinguished University of Chicago professor, former IMF chief economist, head of India's..."},{"title":"Steve Poudrier","date":"2019-04-09T23:00:00.000Z","endTime":"2019-04-09T06:00:00.000Z","location":"Wayla","description":"“Steve Poudrier, a Quebec-based artist launching his first art exhibition “Emotions” in Toronto”\nA formal launch of his exhibition will be held on 8th April 2019 ay WAYLA at\nand you can get a glimpse of Steve’s work at\nhttps://stevepoudrierartiste.com/"},{"title":"Wisdom At Work with Chip Conley - Presented in partnership with BoomersPlus","date":"2019-04-09T20:00:00.000Z","endTime":"2019-04-09T21:30:00.000Z","location":"Toronto Region Board of Trade","description":"Stepping down never means slowing down for Chip Conley. After selling his successful boutique hotel chain, Chip took on a mentorship role for the young founders of Airbnb. But as he helped grow the Silicon Valley start-up into a global tech leader, he learned ..."},{"title":"The Claypool Lennon Delirium","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T03:59:00.000Z","location":"The Danforth Music Hall","description":"19+ Event/Valid Photo ID Required Doors - 7:00pm Support: Uni Sale Dates and Times: Public Onsale : Fri, 14 Dec 2018 at 10:00 AM Embrace Presents Presale (19+) : Thu, 13 Dec 2018 at 10:00 AM VIP Package Presale : Wed, 12 Dec 2018 at 10:00 AM VIP Packa..."},{"title":"163 John St. : DIRTY WEDNESDAY @ THE CORNER","date":"2019-04-11T00:00:00.000Z","endTime":"2019-04-10T04:00:00.000Z","location":"The Corner","description":"A weekly showcase of some of the dirtiest/uncensored comics in Toronto & It's taking place at the newest, hottest comedy club, THE CORNER! Two shows NOW! @ 8 & 10 PM, comedians credits include Just For Laughs, JFL 42, CBC, Comedy Network + more. Everything Dir..."},{"title":"2019 Drop In Figure Drawing","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T01:30:00.000Z","location":"LucSculpture","description":"Come to LucSculpture on Wednesday night, 6:30 pm– 9:30 pm, for a drop-in figure drawing Toronto sessions! We have a different model each week and occationally a special costume event, too. Enjoy the relaxing atmosphere! Drop-in: $20, session passes (12 session..."},{"title":"946 QUEEN ST. EAST : THE RENEGADE SHOW @ THE CORNER EAST","date":"2019-04-11T00:00:00.000Z","endTime":"2019-04-10T04:00:00.000Z","location":"The Corner East","description":"Every Wednesday at The Corner Comedy Club EAST, the young killer Kyle Lucey will be hosting THE RENEGADE SHOW! A lineup of Canada’s best comedians showcasing dark and twisted material. Featuring comedians from Just For Laughs, CBC, Sirius XM, and The Comedy Ne..."},{"title":"A Kink in the Relationship","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T01:30:00.000Z","location":"Good For Her","description":"Kinks and fetishes are a hard-wired part of some people’s sexuality, but what do you do when the person you are in a relationship with has sexual interests that deviate radically from yours? This workshop will address the challenges that couples face when one ..."},{"title":"Battle of the Bands TO","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-10T04:00:00.000Z","location":"Revival Bar","description":"Tickets are now on sale for Battle of the Bands TO, a 1-night fundraising competition, taking place Wednesday, April 10, 2019, at Revival Bar. Performing on the same stage that has welcomed artists such as Justin Timberlake, Black Eyed Peas, Kid Rock, Sara McL..."},{"title":"COLOURED BODIES: MATERIAL MOVES by Dori Vanderheyden","date":"2019-04-10T16:00:00.000Z","endTime":"2019-04-10T22:00:00.000Z","location":"Propeller Art Gallery","description":"Dori Vanderheyden’s work layers and enfolds themes of sexuality, the body and colour as a way to evoke questions of what it means to be a human in the universe at this time. The evocative qualities of light emitting fluorescent plexiglass were considered as a ..."},{"title":"Cover Me Urban","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T02:00:00.000Z","location":"The Rec Room","description":"The neighbourhoods of Toronto come to life in an electric celebration of urban sights and sounds in support of the homeless youth at Youth Without Shelter (YWS). Enjoy street foods from around the world prepared by Toronto chefs, as well as wine, beer and stre..."},{"title":"Dante Matas and ZINNIA at Burdock","date":"2019-04-11T01:00:00.000Z","endTime":"2019-04-10T06:00:00.000Z","location":"Burdock","description":"Music starts at 9, $10 cover. Dante Matas: Dante Matas and his band, The Infernal Racket, are an indie pop group from Toronto. In 2018 they released the album “A Colourful Headache” and toured the east coast of Canada. Live, they combine their melodic, hook-fi..."},{"title":"Draw by Night Toronto","date":"2019-04-10T23:30:00.000Z","endTime":"2019-04-11T03:00:00.000Z","location":"Station Bar & Kitchen","description":"Draw by Night is Toronto's biggest social drawing event and we're hosting a Brain Splittin' party! Come out and join other designers, illustrators and art enthusiasts for a night of drawing, drinks and games. Your ticket buys you entry and a free drink at the ..."},{"title":"Eating Insects Dinner","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T01:30:00.000Z","location":"Cookie Martinez","description":"Welcome back to the new Eating Insects Series. This series has been a work of love, looking for new recipes of how to integrate insects in our diet, getting rid of the Yuk perception of eating insects. I will be preparing for a four-course dinner menu. The men..."},{"title":"Embiria presents Intro to Calligraphy","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T00:30:00.000Z","location":"Drake Commissary","description":"Do you want to discover how to do calligraphy for greeting cards or upcoming wedding DIY's? Looking to improve your writing for your planner? Kickstart your new found hobby with this popular class led by the talented Sylvia of @viacalligraphy at the beautiful ..."},{"title":"Excel Basics 1","date":"2019-04-10T22:00:00.000Z","endTime":"2019-04-11T00:00:00.000Z","location":"Brentwood Library","description":"Learn to open, create and edit a simple table using Microsoft Excel 2013. Basic keyboarding and mouse skills required. Register in person at the Information Desk or by calling 416-394-5240."},{"title":"FIRST WIVES FIGHT CLUB","date":"2019-04-10T23:30:00.000Z","endTime":"2019-04-11T03:00:00.000Z","location":"Winter Garden Theatre","description":"First Wives Fight Club is a drag-musical-parody-90s-classics-mash-up written by Peaches Christ and Varla Jean Merman. Come explore your deepest, campiest, revenge-comedy fantasies with an all star cast of RuPaul's Drag Race Superstars: Toronto's own: Brooke Ly..."},{"title":"Free ANIMATION & DANCE Film Festival - Thur. April 11th, 7pm. Carlton Cinemas","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T01:00:00.000Z","location":"Carlton Cinemas","description":"A showcase of the best of Short Films from around the world today: Thursday April 11th. 7pm. Carlton Cinemas in downtown Toronto. Best of ANIMATION & DANCE Short Films. An event for everyone! See the full program and info for each film and filmmaker https://fe..."},{"title":"FREE Drop-in Lunchtime Japanese Lesson: \"Eating Out in Japanese\"","date":"2019-04-10T16:15:00.000Z","endTime":"2019-04-10T16:45:00.000Z","location":"The Japan Foundation","description":"Have you been thinking about learning a new language but haven’t been able to find the time? The Japan Foundation, Toronto is happy to offer a monthly drop-in starter Japanese-language lesson series over the lunch hour! In these lessons, we will introduce help..."},{"title":"Freelance Finances","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T00:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Taxes, HST, GST, revenue, expenses...when you work for yourself, your business finances ARE your personal finances, and if you're not careful, things can get very messy! This workshop is where you start to learn how to run your sole-proprietorship finances. Yo..."},{"title":"Hacking Success, Her Way featuring Ann Kaplan Mulholland & Tosca Reno","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T02:00:00.000Z","location":"The Albany Club","description":"Project Her Inc. is proud to present Hacking Success, Her Way. This event will give rising women entrepreneurs access to the stories and insights of business powerhouses who have cracked the glass ceiling—with a vengeance. Intimate stories of tragedy and resil..."},{"title":"House of Kings: Colour Me Now!","date":"2019-04-11T01:00:00.000Z","endTime":"2019-04-10T05:00:00.000Z","location":"Glad Day Bookshop (Church)","description":"Welcome to Colour Me Now, the first House of Kings BIPOC Show - our first show that isn’t run by white people! Come bask in the melanin glory, unique stories and explosive performances from this STACKED lineup of Kings, Queens and Gender Performers who leave y..."},{"title":"InkWell Workshops - Fiction with Kathy","date":"2019-04-10T18:00:00.000Z","endTime":"2019-04-10T20:00:00.000Z","location":"Routes Community Centre","description":"InkWell Workshops offers free, drop-in creative-writing workshops to people living with mental-health or addictions issues led by award-winning professional writers with lived experience of mental illness. Explore the basics of writing fiction in a fun, relaxe..."},{"title":"Navigating the Media","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T00:00:00.000Z","location":"Diane Frankling Co-operative Homes","description":"Please join Professor Megan Boler (Social Justice Education, OISE/University of Toronto) and the Navigating News Research Team: Andrea Vela Alarcon, Kate Jackson, Gordon Katic, Michael Primrose for an informative and thought provoking discussion. The panel pro..."},{"title":"Pink Craft Day","date":"2019-04-10T19:30:00.000Z","endTime":"2019-04-10T21:00:00.000Z","location":"Jones Library","description":"Come to Jones Branch and make a pink t-shirt badge to wear for Pink Day. Show your support for anti bullying on April 11th by wearing your signature pink badge. (no pins involved)"},{"title":"Rise & Fall of the Gooderham & Worts Empire Whisky Pairing Dinner","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T01:30:00.000Z","location":"Boku Noodle Bar","description":"Talk Whisky & History with Canadian Whisky Ambassador Spencer Gooderham Wednesday, April 10 7:00pm - 9:30pm $84 Including Tax & Gratuity Delight in a four-course meal prepared by Executive Chef David Caban, inspired by the four grains in whisky production – ba..."},{"title":"Roll Red Roll","date":"2019-04-10T22:30:00.000Z","endTime":"2019-04-11T00:00:00.000Z","location":"TIFF Bell Lightbox","description":"“Why didn’t anyone stop it?” Roll Red Roll goes beyond the headlines to unpack the factors that led to a sexual assault at a high-school football party in Steubenville, Ohio, and shaped its aftermath — from peer pressure, victim blaming, and the deeply ingrain..."},{"title":"Shane Pendergast at Free Times Cafe","date":"2019-04-11T00:00:00.000Z","endTime":"2019-04-11T02:00:00.000Z","location":"Free Times Cafe","description":"Growing up in a musical family, Shane was surrounded by traditional Maritime, French Acadian, and Celtic music. Now 20 years old, he contributes to those traditions by writing his own Maritime folk songs. In the summertime, Shane returns to his Island home to ..."},{"title":"Slime Time! at Albert Campbell District Library","date":"2019-04-10T20:00:00.000Z","endTime":"2019-04-10T21:00:00.000Z","location":"Albert Campbell District Library","description":"Exciting, free SLIME event for kids at Albert Campbell District Library on Wednesday, April 10 at 4-5pm! Make your own squishy slime to take home! Using safe, grocery store ingredients that we provide, we will make slime and have fun together! For school-age c..."},{"title":"Spring Job Fair","date":"2019-04-10T17:30:00.000Z","endTime":"2019-04-10T19:30:00.000Z","location":"Milliken Mills Library","description":"JVS Employment Source Markham is hosting a job fair for full-time and part-time positions in Customer Service, Administration, Technology, Finance, Insurance, Hospitality, Healthcare, Sales, and more! On-site interview with employers like: - York University - ..."},{"title":"Spring Sample Sale","date":"2019-04-10T13:00:00.000Z","endTime":"2019-04-10T22:00:00.000Z","location":"90 Tycos Drive","description":"Spring is here! That means it's time for another fantastic sale on designer men's and women's clothing, denim, intimates, sleep and lounge wear and more! Don't miss it!"},{"title":"Terrarium Workshop","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T00:30:00.000Z","location":"Design Department","description":"Design Department has exquisite terrariums and in this class guests will create their own personalized custom terrarium with expert guidance by expert gardener/designer Meredyth Hilton. Sip and tasted too, with beverage and treats! Included in the class: - One..."},{"title":"The Ernestine Affair","date":"2019-04-10T22:00:00.000Z","endTime":"2019-04-11T02:30:00.000Z","location":"The Carlu","description":"Ernestine’s Women’s Shelter would like to welcome you to the 25th annual Ernestine Affair! On April 10, 2019, Ernestine’s will welcome 500 friends and supporters to the annual awards and fundraising gala. The event has grown from a lively but modest badminton ..."},{"title":"Urban Field Speaker Series: Ivan Navarro","date":"2019-04-10T23:00:00.000Z","endTime":"2019-04-11T01:00:00.000Z","location":"Prefix Institute of Contemporary Art","description":"The Chilean artist speaks about the relationship between his sculptural installations and his experience of being raised under the dictatorship of Augusto Pinochet. Moderated by Tamara Toledo, director and curator of Sur Gallery. Presented in partnership with ..."},{"title":"Wednesday Afternoon at the Movies: For Your Eyes Only, 1981","date":"2019-04-10T18:00:00.000Z","endTime":"2019-04-10T20:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Join us for a series of cinematic classics, new releases, foreign films and documentaries.\nApril 10, 2019 showing - For Your Eyes Only (1981) - Agent 007 is assigned to hunt for a lost British encryption device and prevent it from falling into enemy hands. Sta..."},{"title":"YSDN Graduation Showcase","date":"2019-04-10T22:00:00.000Z","endTime":"2019-04-11T03:00:00.000Z","location":"FREE","description":"The York University / Sheridan College Program in Design is hosting its annual grad show! YSDN is known for being a leader in Toronto's graphic design programs, and its annual grad show attracts hundreds of visitors each year. This year's show, In Real Life, i..."},{"title":"AGO Massive XV","date":"2019-04-12T01:00:00.000Z","endTime":"2019-04-11T05:00:00.000Z","location":"Art Gallery of Ontario","description":"Thursday April 11, 2019 9:00 PM - 1:00 AM Art Gallery of Ontario #AGOMassive AGO Massive is Toronto's ultimate contemporary art party, this year with creative direction by Director X! To celebrate AGO Massive’s 15th year, we are inspired by the anniversary’s t..."},{"title":"Images Festival 2019","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T03:00:00.000Z","location":"Multiple Venues","description":"Images showcases artistic excellence in contemporary moving image culture through screenings, exhibitions and performances, providing artists with a supportive forum in which to present their work and make professional connections with the media arts community..."},{"title":"META 2019","date":"2019-04-11T22:00:00.000Z","endTime":"2019-04-12T02:00:00.000Z","location":"The Black Cat Showroom","description":"META is an annual exhibition that showcases artwork by students of Ryerson's New Media program. The event celebrates creative innovation by providing a platform for displaying work created at the intersection of art and technology. META includes installation a..."},{"title":"163 JOHN ST. : THURSDAY SURPRISE SHOW @ THE CORNER","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-11T04:00:00.000Z","location":"The Corner","description":"PAUL THOMPSON'S SURPRISE SHOW Paul Thompson hosts a surprise line up of special guests. Featuring comics making their first appearance at The Corner as well as comics visiting Toronto from New York, Los Angeles, United Kingdom, and all over the world. TWO SHOW..."},{"title":"401 Art Hunt","date":"2019-04-11T21:00:00.000Z","endTime":"2019-04-11T23:00:00.000Z","location":"401 Richmond","description":"Art Hunt, a scavenger hunt is back this year at 401 Richmond! Our building-wide event takes place on Thursday, April 11, 2019 from 5-6pm. Folks will be given a series of clues, taking them around the basement and first floor of the building to discover the sec..."},{"title":"946 QUEEN ST. EAST : THE BANANAS SHOW @ THE CORNER EAST","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-11T04:00:00.000Z","location":"The Corner East","description":"Every Thursday at The Corner Comedy Club EAST, JOEY HARLEM & JEREMY DOBSKI will be hosting THE BANANAS SHOW! A lineup of Canada’s best comedians showcasing their fun and weird material. Featuring comedians from Just For Laughs, CBC, Sirius XM, and The Comedy N..."},{"title":"Anansi Poetry Bash","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Henderson Brewing Co","description":"Join us in launching House of Anansi Press and Groundwood Books' spring 2019 poetry books by Shannon Bramer (Climbing Shadows), Karen Solie (The Caiplie Caves), Erín Moure (The Elements), Michael Redhill (Twitch Force), and Kayla Czaga (Dunk Tank). Enjoy readi..."},{"title":"Andrea Spaziani's The Right Eye of Clint","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Dancemakers Centre for Creation","description":"A new solo work that deals with notions of the West and with Western film tropes. Choreography & Performance: Andrea Spaziani; Music Score: Matt Smith (aka Prince Nifty); Outside Eye: Danny Grossman. Tickets: $15/$20 on line and at the door"},{"title":"An Intimate Sip & Shuck - Oyster and Wine Experience","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"110 Charles Street East","description":"Join us for the April edition of our Intimate Sip & Shuck event - a hands-on shucking experience + wine social event About this Event Join us on Thursday, April 11th from 7-9 PM for an intimate evening spent sipping wine and slurping oysters in style! Enjoy fr..."},{"title":"Art Pour","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T02:00:00.000Z","location":"Jam Factory","description":"Art Pour is an event for those who enjoy indulging their senses, engaging their palate, and are intrigued by the art behind hosting and hospitality. Attending guests will learn more about what goes into hosting their own dinner party by expanding their knowled..."},{"title":"A Toast and Thyme Pop Up Dinner","date":"2019-04-11T22:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"The Depanneur","description":"Join us for Toast + Thyme's first pop-up dinner! More details on Instagram: @toastandthymeto Menu: Roasted Butternut Squash Soup $6 with Ginger Coconut Cream and Purple Potato Chips Toasts! $13 all toasts served on house-baked sourdough and come with a side of..."},{"title":"Beauty In Lines Exhibition - Jude Ifesieh","date":"2019-04-11T22:30:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Visions Gallery","description":"Opening Reception 6:30-9:00 pm. The distinctive paintings of Nigeria-born Jude Ifesieh merge simple, colourful strokes and dots into complex images that burst with healing energy, fertility and fresh possibilities."},{"title":"Beer and Cheese Night with BeerXca","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Muddy York Brewing Co.","description":"Have you ever wondered why beer and cheese taste so good together? Have you ever wanted to learn how to pair them yourself?\nJoin Certified Master Beer Sommeliers® Heather and Maddie from Beerx.ca as they take you on a taste adventure through five Muddy York Br..."},{"title":"Black Sheep Comedy's TESTING: ATTENTION PLEASE!","date":"2019-04-12T01:00:00.000Z","endTime":"2019-04-12T03:30:00.000Z","location":"120 Diner","description":"Black Sheep Comedy presents TESTING. ATTENTION PLEASE! Join us for a night of stand up featuring new and experienced comics. The comedian voted as audience favourite will win a HUGE(ly underwhelming) cash prize AND a surprise item to commemorate their victory!..."},{"title":"Blackwatch Agency Sample Sale","date":"2019-04-11T13:00:00.000Z","endTime":"2019-04-11T23:00:00.000Z","location":"Blackwatch Agency","description":"Luxury men's fashion lovers will want to get to this sale early. Europe's finest styles from the likes of John Smedley, Briglia, Orlebar Brown, 0909, Altea, Eduard Dressler, Esemplare, and more will be on sale up to 70% off retail.\nThu April 11th 9am – 7pm\nFri..."},{"title":"Blast From the Past - Sibling Day Edition","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T01:30:00.000Z","location":"Comedy Bar","description":"Sibling Day comes but once a year and we're here to celebrate those bratty kid sisters, grumpy older brothers and annoying middle children (and only children, and of course those friends we have adopted as siblings, we see you too).\nInspired by childhood show-..."},{"title":"Bon Villan Video Release Party with Most People and Rachel Romu","date":"2019-04-12T01:00:00.000Z","endTime":"2019-04-11T05:00:00.000Z","location":"The Piston","description":"We're back and thrilled to announce the release of our next single and accompanying video \"All The Way\". To celebrate we're throwing a release party at The Piston April 11th and hope you'll all come party with us. We'll be playing alongside Most People and Rac..."},{"title":"Book Launch, Alexa Conradi's Fear, Love and Liberation in Contemporary Quebec","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Another Story","description":"In response to rapid and unsettling social, economic, and climate changes, fearmongering now features as a main component of public life. Right-wing nationalist populism has become a hallmark of politics around the world. No less so in Quebec. Alexa Conradi ha..."},{"title":"Clay & Cardboard - Toddler Art Worrkshop","date":"2019-04-11T15:30:00.000Z","endTime":"2019-04-11T16:30:00.000Z","location":"Fresh Paint Studio (Danforth East)","description":"Join us for a fun and creative toddler art workshop! Kids will have fun creating self portraits using cardboard, clay, glue and paint. Kids will learn about colour and shapes.\nThursday, April 11\n11:30am-12:30pm\nCost: One toddler - $25+HST or two toddlers for $..."},{"title":"Collage Workshop with Danielle Cole","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:30:00.000Z","location":"918 Bathurst St","description":"This is a hands-on workshop where you will be shown strategies for creating collages that are seamlessly built. We will go beyond the glue stick, learning techniques for gluing fine and large pieces of collage without causing the material to bubble or tear. Da..."},{"title":"Contemporary Ceramic Art Exhibition","date":"2019-04-11T14:00:00.000Z","endTime":"2019-04-11T21:00:00.000Z","location":"Craft Ontario","description":"'The Body Has Reasons Which Reason Knows Not Of', ceramic work that explores various themes surrounding tacit knowledge, and the body’s ability to bounce back, grow, resist, and remember. Exhibition is on from April 11 to May 12, 2019 - Opening reception, Apri..."},{"title":"Create Startups","date":"2019-04-11T12:30:00.000Z","endTime":"2019-04-11T21:30:00.000Z","location":"Creative Destruction Lab","description":"Scale up your technology and teams!\nScale. It’s a word that invokes both excitement and apprehension in every startup. It’s easy to get overwhelmed, especially when scaling your team and your technology. We’re here to help with both, and that’s why we’re going..."},{"title":"Digital Product Management for  Creating and Managing Best-In-Class Products","date":"2019-04-11T22:15:00.000Z","endTime":"2019-04-12T00:00:00.000Z","location":"BrainStation Toronto","description":"MUST RSVP THROUGH EVENT PAGE HERE: http://bit.ly/2TxIXqd\nMore than ever before, savvy product management has a huge impact on company success. But what does that entail in the digital economy? Join us as local experts share what it takes to successfully lead p..."},{"title":"Elizabeth Lennie's solo show - Timeless","date":"2019-04-11T15:00:00.000Z","endTime":"2019-04-11T22:00:00.000Z","location":"Muse Gallery","description":"Solo show exhibition of Elizabeth Lennie's most recent oil paintings"},{"title":"Emerging Writers Salon","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:30:00.000Z","location":"Hart House","description":"The Hart House Literary and Library Committee invites all emerging writers from any background—especially students—to connect, engage, support, and learn from each other. This year’s salon features talented student writers, and our featured alumna, Doyali Isla..."},{"title":"Foie Week","date":"2019-04-11T15:45:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Biff's Bistro","description":"Join us from April 11 – 21 to experience a specialty menu you won’t soon foieget!\nWith dishes like Foie Gras Poêlé, served with a Niagara peach flapjack and peanut marzipan, or our Heritage Chicken & Foie Gras Pot au feu in a delicious black truffle broth, wit..."},{"title":"Four Old Legs","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T02:00:00.000Z","location":"The Citadel: Ross Centre for Dance","description":"Citadel + Compagnie presents the world premiere of Canadian dance luminary James Kudelka’s Four Old Legs, running April 12-13 & 17-20, 2019 at 8pm, and on April 14 at 4pm, at the Citadel: Ross Centre for Dance. Citadel + Compagnie’s resident choreographer and ..."},{"title":"Free Expression and National Interests: The Case of China","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Ryerson University","description":"As U.S. cultural influence slips, China is ramping up its use of cultural, educational and diplomatic initiatives to influence and control expression and its image in Canada and elsewhere.\nJoin a panel of experts to explore current Chinese government initiativ..."},{"title":"Gardening Blogger Emma Biggs at Toronto Botanical Garden","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Emma Biggs, garden blogging teenager, knows a lot about growing tomatoes. She will discuss how to fit many tomatoes into a small space, ways to prune and train them, and how to start and save seeds. Emma has grown more than 100 tomato varieties and will share ..."},{"title":"Gardening in the Shade - Toronto Master Gardener Workshop","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T00:00:00.000Z","location":"Brentwood Library","description":"Say yes! To a lush and lively shade garden: (1) Types of shade and how to identify them; (2) Why shade is an opportunity; (3) Bringing more light into the garden; (4) Improving soil to enhance plant vigor; (5) Choosing the right plants for your garden; (6) Per..."},{"title":"Gianna Lauren and Joshua Van Tassel","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T02:30:00.000Z","location":"Enoch Turner Schoolhouse","description":"Join ambient singer-songwriter Gianna Lauren from Halifax with electro-acoustic composer Joshua Van Tassel for a special evening at Enoch Turner Schoolhouse in Toronto, ON.\nHosted by Enoch Turner Schoolhouse, and booked by Side Door.\nTickets $20.00. Visit the ..."},{"title":"Great Dramas Series - Madame Bovary - 2014 Movie","date":"2019-04-11T17:00:00.000Z","endTime":"2019-04-11T19:00:00.000Z","location":"Brentwood Library","description":"Bored in her marriage to a country doctor and stifled by life in a small town, the restless Emma Bovary pursues her dreams of passion and excitement, whatever they may cost.\nBased on the novel by Gustave Flaubert.\n2014 Movie. 118 minutes. Rated 14A. Ratings no..."},{"title":"Healing: A Collection of New Paintings by Sonya Spilkin","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Liberty Market Lofts Gallery","description":"“Healing” explores processes of recovery, mending, and regeneration while working through the challenges and celebrating the milestones which accompany them.\nCreated as a response to and as a way of coping with recovery from an accident, Spilkin addresses ways..."},{"title":"Inspirations Studio Spring Sale and Open House","date":"2019-04-11T16:00:00.000Z","endTime":"2019-04-11T21:00:00.000Z","location":"Inspirations Studio","description":"Please join us for our 25th Annual Spring Open House and pottery sale. Come support the makers at our studio and storefront for women who have been impacted by poverty, homelessness, mental health and addiction. Join us for tea and check out gifts that give ba..."},{"title":"Life - four billion years in the making","date":"2019-04-11T15:00:00.000Z","endTime":"2019-04-11T17:00:00.000Z","location":"Royal Ontario Museum","description":"Discover the ROM's newest permanent gallery project dedicated to the story of the dawn of life. This new space will bring visitors on a journey from the origin of life itself, close to 4 billion years ago, to the dawn of dinosaurs, roughly 200 million years ag..."},{"title":"Lighthouse Labs Toronto Demo Day","date":"2019-04-11T22:00:00.000Z","endTime":"2019-04-12T00:00:00.000Z","location":"Shopify","description":"It's time for our new grads to show off what they've learned in just 10 weeks!\nDemo Day is back! Our new Web grads are about to start their careers as professional web developers; but first they want to show you what they've learned to build in just 10 weeks w..."},{"title":"Mindbender Supreme, Ekelle, Peppermint","date":"2019-04-12T01:00:00.000Z","endTime":"2019-04-11T06:00:00.000Z","location":"Handlebar","description":"It's finally here! The official album release party of MINDBENDER Supreme and PEPPERMINT's new double album JOURNEY INTO SOUND: New Colours; New Dimensions; New Values.\nPlease bring your SEXY selves out to a night of innovative live MUSIC and also to celebrate..."},{"title":"Mockingbird: An Improv Comedy Mockery","date":"2019-04-12T01:30:00.000Z","endTime":"2019-04-12T02:30:00.000Z","location":"Social Capital Theatre","description":"Toronto's best improvisers perform in this daring and innovative improv comedy show. Talented and hilarious improvisers recreate and exaggerate an entire long form set, which leads to high energy performances and unexpected moments."},{"title":"Neighbourhood Trust What's Next?","date":"2019-04-11T22:30:00.000Z","endTime":"2019-04-12T00:30:00.000Z","location":"Lakeshore Arts","description":"Join Lakeshore Arts as the physical space for the Neighbourhood Trust comes to a close, how do we continue to come together and discuss the neighbourhood’s pressing issues?\nArtist Hiba Abdallah will lead a panel discussion alongside local community members who..."},{"title":"PUNK 'TILL YER DRUNK! with DJ Ol' Nerdy Bastard","date":"2019-04-12T02:00:00.000Z","endTime":"2019-04-11T06:00:00.000Z","location":"Swan Dive","description":"Punk Rock & Cheap drinks!\n*FREE*"},{"title":"Pusateri's Food & Wine Pairings Event","date":"2019-04-11T21:30:00.000Z","endTime":"2019-04-11T23:30:00.000Z","location":"Saks Food Hall by Pusateri's (Queen Street)","description":"As the first in our Sips & Snacks Workshop Series, guests will enjoy a guided tasting with Halpern Expertises. We’ll be taking you through 6 exquisite samplings as well as savoury bites from Pusateri’s - such as our signature Italian cheeses, cured meats & oli..."},{"title":"Secret RSVP Live-Matched Movies & Travel Singles Games Night","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:30:00.000Z","location":"Firkin on Bloor","description":"Don't enjoy the awkward, run-of-the-mill speed dating and singles events? Tired of endless swiping dating app games? We don't blame you.\nSecret RSVP, the world's 1ST LIVE-MATCHED singles events experience, launched in Toronto to a sold-out crowd of close to 60..."},{"title":"She's Come Undone, Westlake and Chasing Sam Live at the Linsmore Tavern!","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-11T04:00:00.000Z","location":"Linsmore Tavern","description":"From Etherial Dark Wave/Alt Rock, Straight up in your face Rock and Roll, to Indie Rock/Punk. Something for everyone!! Don't miss this show!\nSet Times:\n8:30pm Unofficial: She's Come Undone\n9:30pm WESTLAKE\n10:30pm Chasing Sam\nCover: $5 @ the door"},{"title":"Super Hot Date Night: Comedy Inspired By Dating Stories","date":"2019-04-12T01:30:00.000Z","endTime":"2019-04-12T02:30:00.000Z","location":"Bad Dog Comedy Theatre","description":"Comedians take stories of dates (gone well or bad or sideways) and spin them into hilarious comedy. Fire up your Tinder and get here!"},{"title":"TAGGED Film Screening","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T03:00:00.000Z","location":"Ryerson University - Rogers Communications Centre","description":"Tagged is a film that highlights the murder of a promising young black youth and the continuous grief of a family and community riddled with pain as they deal with the loss while battling to dispel stereotypes and tags that suggest that black youths who died b..."},{"title":"The Art of Dance Workshop with Aziza Brown","date":"2019-04-11T22:00:00.000Z","endTime":"2019-04-12T00:00:00.000Z","location":"5183 Sheppard Ave E","description":"Discover the history and evolution of dance as influenced by hip-hop, afro, and dancehall! Then learn unique routines that challenge you to express feelings and emotions through movement. Travel through time and cultures at The Art of Dance workshop!\nThis work..."},{"title":"Throwback Thursday","date":"2019-04-12T00:00:00.000Z","endTime":"2019-04-12T03:00:00.000Z","location":"Station Bar & Kitchen","description":"Relive some memories with a night of Throwback Live music with Lynn Moffat and with DJ Sarah Jane Reigler !!\n90\"s and 2000's hits with Fun , food & drinks"},{"title":"Toast","date":"2019-04-11T22:30:00.000Z","endTime":"2019-04-12T02:30:00.000Z","location":"477 Richmond Street West","description":"Toast is the newest cooking class series in Toronto focused on providing a unique and memorable culinary experience. Our master classes educate and entertain, by showcasing classic and modern cuisines. Our professional chefs and mixologists bring a wealth of k..."},{"title":"Trials & Tribulations of Growing Tomatoes at Toronto Botanical Garden","date":"2019-04-11T23:00:00.000Z","endTime":"2019-04-12T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Emma Biggs, garden blogging teenager, knows a lot about growing tomatoes. She will discuss how to fit many tomatoes into a small space, ways to prune and train them, and how to start and save seeds. Emma has grown more than 100 tomato varieties and will share ..."},{"title":"Wonk Prom","date":"2019-04-12T00:30:00.000Z","endTime":"2019-04-11T04:00:00.000Z","location":"Steam Whistle Brewing","description":"Are you a wonk? Do you have a passion for public policy, politics and change-making?\nRyerson Leadership Lab invites you to attend Wonk Prom 2019 and join friends from across the country for a night of networking, music and celebration.\nWhen: Thursday, April 11..."},{"title":"ALKALINE Live in Concert Toronto 2019","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T07:00:00.000Z","location":"Chandni Victoria Banquet & Convention Centre","description":"Rodeo Promo & The 6 Lifestyle presents ALKALINE Live in Concert!!! April 12th 2019 Dancehall Superstar ALKALINE returns live with his full band to heat up the city. The Vendetta boss plans to create history with his planned Canadian tour. DOORS OPEN 10 PM Host..."},{"title":"Buy Good. Feel Good. Expo 2019","date":"2019-04-12T21:00:00.000Z","endTime":"2019-04-12T21:00:00.000Z","location":"Enercare Centre","description":"Our choices matter! \"Buy Good. Feel Good.\" Expo is coming back to Toronto for its sixth edition. Shop North America's largest collection of ethically sourced products and support businesses that make the world a better place. Over 150 exhibitors. 200,000+ Live..."},{"title":"CN Tower Climb Toronto 2019","date":"2019-04-12T10:00:00.000Z","endTime":"2019-04-12T13:30:00.000Z","location":"CN Tower","description":"WWF'S CN TOWER CLIMB FOR NATURE Saturday, April 13 and Sunday, April 14, 2019 Climbing the CN Tower is a rare and exhilarating opportunity to take 1,776 meaningful steps towards a future where nature and wildlife thrive. Register today to climb, enjoy the brea..."},{"title":"Dr. Jane Goodall in Toronto","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T00:30:00.000Z","location":"Ryerson University","description":"See Dr. Jane Goodall live in Toronto. Equipped with little more than a notebook, binoculars, and a passionate interest in wildlife, Jane Goodall ventured into the forests of Tanzania nearly 60 years ago to begin her groundbreaking research on chimpanzees. Si..."},{"title":"Droeloe in Toronto","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Velvet Underground","description":"Embrace Presents DROELOE  w/ FYTCH + TAILS Doors: 10pm 19+ Event DROLOE https://www.facebook.com/droeloemusic https://twitter.com/DROELOEMUSIC https://www.instagram.com/droeloemusic/ FYTCH https://www.facebook.com/FytchMusic https://twitter.com/fytcho..."},{"title":"Pop-Up Neon Gallery","date":"2019-04-12T15:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Junction House","description":"A FREE neon pop-up exhibit is headed to Toronto for just one weekend in April, showcasing signs and art pieces from the collections of Neon Museum Toronto and Neon Demon – including the famed 12-ft. Hard Rock Museum guitar. The three-day gallery is part of a p..."},{"title":"Steve Martin and Martin Short in Toronto","date":"2019-04-12T23:30:00.000Z","endTime":"2019-04-13T03:59:00.000Z","location":"Sony Centre for the Performing Arts","description":"Featuring the Steep Canyon Rangers and Jeff Babko. Sale Dates and Times: Public Onsale : Mon, 3 Dec 2018 at 10:00 AM Front Of The Line by American Express : Thu, 29 Nov 2018 at 10:00 AM Presale Offers : Thu, 29 Nov 2018 at 10:00 AM Official Platinum ..."},{"title":"The Toronto Pancakes & Booze Art Show","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Revival","description":"As the Toronto's premier pop-up art show, The Pancakes & Booze Art Show provides art lovers an opportunity to explore more than 400 pieces of artwork created by some 80+ artists local to Toronto's unparalleled art scene. Alongside an immensely wide variety of ..."},{"title":"163 John St. : FRIDAY SHOWCASE @ THE CORNER","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-12T04:00:00.000Z","location":"The Corner","description":"It's taking place at the newest, hottest comedy club, THE CORNER! FRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna be ..."},{"title":"946 QUEEN ST. EAST : FRIDAY SHOWCASE @ THE CORNER EAST","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-12T04:00:00.000Z","location":"The Corner East","description":"It's taking place at the newest, hottest comedy club, THE CORNER! FRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna be ..."},{"title":"Abstract - Watercolour Skyline Workshop","date":"2019-04-12T22:30:00.000Z","endTime":"2019-04-13T00:30:00.000Z","location":"Fresh Paint Studio","description":"Abstract Watercolour Skyline Workshop In this abstract watercolour workshop, participants will create an abstract city skyline using watercolours on watercolour paper. We will be using the artwork of Bekim Art as a reference to develop our own unique creations..."},{"title":"All About Women Show","date":"2019-04-12T15:00:00.000Z","endTime":"2019-04-13T00:00:00.000Z","location":"International Centre","description":"​The All About Women Show features three fun-filled days of shopping, learning, and exploring with over 240 fabulous exhibitors carrying the latest products and services tailored to women of all ages. For one special weekend only, explore a women’s world broug..."},{"title":"ALTAER","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Christie Pits Pub","description":"Featuring DJs Mistress McCutchan and Deadspiderman, spinning goth, postpunk, and other dark alternatives. There will also be a CD swap - bring a CD, take a CD. Make CD mixes to share! No cover, 19+ in the lower level at Christie Pits Pub."},{"title":"April Exhibitions Opening at Xpace Cultural Centre","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"XPACE (Lansdowne)","description":"Join us for the opening of our April exhibitions! This event is FREE! MAIN SPACE Recess curated by Jaycee Tu Rowena Katigbak, Eric Oh, Lina Wu, Yuma Yanagisawa, Cristine Yunyk. April 12th - May 11th, 2019 As a child in school, a typical day often revolves arou..."},{"title":"Beam Me Up Disco! Now at The Drake!","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:30:00.000Z","location":"Drake Hotel","description":"Beam Me Up’s Disco! Every. Single. Friday. Night. Different spot, same delicious disco flavour! Move your body! Beam Me Up is a Disco jam that celebrates the underrated and the obscure of funk, jazz, soul, boogie, rare groove, reggae, gospel & house! It’s an e..."},{"title":"BIG SOUND Live at THE GREAT HALL","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T07:00:00.000Z","location":"The Great Hall","description":"Toronto's Biggest Motown & Classic Soul Revue: the Big Sound is back with a spring edition of feel good. As per always 30 musicians banging out the greatest soul hits of all time as faithfully as we can and DJ Wes Allen dishing up the biggest dance floor bange..."},{"title":"Brooklynn Bar Comedy - April 12th","date":"2019-04-13T00:30:00.000Z","endTime":"2019-04-13T02:30:00.000Z","location":"Brooklynn Bar","description":"After the last Eight successful monthly Brooklynn Comedy Nights, we are pumped for another. We’ve put together some of the best Pro Comedians in the city with help from 'Perfect 10 Comedy' for a VIP comedy show April 12th. Dance party to follow! | ONLY $10 the..."},{"title":"Carol Zoccoli: How To Beat Up Any Man","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-13T03:15:00.000Z","location":"John Candy Box Theatre - The Second City","description":"Comedian and writer Carol Zoccoli (Winnipeg Comedy Festival, CBC's The Debaters, Comedy Central Brasil) tells us how it was growing up as a woman in Brazil - and her story is told through the men she’s beaten up. How To Beat Up Any Man is a funny and raw tale ..."},{"title":"Casalife Warehouse Sale","date":"2019-04-12T14:00:00.000Z","endTime":"2019-04-12T22:00:00.000Z","location":"Casalife","description":"SPRING WAREHOUSE SALE April 12 - 15 Only at 350 Evans Ave location Up to 50% off in-stock items Up to 75% off select floor models, accessories, lighting and rugs"},{"title":"Celebrating the Poets of Palestine","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"Knife Fork Book","description":"Knife Fork Book presents: Celebrating the Poets of Palestine with Marcello Di Cintio Join acclaimed author Marcello Di Cintio at Knife Fork Book on April 12 for a reading from his book Pay No Heed to the Rockets from 7 to 9 PM. Marcello Di Cintio’s book Pay No..."},{"title":"Clarkson Society of Artists 2019 Art Show & Sale","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Visual Arts Mississauga’s Riverwood Gallery","description":"Annual exhibition of 38 artists offering a creative collection of original oil, acrylic, watercolour and mixed media pieces. Featured artist is Christine van Driel, who paints mostly in acrylics and oils."},{"title":"C'mon Angie!","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"The Assembly Theatre","description":"C’mon Angie! by Amy Lee Lavoie is a thrilling, timely, and exceedingly human new Canadian drama about consent and sexual assault that the Georgia Straight calls, \"visceral, important, life-changing theatre.\" April 12-27, 8:00pm (Tuesdays - Saturdays) $20 - $35"},{"title":"Cooking with Paul: Vodka and Mushrooms","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Tartu College","description":"Friday, April 12 at 7pm, an interactive workshop \"Cooking with Paul: Vodka and Mushrooms\" will take place at Tartu College. Estonia has a long history of producing and enjoying vodka. The first announcement of vodka productions on Estonian soil is from as earl..."},{"title":"CREATE Showcase","date":"2019-04-12T22:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Ryerson School of Performance","description":"On April 12th 2019, emerging artists from School of Performance will hold the 8th annual showcase dedicated to displaying original works of students and inspiring career development with guest speakers in the entertainment industry. The event is not only a sho..."},{"title":"Design Forces","date":"2019-04-12T12:30:00.000Z","endTime":"2019-04-12T14:00:00.000Z","location":"Toronto International Design Centre","description":"FRESH FROM HIGH POINT MARKET! Kimmberly Capone Interior Design brings back High Point's finest moments to Canada through an in-depth presentation! 8:30 am: full breakfast by Chef Tawfik - please email tidc@internationalcentre.com with any dietary restrictions ..."},{"title":"DIRT NAP with DJ Davey D","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Swan Dive","description":"Scratchy-ass retro & classic rock gems spun by the one & only king of garage sale vinyl, DJ Davey D!"},{"title":"Dirty Pop: A Boy Band Bash!","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:30:00.000Z","location":"Clinton's Tavern","description":"On Friday April 12 we're celebrating all our favourite boy bands at DIRTY POP! Backstreet Boys, One Direction, and everything in between - we've got all your boy band needs covered. Let's drink, dance, and scream-sing along to all the songs we never realized w..."},{"title":"DJ Misty and The Blue Demon","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Handlebar","description":"Friday April 12 - 10pm - FREE\nFOR ONE NIGHT ONLY BACK FROM THE FM DIAL... THE DEMON’S LAIR!\nIt’s been a minute but after co-hosting The Demon’s Lair on CKLN 88.1fm for 5 awesome years, DJ’s Misty and The Blue Demon are getting behind the decks together again!\n..."},{"title":"Documentary: Listen up: the lives of Quincy Jones","date":"2019-04-12T18:00:00.000Z","endTime":"2019-04-12T20:00:00.000Z","location":"Toronto Reference Library, Hinton Learning Theatre, 3rd floor","description":"An unconventional style of documentary reveals the life of the legendary musician, arranger, composer and producer."},{"title":"Far. The Story of a Journey Around the World","date":"2019-04-12T22:00:00.000Z","endTime":"2019-04-13T00:08:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Embark on an unforgettable journey to China, Pakistan, India and beyond with a young couple travelling the world on an epic 50,000 km hitchhike. Travelling for over three years with hardly any money, and refusing to take any planes, the charismatic duo makes t..."},{"title":"Fauxcella -  A music festival for the rest of us.","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T18:30:00.000Z","location":"Round","description":"Juicy Moon Presents: FAUXChella a music festival for the rest of us.\nAre you jealous of your friends going to Coachella this year? Well dont worry too much there is Fauxchella a night parodying the festival, right here in Toronto. Get into the summer spirit be..."},{"title":"Free Roti & Samosas at Butter Chicken Roti","date":"2019-04-12T15:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"Butter Chicken Roti","description":"Butter Chicken Roti is continuing to expand its empire with a new location in downtown at 201 King St E (across George Brown College)! Since launching in 2013, roti lovers across town will be especially excited to learn of this much larger space in comparison ..."},{"title":"Future Fierce: Drag Pageant","date":"2019-04-12T23:30:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"The Redwood Theatre","description":"Future Fierce: Drag Pageant is a pageant that consists of drag queens who get to compete for their chance to be crowned Miss Future Fierce of Toronto!\nA total of 5 drag performers will compete in 3 segments: an intro with a slayin' futuristic look, a talent po..."},{"title":"Game of Thrones Trivia Night","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"H Bar","description":"Rev yourselves up before the season premiere of Game of Thrones with a little GoT trivia night! As always, it’s free to play but we do suggest booking your teams in well in advance, as space is sure to go fast!\nFriday, April 12th @ 8PM\nWin a $50 bar tab\n$5.50 ..."},{"title":"Hiromi","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"Toronto Centre for the Arts","description":"Since bursting onto the music scene in 2003, Hiromi has electrified audiences and critics east and west, with a creative energy that encompasses and eclipses the boundaries of jazz, classical and pop parameters, taking improvisation and composition to new heig..."},{"title":"How To File A Simple Tax Return","date":"2019-04-12T18:00:00.000Z","endTime":"2019-04-12T19:30:00.000Z","location":"Riverdale Branch, Toronto Public Library","description":"A representative from the Canada Revenue Agency (CRA) will facilitate the Teaching Taxes course. The course will help you understand why you pay taxes and how taxes are used. It also teaches the basics of taxation, right and responsibilities as a taxpayer and ..."},{"title":"ICFF Monthly Screening - The Place","date":"2019-04-13T01:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"TIFF Bell Lightbox","description":"Italian Film - English Subtitles\nA mysterious man sits everyday at the same table of the same restaurant, continuously receiving visitors. Each of his clients wants something, driven by a deep desire, a desire that is difficult to realize, if not impossible. T..."},{"title":"Impressionism","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Alumnae Theatre","description":"Alumnae Theatre Company presents Michael Jacobs’ \"Impressionism\" (April 12-27, 2019)\nA romantic comedy that blends pathos, intellect, and wit. Surrounded by impressionist paintings, colleagues Katharine (the gallery owner), and Thomas (a former photojournalist..."},{"title":"INTERACTIVE SINGLES NIGHT FOR TORONTO PROFESSIONALS!","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Old School","description":"IT'S TIME FOR A NEW KIND OF SINGLES EVENT!\nJoin us for a light-hearted, relaxed and interactive singles evening!\n- Are you ready to get your head out of your app, and connect in person, in a fun, genuine and relaxed environment?\n- Are you ready to have playful..."},{"title":"Iyengar: The Man, Yoga, and the Student's Journey","date":"2019-04-13T01:00:00.000Z","endTime":"2019-04-13T02:45:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Hailed as \"the Michelangelo of yoga\" and considered to be one of the most important masters in the world, B.K.S. Iyengar is credited with bringing the ancient art of yoga to the modern masses. Born in Southern India 100 years ago, the legendary guru is the fou..."},{"title":"James King & The Midnight Hours/Claire Hunter/Sheldon Hunt LIVE @ The Cameron House","date":"2019-04-13T01:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Cameron House","description":"James King & The Midnight Hours, Claire Hunter and Sheldon Hunt are thrilled to be bringing their original music to the legendary Cameron House. Come out for what is sure to be a spectacular night of music, songwriting and rock n roll with three local Toronto ..."},{"title":"Kicking Test Anxiety in the Butt! FOR HIGH SCHOOL KIDS","date":"2019-04-12T20:30:00.000Z","endTime":"2019-04-12T22:00:00.000Z","location":"The Math Guru","description":"Did you know that 85% of all students feel some sort of anxiety when it comes to test taking? Seriously - you're not alone! If you're like most people, you get stressed before tests - and even MORE stressed before exams! Maybe you have a little knot in your st..."},{"title":"Laraaji with special gues Joseph Shabason","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"Toronto Spiritualist Temple","description":"Telephone Explosion, Morning Trip & Burn Down The Capital Present:\nLARAAJI (https://laraajimusic.bandcamp.com)\nLaraaji is a musician, mystic and laughter meditation practitioner based in New York City. He began playing music on the streets in the 1970s, improv..."},{"title":"Mas Sajady at the Total Health Show, Toronto","date":"2019-04-12T20:00:00.000Z","endTime":"2019-04-12T23:00:00.000Z","location":"Metro Toronto Convention Centre (MTCC)","description":"Through two near death experiences Mas Sajady was gifted with extraordinarily potent abilities to help you transform any area of your life - physical, financial, spiritual, relationships - with rapid, tangible and documented results.\nMas' abilities allow him t..."},{"title":"PAINT PUFF PASS","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"Secret Space","description":"Come enjoy the coolest thing since sliced bread.\nIts like Paint Night but like way better.\nExplore the creative side you didn't know you had.\nExpect to indulging in delicious treats, refreshing beverages all while laughing and creating with like minded locals ..."},{"title":"Raven Chacon Mini-Festival","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"Music Gallery","description":"Arraymusic, The Music Gallery, and Native Women In The Arts present\nRaven Chacon Mini-Festival\nFriday – Sunday\n04.12 – 14.19\nWe are pleased to team up with Arraymusic once again together alongside Native Women In The Arts to present the Raven Chacon mini-festi..."},{"title":"Refugee Art Project","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"Marilyn Brewer Community Space","description":"This is a showcase by the Toronto Global Shapers.\nTHE ARTS SHOWCASE 🎨\nThe Toronto Global Shapers will be hosting the Refugee Art Project, a multimedia showcase featuring art and live performances in support of Love Without Borders, a grassroots organization t..."},{"title":"Remember Sports w/ Pony @ The Rec Room","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T03:00:00.000Z","location":"The Rec Room","description":"Remember Sports' peppy indie powerpop encapsulates the melancholy and excitement of growing up. Lead singer Carmen Perry has an earnest lyrical approach; detailing her own pain and progress in vivid, animated detail. Remember Sports? You're about to.\nWith spec..."},{"title":"Rish Bridal Trunk Show","date":"2019-04-12T14:30:00.000Z","endTime":"2019-04-12T23:30:00.000Z","location":"Sash & Bustle","description":"Sash & Bustle is excited to announce Rish Bridal’s 2019 collection. This trunk show will be full of perfectly fitting silhouettes with fabulous fabrics to make any boho bride excited. You will not want to miss this Israeli’s designers newest collection in stor..."},{"title":"Rope Bondage for Beginners","date":"2019-04-12T23:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Good For Her","description":"What’s so hot about rope bondage? What skills do you need to get started? How do you keep everyone safe? Come to this workshop to learn about rope as a tool for bondage and how to build skills for a sexy rope bondage scene."},{"title":"Showdown: A Burlesque Game Show!","date":"2019-04-12T23:30:00.000Z","endTime":"2019-04-13T02:30:00.000Z","location":"Dance Cave","description":"It's the ultimate one-two punch: five dazzling burlesque performances bookended by five ridiculous party games. What more could you want on a Friday night?\nWhat exactly is Showdown all about? We take brave volunteers from our audience, and have them compete in..."},{"title":"SoQu Presents: Tea Base & Chill","date":"2019-04-12T20:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Tea Base","description":"SoQu [sober queers] is a new monthly meet up for queer and trans folx who just want to chill and socialize in an environment that is free of alcohol! Come over to Tea Base (located in the basement of the Chinatown centre) for some tea, board games, video games..."},{"title":"Studio 102 Grand Opening","date":"2019-04-12T21:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Studio 102","description":"Artists Rob Croxford and Karen Taylor, and photographer Jessica Lin have moved into a new studio together and are ready to show it off to the world!\nCome to Studio 102 on Friday April 12th or Saturday April 13th and see their new home and some of the new work ..."},{"title":"Styleworthy #stylesummit","date":"2019-04-12T15:00:00.000Z","endTime":"2019-04-12T21:00:00.000Z","location":"International Centre","description":"​AUTHENTIC UNAPOLOGETIC CONVERSATIONS ABOUT STYLE & SELF\n​Presenting The Styleworthy #stylesummit at the All About Women’s Show where founder, Jennifer Rabanillo will host a daily panel showcasing a Powerhouse of influencers, inspirers and creatives.\nWithin th..."},{"title":"Sunset Culture Club","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Farside","description":"All vinyl rare party jams and audio explorations with DJ Morgan Yew. Free!"},{"title":"Sushi Making for Millennials","date":"2019-04-12T22:00:00.000Z","endTime":"2019-04-13T00:00:00.000Z","location":"Bloor/Gladstone Library","description":"Move beyond the microwave and Uber Eats. Learn about the art of sushi making with celebrated chef and award-winning author Kim Sang. Kim will teach you how to make 3 different rolls. All supplies are provided. This is a free event.\nRegistration required. Regis..."},{"title":"Swing Dance Lesson & Live Band Social!","date":"2019-04-12T23:30:00.000Z","endTime":"2019-04-12T04:00:00.000Z","location":"Lindy Hop Revolution","description":"Join us for our monthly Swing Dance! Swing dancing is a social dance that is full of joy and a good way to meet a lot of people. Everyone is welcome! We will have a drop-in beginner lesson followed by a dance with Juno-nominated Alex Pangman & Her Alleycats! N..."},{"title":"Taoist Tai Chi Beginning Weekend: Learn 108 Moves in 3 Days","date":"2019-04-12T22:30:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Knox Presbyterian Church","description":"You'll start learning the 108 moves of our set and be introduced to a Taoist art that helps calm the mind and transforms you into a healthier and more harmonious person. The weekend starts on Fri. Apr. 12, 7-9 p.m. (registration opens 6:30 p.m.) and Sat. Apr. ..."},{"title":"Tequila O'Clock - A Social Tequila Tasting Event","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T02:00:00.000Z","location":"525 Adelaide Street West","description":"Tequila O’clock is the best time of the day! Join us on Friday, April 12th from 8-10 PM for a tasting of 1 tequila, 2 tequila, 3 tequila… 4 different types of tequila! Enjoy a margarita cocktail reception, followed by a sit-down structured tasting and tutorial..."},{"title":"The Buy Good. Feel Good. Expo Opening Reception","date":"2019-04-12T21:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"Enercare Centre","description":"“Every time you spend money, you're casting a vote for the kind of world you want.” ~ Anna Lappé\nFrom fashion and beauty to lifestyle and travel, the Buy Good. Feel Good. Expo celebrates the power of the conscious consumer.\nEnjoy a VIP shopping experience with..."},{"title":"The Chicago Project Returns to the Linsmore Tavern!","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-12T04:00:00.000Z","location":"Linsmore Tavern","description":"We are so excited to welcome back one of the very best live bands you will ever see, The Chicago Project featuring the music of Chicago and so much more to the Linsmore Tavern on Friday April 12! Yes we will be squeezing in this legendary 9 piece cover band wi..."},{"title":"The Sad Blisters","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T01:30:00.000Z","location":"The Commons Space","description":"Glass Hammer Productions proudly presents the world premiere of Andrew Batten’s comedy “The Sad Blisters”, April 12-27 at The Commons Space. The play, directed by Victoria Shepherd, is loosely based on the family dynamic of the playwright's wife, Debbie Batten..."},{"title":"Trade: Big Tree Energy","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T06:00:00.000Z","location":"Black Eagle","description":"The rosebuds are beginning to bloom and the pussy willows will be bursting. Spring has returned and time for us to get naked, suckle on the nectars and closer to nature.\nFulfilling all your big tree energy fantasies is dreamboat arborist Dillon\nA few ideas of ..."},{"title":"Tricky Moreira's Annual Birthday Bash!","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-12T07:00:00.000Z","location":"One Loft","description":"On Friday April 12th come celebrate Tricky Moreira's annual This House Birthday Party at One Loft!\nMoreira will be spinning an extended DJ set to celebrate life and music, and is bringing some very talented friends along to play special guest DJs sets (announc..."},{"title":"Weird Al Karaoke","date":"2019-04-13T02:00:00.000Z","endTime":"2019-04-13T03:15:00.000Z","location":"Comedy Bar","description":"Weird Al Karaoke is the comedy show where comedians write and perform their own parodies of popular songs, over karaoke tracks!"},{"title":"Zero Hour Improv - April 2019","date":"2019-04-13T00:00:00.000Z","endTime":"2019-04-13T01:00:00.000Z","location":"Social Capital Theatre","description":"Welcome to Zero Hour Improv, the show with the most improv at the best price!\nZero Hour is 60 mins of pure comedy. It features the best improv troupes in Toronto on a non stop roller coaster of Improv. Come join in on the action!\nFeaturing:\nPaul and the Blarts..."},{"title":"AGAINST THE CURRENT","date":"2019-04-13T22:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Velvet Underground","description":"Collective Concerts Presents Against The Current  Saturday, April 13th Velvet Underground Toronto, ON Doors 6pm / All Ages Collective Concerts Presale starts Thursday, December 13th at 10am. https://www.ticketfly.com/purchase/event/1801362 All tickets o..."},{"title":"Barkworks 2019","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Evergreen Brick Works","description":"Barkworks is Toronto’s latest festival for families and their four-legged friends to come together and enjoy a fun day of Easter egg hunting, live entertainment, activities, and a variety of pet-friendly vendors at our puppy pop-up market. Proceeds from the ..."},{"title":"Get Out","date":"2019-04-14T00:30:00.000Z","endTime":"2019-04-14T03:30:00.000Z","location":"TIFF Bell Lightbox","description":"Welcome to the sunken place. Get Out if you can. 💺 Experience Jordan Peele’s (Us) Oscar-winning “social thriller” that brilliantly decentres our culture’s fear of the Other and skewers white liberal racism. African American photographer Chris reluctantly ..."},{"title":"Orville Peck","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"The Great Hall","description":"Collective Concerts Presents Orville Peck Saturday Apr 13, 2019 Doors: 8:00 PM 19 and over $13 Longboat Hall at The Great Hall  1087 Queen St. W  Toronto, ON"},{"title":"Parkdale Flea 2019","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T22:00:00.000Z","location":"Northern Contemporary Gallery","description":"We've moved and our first flea of 2019 in our new space is coming up this Spring! Save the date for April 13 and May 11 (Spring into Parkdale Festival). Vintage pieces, clothing, to Skincare, Crafts, Accessories, Confections and more! New vendors, new space, n..."},{"title":"Record Store Day 2019","date":"2019-04-13T13:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Multiple Venues","description":"Celebrating the culture of the indie record store 24/7/365.  The twelfth annual Record Store Day takes place worldwide on 4/13/19."},{"title":"Street Machine Market","date":"2019-04-13T14:00:00.000Z","endTime":"2019-04-13T23:00:00.000Z","location":"Milk Toronto","description":"Street Machine Market is Toronto's newest vendor market focused specifically towards up and coming streetwear/ lifestyle brands. This market was conceptualized to fill the void in the Toronto scene for new streetwear/ lifestyle brands that are being establishe..."},{"title":"Toronto MEC Store Grand Opening","date":"2019-04-13T13:00:00.000Z","endTime":"2019-04-13T23:00:00.000Z","location":"MEC","description":"We've been hard at work since breaking ground on our new home at Queen St and we're stoked to host you at our Grand Opening on April 13th & April 14th. The Toronto Flagship isn’t just a store, it’s a hub for the outdoor community – and the next best thing to..."},{"title":"Wavelength Monthly Music Series","date":"2019-04-13T13:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Brothers Dressler","description":"Wavelength Monthly Music Series April 2018 featuring: I am Robot and Proud (Toronto / computer pop since the year 2001) Thanya Iyer (Montreal / sparkling experimental pop) World News (Toronto / psychedelic synth duo) + General Chaos Visuals ++ Precious Jewel (..."},{"title":"Wintersleep in Toronto","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"The Danforth Music Hall","description":"Collective Concerts Presents Wintersleep with Partner Saturday, April 13 The Danforth Music Hall Toronto, ON Doors 7pm / 19+ Collective Concerts Presale starts Wednesday, December 12th at 10am. https://www1.ticketmaster.ca/wintersleep/event/10005589154..."},{"title":"163 John St. : SATURDAY SHOWCASE @ THE CORNER","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-13T04:00:00.000Z","location":"The Corner","description":"It's taking place at the newest, hottest comedy club, THE CORNER! SATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna b..."},{"title":"#1 Dirty Comedy Show in Canada: The Dirty North sponsored by Fleshlight at Comedy Bar","date":"2019-04-14T02:45:00.000Z","endTime":"2019-04-14T03:55:00.000Z","location":"Comedy Bar","description":"The Dirty North Comedy show is Canada's #1 Dirty Comedy show sponsored by Fleshlight. The Dirty North has sold out over 40 times in the last 4 years with some of the top Comedians in North America who have been featured on Netflix, Comedy Central, Just For Lau..."},{"title":"2019 Saturday Family Clay!","date":"2019-04-13T17:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"LucSculpture","description":"Every Saturday is a family art day at LucSculpture. Call us and book a spot for your family and friends to make clay sculpture and hand built ceramics. We will fire the clay pieces for you! Reunite the family doing art and it is fun for everyone! Time: Every S..."},{"title":"2019 Scruff Social","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T02:00:00.000Z","location":"District 28 Bar Bistro","description":"The Scruff Social returns for its third year on April 13th, 2019! Save Our Scruff invites you to join us for an unforgettable night that gives a chance for dog lovers to celebrate, support, and pay tribute to scruff’s past, and those yet to come in our care. T..."},{"title":"946 QUEEN ST. EAST : SATURDAY SHOWCASE @ THE CORNER EAST","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-13T04:00:00.000Z","location":"The Corner East","description":"It's taking place at the newest, hottest comedy club, THE CORNER! SATURDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna b..."},{"title":"ADVOCATS BIG BAND AT THE REX HOTEL!","date":"2019-04-13T19:30:00.000Z","endTime":"2019-04-13T22:30:00.000Z","location":"The Rex Hotel","description":"Saturday, April 13th is your chance to catch the Advocats Big Band at The Rex Hotel from 3:30 to 6:30 pm. Why not spend a delightful Saturday afternoon hanging out with us, hearing so many of your favourite big band tunes? The Rex, located at 194 Queen Street ..."},{"title":"All Fools Arbour Easter Eggs - Holodeck Follies","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T01:30:00.000Z","location":"Comedy Bar","description":"The Dandies present... Holodeck Follies - Spontaneous Star Trek Canada's longest running Star Trek parody show for Trekkies and non-Trekkies. Saturday, April 13, 2019 8:00 p.m. at Comedy Bar Admission: $15 Featuring stand-up comedy from Garrett Jamieson and ou..."},{"title":"Babes Who Brunch by The Ace Class","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T17:00:00.000Z","location":"Joe Bird","description":"Our April Babes Who Brunch features local boss babe Kat Gaskin, a graphic designer, content planning expert, and creator of The Content Planner - the first and only physical planning system for your blog and social content. Kat helps discouraged business owner..."},{"title":"Balls of Fury Dodgeball Tournament","date":"2019-04-13T14:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Bloor C.I.","description":"WHAT: 6 on 6 Dodgeball Tournament. This is a co-ed tournament (minimum of 2 of each gender on the court at all times). Teams will play a minimum of 4 x 25 minute games. For this tournament, we are accepting both INDIVIDUAL and FULL TEAM registrations! REFS: Yo..."},{"title":"Bar Phlie with DJ More or Les","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T06:00:00.000Z","location":"Farside","description":"No cover! Rapper/producer/DJ More Or Les plays the tunes with a Hip Hop slant to move you, whether it's just a head-nod or a full-on shake-a-thon. You can easily hear A Tribe Called Quest, Dibia$e, J Dilla, Bonobo, TLC, Art of Noise, Roisin Murphy, The Interne..."},{"title":"Bengali New Year Comedy Night","date":"2019-04-14T01:00:00.000Z","endTime":"2019-04-14T02:30:00.000Z","location":"Comedy Bar","description":"Did you know that aside from being incredibly attractive, Bengali people are also exceedingly talented? Celebrate Pohela Boishakh (Bengali New Year) with an evening of music, sketch, and standup by an all-Bengali cast and crew! Funny people include: Danish Anw..."},{"title":"Black Sheep Comedy's Stand Up @ Big Rock Brewery","date":"2019-04-13T23:30:00.000Z","endTime":"2019-04-14T02:30:00.000Z","location":"Big Rock Brewery","description":"Join Black Sheep Comedy @ Big Rock Brewery in Etobicoke for an incredible night of comedy and delicious craft beer! Each ticket comes with a free 12oz beer or pop, and you will see some of the best comedians in the city, including: Headliner Hisham Kelati Feat..."},{"title":"BLEACH: All 90's Alternative Video Dance Party","date":"2019-04-13T17:00:00.000Z","endTime":"2019-04-13T07:00:00.000Z","location":"Remix Lounge","description":"Sat April 13, 2019 - Living On Video Presents - BLEACH: All 90's Alternative Video Dance Party with DJ Lazarus RSVP: https://www.facebook.com/events/2238048292914766/ (please SHARE and INVITE your friends) The first BLEACH of 2019 in January was so much fun. A..."},{"title":"Brunch and Beach Clean Up!","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Woodbine Beach","description":"A get together for outdoorsy self-identifying women who love the planet and want to meet like-minded others in their community! Join us at a cozy sandwich shop in the beaches for a casual afternoon Woodbine beach clean up! Brunch spot: Yum Croissants Popular f..."},{"title":"Bump In The Night with special guest DJ Chris Joynt","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T06:00:00.000Z","location":"Swan Dive","description":"👯‍♀️Rock👯‍♂️Soul👯‍♀️Classic Pop👯‍♂️Rarities👯‍♀️ COME SHAKE YER RUMP! *free*"},{"title":"Cabbagetown Bunny Hop","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T17:00:00.000Z","location":"Carlton and Parliament","description":"Come join the FREE fun including bunny selfies, refreshments, kids activities, free books, music and more."},{"title":"Casual Chess Club","date":"2019-04-13T18:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Join other chess players in a friendly and welcoming environment for casual play. All ages and skill levels are welcome. Drop in. No registration required. Audiences: Adult • School-Age Children • Teen Categories: Hobbies Crafts & Games"},{"title":"Cathedral Bluffs Symphony Orchestra - Elgar, Saint-Saens, and more!","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T02:00:00.000Z","location":"Chinese Cultural Centre of Greater Toronto","description":"The Cathedral Bluffs Symphony Orchestra, under the direction of Norman Reintamm, continues its 2018-19 season with the Annual Fundraising Concert and Silent Auction on Saturday, April 13, 2019 at 8:00 p.m. Silent Auction opens at 7:00pm. Guest artists include ..."},{"title":"Cedarvale Marketplace Day","date":"2019-04-13T14:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Cedarvale Community School","description":"Join us for a memorable shopping and food experience at the annual Cedarvale Marketplace Day on Saturday April 13 from 10:00-4:00! A fabulous way to spend the day! There will be professional vendors with an array of sensational items available in time for Moth..."},{"title":"Creative Tarping Course","date":"2019-04-13T16:00:00.000Z","endTime":"2019-04-13T20:30:00.000Z","location":"High Park Subway Station","description":"Hey folks! Wild Ones Wilderness is teaching a course in Creative Tarping! We will be teaching not only the fundamentals of a good tarp shelter/system but also the fine points and tricks in order for you to use your tarp in the most efficient way for any situat..."},{"title":"Curator's Tour And Neighbourhood Walk","date":"2019-04-13T18:00:00.000Z","endTime":"2019-04-13T19:30:00.000Z","location":"Onsite Gallery","description":"Lisa Deanne Smith, curator of How to Breathe Forever, will guide visitors through a tour of the exhibition, followed by a 30-45 minute walk in the local vicinity, paying special attention and attempting to shift perspectives of how to observe and respect local..."},{"title":"Danforth Fight Night: Live Boxing in the Heart of Greektown.","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-13T05:00:00.000Z","location":"Eastminster United Church","description":"Danforth Fight Night will feature top amateur boxers from across the GTA seeking glory in the ring in the Heart of Greektown. The event will also feature a DJ, showcase local food vendors, craft beers and spirits and celebrate the Danforth Community."},{"title":"Don Quixote // Performance on Screen","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Cervantes’s story of the bumbling knight Don Quixote has inspired countless artistic interpretations. The Royal Ballet returns to our screen with Marius Pepita’s exuberant take on this joyful classic of love and friendship, revived for 2019 by acclaimed Cuban ..."},{"title":"Easter Bunny Photo Days","date":"2019-04-13T16:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"PetSmart","description":"Hop in to any PetSmart store across Canada April 13-14 from 12pm to 4pm, for a FREE photo with the Easter Bunny! Bring the whole family - pets too."},{"title":"Editrix, Future Machines, Deanna Petcoff","date":"2019-04-14T01:00:00.000Z","endTime":"2019-04-13T05:30:00.000Z","location":"Handlebar","description":"EDITRIX (https://editrix.bandcamp.com) Improviser Wendy Eisenberg stops through Toronto with her rock power trio FUTURE MACHINES (https://futuremachinesfuturemachines.bandcamp.com) A power trio that digs deep into a sweet spot between math rock and Sonny Sharr..."},{"title":"Foul Play!","date":"2019-04-13T22:30:00.000Z","endTime":"2019-04-14T01:30:00.000Z","location":"The Chelsea Hotel","description":"The intrigue begins when you meet some colourful characters around dessert time., as you finish your fabulous meal. The plot thickens when somebody you've just met... dies! A detective leads the investigation. The suspects are spread throughout the room. So, y..."},{"title":"Hockey Helps the Homeless Bay St. Tournament","date":"2019-04-13T12:00:00.000Z","endTime":"2019-04-13T21:00:00.000Z","location":"Scotiabank Pond","description":"At Hockey Helps the Homeless (HHTH) we believe that everyone should have a place to call home and the supports that they need to thrive. To ensure all homeless Canadians have a fighting chance, we host Pro-Am and Collegiate hockey tournaments across Canada whe..."},{"title":"Horseburner/Jahgernaut/Ol Time Moonshine/Quiet Earth","date":"2019-04-14T01:00:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Bovine Sex Club","description":"Music for the Masses Presents: Sat Apr 13 at The Bovine - Horseburner (WV) https://horseburner.bandcamp.com/ - Jahgernaut https://jahgernaut.bandcamp.com/ - Ol' Time Moonshine https://oltimemoonshine.bandcamp.com/ - Quiet Earth https://quietearthtoronto.bandca..."},{"title":"Inorganic Market - E-Waste Collection","date":"2019-04-13T14:00:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Highland Creek Library","description":"Safely recycle your old electronics at Highland Creek Library. Bring your old computers, phones, televisions etc. for free disposal."},{"title":"Intrigue at the AGO Scavenger Hunt","date":"2019-04-13T17:00:00.000Z","endTime":"2019-04-13T19:30:00.000Z","location":"Art Gallery of Ontario","description":"A famous artist's suspicious death, a vanished journalist, and the legend of da Vinci's hidden trove converge in this art mystery scavenger hunt inside the AGO. When an arts journalist digs into the cold case of a local artist from over 100 years ago, she sudd..."},{"title":"Junior Nature Sketch, Toronto","date":"2019-04-13T13:30:00.000Z","endTime":"2019-04-13T16:00:00.000Z","location":"Multiple Venues","description":"Junior Nature Sketch is an outdoor nature program for kids that focuses on sketching and observing wildlife habitats in unique ecosystems. Guided by a sketch artist and a naturalist, this program encourages children to connect to natural environments in their ..."},{"title":"Kicking Math Anxiety in the Butt! JUNIOR EDITION","date":"2019-04-13T13:30:00.000Z","endTime":"2019-04-13T15:00:00.000Z","location":"The Math Guru","description":"Did you know that 85% of all students feel some sort of anxiety when it comes to test taking? Seriously - you're not alone! If you're like most people, you get stressed before tests - and even MORE stressed before exams! Maybe you have a little knot in your st..."},{"title":"Live Music @ Creeds!","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-14T03:00:00.000Z","location":"Creeds Coffee Bar on Dupont","description":"Doors @ 7pm Show @ 8pm Serving beer, wine & coffeebar drinks all night long! Come join us for some sweet acoustic tunes!"},{"title":"Lo with Special Guests","date":"2019-04-13T22:00:00.000Z","endTime":"2019-04-14T01:00:00.000Z","location":"The Dakota Tavern","description":"Toronto artist \"Lo\" will be headlining his first show this April 13th at The Dakota Tavern along with 3 special guests. On top of the nights performances, Lo will also be premiering his first music video called \"Fear\" which is the lead single off his newly rel..."},{"title":"Mask Off Gala","date":"2019-04-14T00:30:00.000Z","endTime":"2019-04-13T06:00:00.000Z","location":"Berkeley Church","description":"You are invited to the Inaugural Mask Off Gala hosted by Jaclyn Goman, Toronto fitness expert and mental health advocate, in benefit of the Sunnybrook Hospital Youth Mental Health Program, \"Fresh Start.\" The gala is a black tie, cocktail-style affair featuring..."},{"title":"Neo Retreat","date":"2019-04-13T12:30:00.000Z","endTime":"2019-04-13T17:00:00.000Z","location":"Mindset","description":"a collective of wellness gurus will lead you through a half day in-city retreat to fill you with wellness through breath, movement and self care workshops. You will leave with a lot, including take-home tools and new products so your wellness journey can conti..."},{"title":"OK Ladies!","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-13T05:00:00.000Z","location":"City Dance Corps","description":"Dance the night away and raise money to amplify women’s voices through theatre! OK Ladies! offers a safe space for anyone who identifies as a woman and their allies to come together in a celebration of women. Get the party started at 8pm with an optional, all-..."},{"title":"Origins","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T08:00:00.000Z","location":"Bunker","description":"Kaleidoscope welcomes techno artist Rex Sepulveda for his Toronto debut! Rex is renowned in Detroit's thriving underground electronic music scene. Performing alongside him will be local techno staple, Marivs, and longtime contributor to the scene, Jonathan Coe..."},{"title":"Purple Rain // This Film Should Be Played Loud","date":"2019-04-14T01:30:00.000Z","endTime":"2019-04-14T03:30:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"35th Anniversary Screening!\nThis April marks the third year since the world lost music icon Prince. Join us in paying tribute to The Purple One at our annual screening of the 80s cult masterpiece that propelled him to global superstardom. Set against the gritt..."},{"title":"Race Against Fate - The Spiral Theory - Jordan Kyle","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-13T04:00:00.000Z","location":"The Cavern Bar","description":"'Race Against Fate' is the alias for singer/songwriter Vik Kapur. In order to experiment with and take his background in indie rock to a new level, Vik decided in 2013 to start a solo project that fused traditional Western pop/rock with Indian instruments such..."},{"title":"Rage Against The Machine Tribute: No Shelter @ Supermarket Bar","date":"2019-04-13T23:00:00.000Z","endTime":"2019-04-14T02:30:00.000Z","location":"Supermarket","description":"Everything can change on a new years day\nThe past sold out shows have proven that the words from street poet Zack De La Rocha, grooves from Tim Commerford and Brad Wilk, and crushing guitar sounds from Tom Morello are not only relevant to this day, but have be..."},{"title":"Rainbow Songs Foundation Family Fundraiser","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Play Loft","description":"Join us for a family friendly fundraiser for the Rainbow Songs Foundation on April 13th from 11am - 2pm.\nNow entering its eleventh year, Rainbow Songs Foundation provides interactive music programs to families with young children staying in emergency short and..."},{"title":"\"Real Life\" an Art Show by: Adam M Lancia x Natalie Schiabel","date":"2019-04-13T15:00:00.000Z","endTime":"2019-04-14T03:00:00.000Z","location":"Narwhal Art Projects","description":"Come join Toronto artists Adam M Lancia & Natalie Schiabel for an art show & party at Narwhal Gallery (2104 Dundas St W).\nSaturday April 13th 2019 11am to 11pm!\nFree entry.\nThere will be a Cash Bar.\nAdam M Lancia - www.adamlancia.com\nNatalie Schiabel - www.nat..."},{"title":"Record Store Day 2019 free live show at Tiny Record Shop","date":"2019-04-13T16:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Tiny Record Shop","description":"In partnership with local Precision Record Pressing, Tiny Record Shop is releasing a limited, hand numbered run of 100 copies of Toronto-based Jaunt's new single, \"On Your Mind\" available exclusively at the shop.\nJaunt, Halifax-based Devarrow, and Toronto-base..."},{"title":"Remember Chicago at Bambi's  April 13","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T07:00:00.000Z","location":"Bambi's","description":"We are excited to announce the highly anticipated return of \"Chicago\" on Saturday April 13th, at one of our favourite undergound spot's for dance music in the city! Our first Chicago party at Bambi's was a huge success and we are so excited to bring you the ne..."},{"title":"Romantica","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T01:30:00.000Z","location":"Calvin Presbyterian Church","description":"Presented by the Greater Toronto Philharmonic Orchestra, this event will feature a selection of popular romantic and works under the baton of guest conductor Oliver Balaburski. The first half will include a set of three romantic overtures: Johann Strauss' II o..."},{"title":"Sankofa, part of the film series Resistance & Revolution: The Cinema of Haile Gerima","date":"2019-04-13T22:30:00.000Z","endTime":"2019-04-14T01:00:00.000Z","location":"TIFF Bell Lightbox","description":"Film\nSankofa\nDir. Haile Gerima\n1993 | 125 min\nStarkly aware of the history of slavery in the United States, African American model Mona takes part in a photoshoot at a Ghanaian slave fort. A mystical drummer, calling on the spirits of enslaved ancestors to ret..."},{"title":"Sheer Heart Attack - celebrating the music of QUEEN Return to the Linsmore Tavern!","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-13T05:00:00.000Z","location":"Linsmore Tavern","description":"This show is always a hot-seller and in huge demand! Saturday April 13th, get ready for to TIE YOUR MOTHER DOWN as the Linsmore Tavern is welcoming back Sheer Heart Attack - celebrating the music of QUEEN! That's right, all of you Queen fans, this is going to ..."},{"title":"Silent Voices","date":"2019-04-13T23:30:00.000Z","endTime":"2019-04-14T01:30:00.000Z","location":"Church of the Redeemer","description":"Welcome spring with the Toronto Children's Chorus' senior choir, including the award-winning tour ensemble! The Chorus will commemorate the many voices that have been silenced throughout history, in continuation of this season's theme, In Remembrance. The prog..."},{"title":"Soundwave Cafe: Claire Coupland","date":"2019-04-13T18:30:00.000Z","endTime":"2019-04-13T20:30:00.000Z","location":"Beach United Church","description":"Warm up your afternoon with your friends and neighbours at Soundwave Cafe featuring folksinger/songwriter/guitarist Claire Coupland.\nDrop by anytime between 2:30pm and 4:30pm for great live music and complimentary coffee and tea. Admission is free, donations a..."},{"title":"Spadina Museum's Easter Egg Hunt","date":"2019-04-13T14:00:00.000Z","endTime":"2019-04-13T20:00:00.000Z","location":"Spadina Museum","description":"Easter fans, put your gathering skills to the test and search for Hershey's Chocolate Eggies all throughout the beautiful grounds of Spadina Museum! Meet the Easter Bunny, hop into the Easter-themed photo booth and dress-up in spring-, chick- and bunny-themed ..."},{"title":"Spring To Heath","date":"2019-04-13T12:45:00.000Z","endTime":"2019-04-13T18:00:00.000Z","location":"Women On The Move","description":"How to become your best you! A Women's Health and Well Being Event!\nLunch included: Organic, vegan, gluten-free and delicious!\nCatered by The Goods\nSpeakers:\n1) Jill Werner | Neurological Physiotherapist\nBanish Your Brain Fog\nNew technologies you can implement..."},{"title":"Steve Martin and Martin Short in Toronto","date":"2019-04-13T23:30:00.000Z","endTime":"2019-04-14T03:59:00.000Z","location":"Sony Centre for the Performing Arts","description":"Presale is happening now! View Onsale Times\nPublic Onsale Starts Mon 02/11/19 @ 10:00 am EST"},{"title":"STRATFORD FESTIVAL ON FILM - The Tempest","date":"2019-04-13T16:55:00.000Z","endTime":"2019-04-13T19:30:00.000Z","location":"Cineplex Young and Dundas VIP","description":"The Stratford Festival’s latest film, The Tempest, directed for the stage by\nArtistic Director Antoni Cimolino and for the screen by Barry Avrich, premières at Cineplex\ntheatres across Canada on April 13.The stage production was a truly historic event, featuri..."},{"title":"Synthesexer","date":"2019-04-14T02:00:00.000Z","endTime":"2019-04-13T06:00:00.000Z","location":"The Piston","description":"❤️THE POLITICS OF DANCING THE POLITICS OF OOOOO FEELING GOOD❤️\nSynthesexer is Toronto's synthesexiest sexy synthy alternative electro dance party. $10 cover.\nCome, if you like this kind of thing:\nHERCULES & LOVE AFFAIR, GLASS CANDY, TIGA, RÖYKSOPP, ROBYN, M.I...."},{"title":"The Keys to Professional Clinical Practice Online Workshop","date":"2019-04-13T13:30:00.000Z","endTime":"2019-04-13T08:30:00.000Z","location":"Miles Nadal JCC","description":"Today, people use the Internet for everything and, increasingly, clients expect to be able to connect with their helping professional online.\nThe only question is whether the professional is ready. Some people suggest that online services are the future of cou..."},{"title":"Toronto Bar Crawl #33","date":"2019-04-13T22:00:00.000Z","endTime":"2019-04-14T03:00:00.000Z","location":"Multiple Venues","description":"Ready to go out drinking in Toronto?\nGet your night out started right with your host Zoubin taking you on a bar crawl.\nZoubin will take you to some of his favorite bars, where we'll have a drink at each bar before moving onto the next.\nThe focus of this bar cr..."},{"title":"Vi & special guests at Adelaide Hall, Toronto","date":"2019-04-14T00:00:00.000Z","endTime":"2019-04-14T03:00:00.000Z","location":"Adelaide Hall","description":"Vi's headlining show in Toronto, ON at Adelaide Hall - as seen on CTV's The Launch!\nWith special guests, WILL and Bella Krys\nSaturday, April 13\nDoors 8pm\n19+\nTickets:\nhttps://www.eventbrite.ca/e/58606800518\n$12 online advance\n$18 at the door\nListen to Vi's deb..."},{"title":"V@M EXHIBITION","date":"2019-04-13T22:00:00.000Z","endTime":"2019-04-13T04:00:00.000Z","location":"The Freedom Factory","description":"The Freedom Factory's Annual Visual Arts Movement!\nCome out and support 60 Toronto Artists as they competing for CASH, Gallery Space & More - Judged by Industry Leaders!!\nLive Entertainment/ Music, Complimentary Food, Cash Bar.\n(competition takes place over 4 ..."},{"title":"WOMAN ON FIRE...Get Inspired Conference  & Awards Gala!","date":"2019-04-13T12:00:00.000Z","endTime":"2019-04-13T22:00:00.000Z","location":"DoubleTree by Hilton Hotel Toronto Airport West","description":"WOMAN ON FIRE ….Get Inspired Conference & Awards Gala 2019…\nWhat started with a handful of women to help the impoverished women and children in Haiti, has now blossomed into a 2 day event in Toronto, Canada bringing together a diverse and unique blend of entre..."},{"title":"WWF's CN Tower Climb for Nature","date":"2019-04-13T10:00:00.000Z","endTime":"2019-04-13T13:30:00.000Z","location":"Metro Toronto Convention Centre (MTCC), Hall A, North Building","description":"Climbing the CN Tower is a rare and exhilarating opportunity to take 1,776 meaningful steps towards a future where nature and wildlife thrive. Register today to climb, enjoy the breathtaking view of Toronto from the tower's newly renovated observation deck and..."},{"title":"Alec Benjamin in Toronto","date":"2019-04-14T23:00:00.000Z","endTime":"2019-04-15T03:00:00.000Z","location":"Mod Club Theatre","description":"Embrace Presents ALEC BENJAMIN Doors: 7pm All Ages/Licensed Event ALEC BENJAMIN https://www.facebook.com/AlecBenjaminMusic/ https://twitter.com/alecbenjamin https://www.instagram.com/alecbenjamin/"},{"title":"Etsy Team Toronto - Spring Market","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T21:00:00.000Z","location":"The Great Hall","description":"Want to put a spring in your step? Easy, Toronto meet your markers! That's right meet, shop and discover all the local talent Toronto has to offer! Join us Sunday April 14 2019 10am-5pm and meet a curated selection of Toronto's most noteworthy Etsy sellers and..."},{"title":"Evergreen's Drop, Swap & Shop","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Evergreen Brick Works","description":"Have a funky purse sitting in your closet that was just never “you”? Been searching for a pair of rollerblades or a record to add to your collection? Try swapping instead of shopping at our Swap Mall. Bring in up to 20 items in exchange for tickets that can be..."},{"title":"SWMRS","date":"2019-04-14T23:00:00.000Z","endTime":"2019-04-15T03:59:00.000Z","location":"Phoenix Concert Theatre","description":"Collective Concerts & Indie88 Present SWMRS: BERKELEY’S ON FIRE The Regrettes, Beach Goons Sunday Apr 14, 2019 Doors: 7:00 PM All Ages $22 Phoenix Concert Theatre  410 Sherbourne Street  Toronto, Ontario  Advance tickets also available at Rotate This & Sounds..."},{"title":"163 John St. : THE DANGER ROOM @ THE CORNER","date":"2019-04-15T01:00:00.000Z","endTime":"2019-04-14T04:00:00.000Z","location":"The Corner","description":"THE DANGER ROOM HOSTS: DAN GUIRY & MORGAN O'SHEA 'The Danger Room' is marathon style show with a variety of professional and amateur comedians testing their most dangerous and explicit material. Audience members are encouraged to boo and heckle comedians durin..."},{"title":"2019 Acrylic Pour Painting Workshops","date":"2019-04-14T13:30:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"LucSculpture","description":"Come to join this acrylic pour painting workshop in Toronto and have the very best time and results. Even if you have already done pours you will be surprised and delighted by what you do. Dates: Various dates, 9:30 am to 4:00 pm, Apr. 14 (Sun), May 5 (Sun), a..."},{"title":"2019 Partner DAnce Classes","date":"2019-04-14T22:00:00.000Z","endTime":"2019-04-15T00:00:00.000Z","location":"LucSculpture","description":"Sunday Evenings 6pm-8pm Enjoy a casual night of partner dancing! Each week will cater to teaching you the fundamentals of basic Ballroom & partner dancing, introducing a different style each week. These classes are for beginners & will break down the technique..."},{"title":"2019 SOL Yoga Spring into Good vibes","date":"2019-04-14T17:00:00.000Z","endTime":"2019-04-14T18:00:00.000Z","location":"Yuris Village","description":"Select SUndays from April 7-June 23 Check Link for exact dates class starts 1pm-2:15 This is a classic Asana class, that is designed to get your body moving, increase flexibility, release tension (especially in the upper back, shoulders, and legs), improving c..."},{"title":"946 QUEEN ST. EAST : SUNDAY BEST @ THE CORNER EAST","date":"2019-04-15T00:00:00.000Z","endTime":"2019-04-14T04:00:00.000Z","location":"The Corner East","description":"Every Sunday at The Corner Comedy Club EAST, TAMARA SHEVON will be hosting SUNDAY BEST! A lineup of Canada’s best comedians. There's gonna be 2 shows, 8PM & 10PM, each with a different set of comics. Credits include Just For Laughs, JFL 42, CBC, Comedy Network..."},{"title":"April Podcast Brunch Club Meetup - Special DOUBLE Listening List Meeting","date":"2019-04-14T17:00:00.000Z","endTime":"2019-04-14T19:00:00.000Z","location":"Artful Dodger","description":"Join us at the April Toronto Podcast Brunch Club meeting for a very special DOUBLE listening list meeting! We will be discussing the podcast listening lists \"Language\" and \"The Evolution of Libraries.\" All are welcome! Whether you listened to the list or not, ..."},{"title":"Beethoven's Hair // Doc Soup Sundays","date":"2019-04-14T15:00:00.000Z","endTime":"2019-04-14T17:09:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Doc Soup Sundays: From rarely seen gems to new biographies, Doc Soup Sundays rounds up the best arts and culture documentaries and pairs them with special guest Q&As.; How does a lock of Beethoven’s famously mad hair end up in the hands of Arizona residents Ir..."},{"title":"BootCAMP & Beer V8 with Camp Fuel","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T16:00:00.000Z","location":"Left Field Brewery","description":"Get your bootCAMP class provided by CAMP FUEL , then beer right after! It's called balance. Expect a full body workout, partner drills and a lot of high fives all inside Left Field Brewery! We'll combine strength, conditioning and motivation to work off the ca..."},{"title":"CAPS Ontario presents The Best Ontario Sommelier Competition April 14","date":"2019-04-14T15:00:00.000Z","endTime":"2019-04-15T03:00:00.000Z","location":"The Arcadian Court","description":"The Ontario chapter of the Canadian Association of Professional Sommeliers (CAPS Ontario, http://sommelierscanada.com/ontario/) is delighted to unveil its largest and most diverse wine and food event of its kind in the province, the Best Ontario Sommelier Comp..."},{"title":"Compassionista: An Ethical Fashion Show","date":"2019-04-14T18:30:00.000Z","endTime":"2019-04-14T21:30:00.000Z","location":"The Right Side Boutique","description":"Are you into ethical and cruelty-free fashion, veganism and zero waste? We're hosting a fun Toronto event that you might love at our shop this April -- Compassionista: An Ethical Fashion Show! We hope to see you there. The event will feature sweatshop-free clo..."},{"title":"DakhaBrakha","date":"2019-04-14T23:00:00.000Z","endTime":"2019-04-15T01:00:00.000Z","location":"Koerner Hall","description":"Ukrainian “ethnic chaos” blending Ukrainian harmonies, contemporary roots and rhythms, surprising instrumentation, and theatrical flourishes. At the crossroads of Ukrainian folklore and theatre, their performances are both intimate and riotous.\nPresented in pa..."},{"title":"Extraordinary Women: Baroque Painter Artemisia Gentileschi","date":"2019-04-14T15:00:00.000Z","endTime":"2019-04-14T17:00:00.000Z","location":"Revue Cinema","description":"The painting is shocking for its violence and the calm determination of the women. The artist is Artemisia Gentileschi, born in 1593; the subject is the biblical story of Judith, a beautiful Jewish widow who beheaded an inebriated Assyrian general sent to dest..."},{"title":"Fan Appreciation Night: Toronto Marlies vs Cleveland Monsters","date":"2019-04-14T20:00:00.000Z","endTime":"2019-04-14T22:30:00.000Z","location":"Coca-Cola Coliseum","description":"Join us on April 14th for the final game of the regular season when we celebrate YOU, our incredible fans. We’ll have giveaways throughout the game as our way to say thank you for your support all season."},{"title":"Female Founders Shopping Event","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Toronto Designers Market","description":"Discover some amazing new local female-led brands at Toronto Designers Market! During this shopping event, you will have the opportunity to meet some courageous female founders and learn why they started their businesses and how they overcame obstacles to brin..."},{"title":"Girl Gang Cabarets","date":"2019-04-14T21:30:00.000Z","endTime":"2019-04-15T01:00:00.000Z","location":"Painted Lady","description":"Girl Gang Cabarets is an unboxed variety show at The Painted Lady.\nAn inclusive safe space to meet, empower, and share stories with all kinds of feminists. The Spring Edition features:\nBurlesque By Red Tongued Raven\nPoetry by Robyn Sidhu\nComedy by Arianne Tong..."},{"title":"Healthy Moms Toronto Marketplace","date":"2019-04-14T13:30:00.000Z","endTime":"2019-04-14T19:30:00.000Z","location":"Artscape Wychwood Barns","description":"The Healthy Moms Toronto Marketplace is a FREE event for the whole family featuring a curated selection of natural/organic/sustainable items. Enjoy healthy food options and complimentary onsite childcare while you check out new products and do a little shoppin..."},{"title":"Ice & Fire - Beer and Spicy Food Pairings","date":"2019-04-14T20:00:00.000Z","endTime":"2019-04-14T22:00:00.000Z","location":"People's Pint","description":"Sommelier Sundays continue with our next installment \"Ice and Fire\". In honour of the premiere of the 8th and final season of Game of Thrones we thought we would get everyone fired up for it. We will have 4 separate samples of spicy foods and we will pair them..."},{"title":"Just About Married - Mock Wedding Show","date":"2019-04-14T17:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"The Fifth Social Club","description":"There’s no such thing as a one-size-fits-all wedding, so there shouldn’t be a one-size-fits-all wedding show either. Tired of the same boring trade shows with pushy sales pitches? Same. That’s why we created Just (About) Married, a wedding experience for coupl..."},{"title":"LARK Ensemble presents - Exuberance: Roberta Janzen in recital","date":"2019-04-14T23:30:00.000Z","endTime":"2019-04-15T01:30:00.000Z","location":"Corkin Gallery","description":"LARK Ensemble's cellist Roberta Janzen invites us to share her connection with this majestic instrument and its repertoire. Two solo cello works frame the program: Bach's optimistic and energetic third Suite, and Kodaly's impassioned Solo Sonata. In Ravel's lu..."},{"title":"Meeting Pointe","date":"2019-04-14T19:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Union Station","description":"An afternoon of new ideas in contemporary ballet with live music\nCelebrate the arrival of spring with the beauty of ballet on Sunday, April 14 with Meeting Pointe, a FREE afternoon of contemporary ballet and live music in Union Station’s newly revitalized hist..."},{"title":"Modified A Food Lovers Journey into GMOs","date":"2019-04-14T20:00:00.000Z","endTime":"2019-04-14T22:00:00.000Z","location":"Metro Toronto Convention Centre","description":"Join Kids Right to Know for an inspirational screening of Modified: A Food Lover’s Journey into GMOs at the Total Health Show. The film screening of Modified will be followed by a Q&A; with Rachel Parent, a raffle, and an opportunity to learn, exchange seeds a..."},{"title":"New Orford String Quartet","date":"2019-04-14T19:15:00.000Z","endTime":"2019-04-14T21:15:00.000Z","location":"Walter Hall, Edward Johnson Building, University of Toronto","description":"Violinists Jonathan Crow and Andrew Wan are concertmasters of the Toronto and Montreal Symphony Orchestras, Brian Manker is principal cello in Montreal and Eric Nowlin, principal viola at the Detroit Symphony. They formed in 2009, following the footsteps of th..."},{"title":"NICK MACLEAN QUARTET feat. BROWNMAN ALI","date":"2019-04-15T00:00:00.000Z","endTime":"2019-04-15T03:00:00.000Z","location":"La Revolucion","description":"NICK MACLEAN QUARTET feat. BROWNMAN ALI (Toronto)\nLa Rev | www.LaRevTO.com\nToronto, ON - 2848 Dundas St W, M6P 1Y9\nSUN-APR-14, show @ 8:00pm\n$15 door, $10 adv list (email nickmacleanquartet@gmail.com for adv list)\nFB Event: https://www.facebook.com/events/4665..."},{"title":"Night of the Lepus","date":"2019-04-14T23:30:00.000Z","endTime":"2019-04-15T03:00:00.000Z","location":"Handlebar","description":"Giant mutant rabbits attack people in this 1972 cautionary tale of \"what if science, but too much??\"\nNight Of The Lepus stars Janet Leigh and DeForest Kelley, and is based on a novel from 1964... yes, multiple people committed to this idea on more than one occ..."},{"title":"Outdoor Matzah Bake","date":"2019-04-14T18:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Dufferin Grove Park","description":"Join Makom: Creative Downtown Judaism for a fun afternoon making and baking Matzah in an outdoor, wood-burning oven!\nSee if you can mix, knead, roll and bake in 18 minutes or less! (Matzah won't be kosher for Passover but it's still a wonderful way to prepare ..."},{"title":"Shakespeare and the ROM","date":"2019-04-14T14:30:00.000Z","endTime":"2019-04-14T19:30:00.000Z","location":"Royal Ontario Museum","description":"Explore the life and times of William Shakespeare through the ROM’s collections. With the opportunity to handle authentic objects, this workshop investigates some of the most serious religious and political issues of Shakespeare’s day, as well as some of the m..."},{"title":"Skate for Sarah","date":"2019-04-14T11:00:00.000Z","endTime":"2019-04-14T21:00:00.000Z","location":"Canlan Ice Sports Arean","description":"On Sunday, April 14th, 2019, JCC Chai Sports is hosting the 4th annual Skate for Sarah Charity Hockey Tournament at\nCanlan Arena – York University Campus.\nThis Action-Packed Day Features:\n• Competitive high-level hockey\n• Fun for the whole family\n(including a ..."},{"title":"Spoken Word Workshop & Open Mic -- \"The Ecology of Story: Writing with Mother Earth\"","date":"2019-04-14T19:00:00.000Z","endTime":"2019-04-15T01:30:00.000Z","location":"University of Toronto Scarborough","description":"Introductory Spoken Word Workshop @3pm-5:30pm, room MW130, with spoken word artists Sheniz Janmohamed and Mahlikah Awe:ri Enml'ga't Saqama'sgw (The Woman Who Stands and Walks In The Light).\nOpen Mic @7:30pm in room MW130 (workshop participants are encouraged, ..."},{"title":"Sports Cards & Memorabilia Show","date":"2019-04-14T14:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"Montecassino Hotel & Event Venue","description":"Sports Card Extravaganza! $2 Admission! Free Parking! 50 Vendor Tables including baseball, basketball, football, hokey cards! Autographed memorabilia, Game Used Jersey Cards, Photos, Game Tickets, and so much more! 10AM-3PM - Tons of free parking next door too"},{"title":"The Blue City - An Introduction to the Arts & History of Jodhpur","date":"2019-04-14T14:30:00.000Z","endTime":"2019-04-14T19:30:00.000Z","location":"Royal Ontario Museum","description":"Discover the history of Jodhpur through an exploration of its arts from the 18th to 20th centuries with expert Akshaya Tankha of the University of Toronto. Reflect on the aesthetic traditions, religious practices, social conventions, and cultural exchange in t..."},{"title":"The Texas Comedy Massacre 2","date":"2019-04-15T00:00:00.000Z","endTime":"2019-04-15T02:00:00.000Z","location":"Fox and Fiddle (Wellesley)","description":"Killer Standup Comedy from Canada's top comics in an\nintimate perfect-for-comedy venue 12 years running.\nGreat lineup of ALL PRO's this month! NO COVER\nCome see our new regular host,\nTed Morris, Canada's funniest vet!\nThis month featuring\nNile Seguin (Just for..."},{"title":"Toronto Real Estate Flipping for Profit seminar","date":"2019-04-14T13:00:00.000Z","endTime":"2019-04-14T18:00:00.000Z","location":"Westin Prince Hotel Toronto","description":"Flipping houses for instant profit LIVE crash course.Only for action-takers who strive for excellence, and along with learning from the experts with proven track record, Getting local properties quickly flipped, for maximum profit in the shortest time. http://..."},{"title":"Voice Discovery Singalong & Meditation","date":"2019-04-14T19:00:00.000Z","endTime":"2019-04-14T21:00:00.000Z","location":"Lululemon Queen Street","description":"If you knew what took place within these walls, you wouldn’t believe your ears! This workshop is a brave space with a special focus on anyone who identifies as “shy” with their singing. We will join together, find our centre through guided meditation, and then..."},{"title":"Yoga Nidra & Sound Healing","date":"2019-04-14T23:30:00.000Z","endTime":"2019-04-15T01:30:00.000Z","location":"The House of Yoga","description":"Join Jesse Buck and Adalena Franford as they co-create a restful and rejuvenating night of Yoga Nidra with Crystal Singing Bowl Soundbath experience.\nDuring a yoga nidra, also known as \"sleep yoga\" you’ll be led into a deep relaxed state, similar to the state ..."},{"title":"Youth Speaker Slam: 18 & Under Speaking Competition","date":"2019-04-14T16:00:00.000Z","endTime":"2019-04-14T20:00:00.000Z","location":"CSI Annex Garage","description":"Young people today will become the leaders of tomorrow and at Youth Speaker Slam our mission is to be the catalyst that propels young leaders forward by providing them with a platform to share their inspiring stories and revolutionary ideas.\nThis coming April ..."},{"title":"3rd Monday Nights Free at the ROM","date":"2019-04-15T21:30:00.000Z","endTime":"2019-04-16T00:30:00.000Z","location":"Royal Ontario Museum","description":"Free admission. Extended hours. Bring family and friends to the ROM on the 3rd Monday Night of each month and enjoy free admission from 5:30 pm to 8:30 pm. With complimentary access and extended hours, visitors are invited to explore art, culture, and nature i..."},{"title":"163 John St. : DO OR DIE OPEN MIC @ THE CORNER","date":"2019-04-16T00:00:00.000Z","endTime":"2019-04-16T03:00:00.000Z","location":"The Corner","description":"HOSTS: JOEY HARLEM & JEREMY DOBSKI The Corner Comedy Club weekly Open Mic Monday Nights at 8PM - 11PM Amateurs, Pros and Room Regulars get up on stage and try out something new! DURATION: 180 MINUTES $5 TICKETS TICKETS AVAILABLE @ thecornercomedy.com SIGN UP E..."},{"title":"A Tale of Suspense - Money Monster - 2016 Movie","date":"2019-04-15T22:00:00.000Z","endTime":"2019-04-15T23:45:00.000Z","location":"Brentwood Library","description":"Lee Gates is a TV personality whose insider tips have made him the money guru of Wall Street. When Kyle loses all of his family's money on a bad tip, he holds Lee and his entire show hostage on air threatening to kill Lee if he does not get the stock up 24 and..."},{"title":"Clown Masterclass with Aitor Basauri","date":"2019-04-15T14:00:00.000Z","endTime":"2019-04-15T21:00:00.000Z","location":"Sweet Action Theatre","description":"REGISTER BY APRIL 1ST: $475 (COUPON CODE Q2SVYL8) REGISTER AFTER APRIL 1ST: $550 Monday April 15th - Friday April 19th 10am - 5pm each day WHAT IS THE CLOWN MASTERCLASS? In the Spymonkey clown masterclass, you will learn to discover what makes you funny, hone ..."},{"title":"CREATING A HAPPY WORKPLACE - A Workshop","date":"2019-04-15T13:00:00.000Z","endTime":"2019-04-15T16:30:00.000Z","location":"Centre For Social Innovation","description":"The science is in. Creating a happy work environment has a profound impact on a company's bottom line. So why doesn't every company focus on creating happiness at work? The problem is there's a lot of confusion and misinformation on what actually makes someone..."},{"title":"Free Japanese Film Screening! Final Straw","date":"2019-04-15T22:30:00.000Z","endTime":"2019-04-16T00:30:00.000Z","location":"The Japan Foundation","description":"This spring, we will feature a series of films, CHIKYU FILMS, which will share the stories and people who examine the close relationship to our environment, our earth, or Chikyu 地球 in Japanese. FINAL STRAW Documentary by Patrick Lydon and Suhee Kang (2015) 74 ..."},{"title":"Fresh Jokes volume 2","date":"2019-04-16T01:30:00.000Z","endTime":"2019-04-16T02:30:00.000Z","location":"Social Capital Theatre","description":"Welcome to Fresh Jokes: a variety show where sketch comedians and musical comedians present their newest, freshest...jokes. Featuring: Anesti Danelis Chris Middleton Cameron Wyllie The Utilidors Super Cool Oh Yes Cereal in a Mason Jar Swing by and have a look ..."},{"title":"momondays","date":"2019-04-15T21:30:00.000Z","endTime":"2019-04-16T01:30:00.000Z","location":"The Hideout","description":"Put story-telling into a blender. Add a dash of personal growth & transformation. Then drop in a load of laughs. Mix in real, live music, and great conversation with some of the nicest people on the planet, then push the ‘high’ setting… and out comes momondays..."},{"title":"Open Studio","date":"2019-04-15T14:00:00.000Z","endTime":"2019-04-15T22:00:00.000Z","location":"Union Station","description":"Today we welcome you to our Open Studio, a dance studio without walls. Take a behind-the-scenes glimpse into the creative working processes of renowned dance artists and choreographers as they rehearse an upcoming performance or lead a professional class. Stay..."},{"title":"Opera Express Boheme on the go","date":"2019-04-15T14:00:00.000Z","endTime":"2019-04-15T22:00:00.000Z","location":"Union Station","description":"Union and the Canadian Opera Company serve up a commuter-friendly performance of the beautiful – and beloved — La Bohème. Stay for the 45-minute version of the opera or drop in to hear a few of its greatest hits. Trust us: you’ll want to take the later train."},{"title":"Rally For Climate Action","date":"2019-04-15T16:30:00.000Z","endTime":"2019-04-15T17:30:00.000Z","location":"Osgoode Hall Courthouse","description":"The Ontario Government is going to court to undermine Canada's plan to tackle climate change. Join us for a lunchtime rally on Monday April 15 - outside the Osgoode Hall Courthouse - to tell Ontario to stop wasting our money in court and to start fighting clim..."},{"title":"RUN THE FLEX BEGINNER HIP HOP DANCE PROGRAM","date":"2019-04-16T00:30:00.000Z","endTime":"2019-04-16T02:30:00.000Z","location":"Pia Bowman","description":"APRIL 15 - JUNE 3, 2019 *No class April 22 or May 20 When: Mondays, 8:30PM - 10:30PM Where: Pia Bouman (6 Noble St., Toronto) Level: Beginner - NO previous dance experience required This 6-week hip hop dance program is designed to help you build confidence in ..."},{"title":"Run The Flex Beginner Hip Hop Workshop","date":"2019-04-16T00:30:00.000Z","endTime":"2019-04-16T02:30:00.000Z","location":"Dance Teq","description":"Run The Flex's 6-week hip hop dance programs are designed to help you build confidence in your dancing, work up a sweat and have fun. If you're looking to find your inner dancer...you've come to the right place. APRIL 15 - JUNE 8, 2019 *No class April 22 or Ma..."},{"title":"Sedges & Grasses","date":"2019-04-15T23:00:00.000Z","endTime":"2019-04-16T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Grasses offer structural interest throughout the year, increase biodiversity and add sound and movement to the garden. Their close relatives, sedges, are indispensable in the fast-growing area of rain gardens. Broaden your horizons with these often overlooked ..."},{"title":"TechTO - April Edition","date":"2019-04-15T22:00:00.000Z","endTime":"2019-04-16T01:00:00.000Z","location":"RBC WaterPark Place","description":"TechTO events bring together Toronto’s tech leaders, innovators, and enthusiasts.\nThe speakers: highly curated leaders & innovators sharing their expertise & experiences through 5 minute TED-style presentations\nThe format: mingling & drinks > demos & showcases..."},{"title":"THE OTHER SHELF. Kathy Wang: Family Trust","date":"2019-04-15T22:00:00.000Z","endTime":"2019-04-15T23:00:00.000Z","location":"Toronto Public Library","description":"This event is part of the Toronto Public Library's new literary series, The Other Shelf, where TPL presents exceptional writers in a smaller space. This event is held in the Novella Room in the Bram & Bluma Appel Salon.\nTickets are available at no cost at the ..."},{"title":"Tom Waits Appreciation Congregation Returns to the Linsmore!","date":"2019-04-16T00:00:00.000Z","endTime":"2019-04-16T03:59:00.000Z","location":"Linsmore Tavern","description":"Monday April 15th, the Linsmore Tavern (1298 Danforth Ave) is welcoming back the incredible Tom Waits Appreciation Congregation for their monthly Monday evening residency and the best show in Toronto on a Monday night! The TWAC has been the most popular monthl..."},{"title":"Workout & Work with Camp Fuel","date":"2019-04-15T12:00:00.000Z","endTime":"2019-04-15T21:00:00.000Z","location":"Project Spaces","description":"Let's workout and then work together!\n8-9am workout\n9-5 work\nThis is the perfect opportunity to start your week off right, with a workout & a day pass at Project Spaces. This is an opportunity to get your workout in, meet amazing new people & get work done!\nCA..."},{"title":"Dizzy","date":"2019-04-17T00:00:00.000Z","endTime":"2019-04-17T03:00:00.000Z","location":"Mod Club","description":"Embrace and Indie88 Present DIZZY Doors: 8pm All Ages / Licensed Event DIZZY https://www.facebook.com/wearedizzy/ https://twitter.com/dizzytheband?lang=en https://www.instagram.com/dizzytheband/"},{"title":"Fireside Tales: Year 6, Season Opener","date":"2019-04-17T00:00:00.000Z","endTime":"2019-04-17T01:30:00.000Z","location":"Dufferin Grove Park","description":"The coziest storytelling show is returning for its SIXTH year! Come join hosts Helder Brum & Dan Galea around the fire as they bring together some of the best storytellers in the city! BRING BLANKETS, SNACKS, AND FRIENDS! We'll bring the hot cocoa and marshmal..."},{"title":"13th ANNUAL 2019 ART GEMS AUCTION","date":"2019-04-16T21:00:00.000Z","endTime":"2019-04-17T02:00:00.000Z","location":"Berkeley Church, Toronto","description":"Art Gems is one of the city’s premiere art auctions, with over 500 attendees, including industry leaders, corporate sponsors, donors, Canada’s top artists and gallery owners, as well as Creative Works Studio members. Art Gems raises funds in support of Creativ..."},{"title":"Beeswax Candle Making at Toronto Botanical Garden","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Learn how to make three different kinds of beeswax candles: rolled sheets, dipped tapers and poured mould candles. Participants will go home with their own handmade candles."},{"title":"Canadian Children's Opera Company's Junior Open House","date":"2019-04-16T20:30:00.000Z","endTime":"2019-04-16T22:30:00.000Z","location":"First Unitarian Congregation","description":"Does your child love music, drama, and theatre? Great! They're just who we're looking for. Join us on April 16 to see what a CCOC music education looks like and find out more about our programs for kids aged 5 and up. 4:45 - 5:45 Butterfly Chorus (JK & SK) 5:4..."},{"title":"Can You Do Lunch? 2019","date":"2019-04-16T15:30:00.000Z","endTime":"2019-04-16T17:30:00.000Z","location":"Four Seasons Toronto","description":"There are over 63,000 people in Canada living with HIV and it is estimated that six people in Canada become newly infected with HIV each day, or nearly one person infected every four hours. It’s time to act. On Tuesday, April 16, 2019, the Canadian Foundation ..."},{"title":"CJF J-Talk: Fallout from the Field","date":"2019-04-16T22:00:00.000Z","endTime":"2019-04-17T00:00:00.000Z","location":"TD Bank Tower","description":"After witnessing the horrors of war, natural disasters or local crime stories, journalists must often cope with emotional trauma, moral quandaries and PTSD. How can reporters—and newsrooms—manage the personal impact of covering stories that involve human cruel..."},{"title":"Convert Religious Shame to Soulful Intimacy","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T01:30:00.000Z","location":"Good For Her","description":"Have you been “affected by religion”? Perhaps you grew up in a religious household. Maybe you were surrounded by a religious community or extended family. Either way, you likely grew up in a society structured on religion. All of us affected by religion have h..."},{"title":"Digital Nomads and Remote Work Event","date":"2019-04-16T22:00:00.000Z","endTime":"2019-04-17T00:00:00.000Z","location":"WeWork","description":"Come join us at WeWork Richmond St. for a digital nomad and remote work event! We'll be sharing advice on how to build a personal platform, attract more clients, work remotely, and live the life of a digital nomad!\nThere will be 3-4 quick presentations on how ..."},{"title":"Discover Dance with Nivedha Ramalingham","date":"2019-04-16T16:00:00.000Z","endTime":"2019-04-16T17:00:00.000Z","location":"Toronto Centre for the Arts, Upper Gallery","description":"Discover Dance is a free all-ages lunch series where you will be introduced to some of Toronto’s incredible dance artists. Hosted by the award-winning choreographer Nova Bhattacharya of Nova Dance.\nNivedha Ramalingam is an emerging talent who is burning up sta..."},{"title":"DX Mastercraft: Designing for Flow","date":"2019-04-16T22:30:00.000Z","endTime":"2019-04-17T00:30:00.000Z","location":"Design Exchange","description":"When humans are in flow, they are believed to be the happiest, and most present, and said to have their ego fall away. In a world of constant distractions, it feels increasingly harder than ever to achieve states of flow, despite our desire for it. As designer..."},{"title":"EARTH: An Earth Day Celebration - Film, Food, Speakers & Activity","date":"2019-04-16T22:30:00.000Z","endTime":"2019-04-17T02:00:00.000Z","location":"Winchester Dance Theatre","description":"Explore our world through film, food, insight from thought-provoking speakers and meet like-minded and like-hearted individuals through engaging activities.\nGet acquainted with Canadian outdoor culture filmmaker Jordan Manley and screen his latest documentary ..."},{"title":"Eatable Films x Hot Docs: Red Chef Revival - World Premiere","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T00:48:00.000Z","location":"Hot Docs Ted Rogers Cinema","description":"Explore the power of reconciliation through food at the world premiere of the anticipated new docu-series, Red Chef Revival.\nA long-neglected culinary tradition, Indigenous cuisine is being reclaimed and reinvented by a new guard of chefs from across Canada. B..."},{"title":"Jeffrey S. Rosenthal: Knock on Wood","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T00:00:00.000Z","location":"Brentwood Library","description":"For centuries, people around the world have prayed for good luck and warded against bad. Every language features a good luck greeting. Sailors have long looked for an albatross on the horizon as a symbol of good fortune. Jade, clovers, rabbits' feet, wishbones..."},{"title":"Launch for The Seed by Alexandra Kimball","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-16T04:00:00.000Z","location":"The Ossington","description":"Join us to celebrate the Toronto Lit Up launch of The Seed, Infertility is a Feminist Issue (Coach House Books) by Alexandra Kimball at the back room of The Ossington!"},{"title":"Panel Discussion: Impact of Independent Music Magazines on Toronto' Hip Hop Scene","date":"2019-04-16T22:30:00.000Z","endTime":"2019-04-16T23:30:00.000Z","location":"Beeton Hall, Toronto Reference Library","description":"Journalists and Magazine Publishers explore the impact of independent music magazines such as Mic Check, WORD, Peace, Pound and Urbanology, in the 1990s and 2000s."},{"title":"PowerPoint Basics 3","date":"2019-04-16T17:00:00.000Z","endTime":"2019-04-16T19:00:00.000Z","location":"Brentwood Library","description":"Using PowerPoint 2013, learn how to add pictures, animate objects, and more. Basic keyboarding and mouse skills required.\nRegister in person at the Information Desk or by calling 416-394-5240."},{"title":"Retail Job Fair","date":"2019-04-16T14:00:00.000Z","endTime":"2019-04-16T18:30:00.000Z","location":"Toronto Reference Library","description":"On Tuesday April 16th, 2019, there will be 20+ retailers with over 500 job opportunities. Please dress for success, bring 15+ copies of your resume and keep connected with your Job Developers and Employment Coaches from to prepare, prior to this job fair."},{"title":"Snack Time Comedy ep 28- Snackin' for the Weekend","date":"2019-04-17T00:00:00.000Z","endTime":"2019-04-17T01:30:00.000Z","location":"Comedy Bar","description":"Snack Time Comedy aka Toronto's Premier snack and comedy show is back April 16th 8pm at Comedy Bar (945 Bloor W) with an amazing line up of comics who have each picked out a snack for you to eat during the show!\nThis month features:\nShawn Hogan\nMarty Topps\nHoo..."},{"title":"Supporting the Parenthood Journey: A conversation with Ann Douglas and Amanda Munday","date":"2019-04-16T21:00:00.000Z","endTime":"2019-04-16T23:30:00.000Z","location":"The Workaround","description":"Join Ann and Amanda for an in-depth conversation about the intersection of parenthood and mental health and how we can support each other as parents, colleagues, and neighbours.\n*Please note this event is scheduled at a family-friendly time, will include snack..."},{"title":"The Facebook Fix: How to Get Your Content Seen","date":"2019-04-16T17:00:00.000Z","endTime":"2019-04-16T20:00:00.000Z","location":"Camp Tech","description":"If your organization has a Facebook business page and you’re comfortable with the basics, but you find yourself asking “now what?”, then this workshop is for you. We’ll show you how to develop content that will break through the algorithm and get noticed (and ..."},{"title":"THE OTHER SHELF. Kathy Wang: Family Trust","date":"2019-04-16T22:00:00.000Z","endTime":"2019-04-16T23:00:00.000Z","location":"Toronto Public Library","description":"This event is part of the Toronto Public Library's new literary series, The Other Shelf, where TPL presents exceptional writers in a smaller space. This event is held in the Novella Room in the Bram & Bluma Appel Salon.\nTickets are available at no cost at the ..."},{"title":"Toronto Lit Up: Alexandra Kimball","date":"2019-04-16T23:00:00.000Z","endTime":"2019-04-17T01:00:00.000Z","location":"The Ossington","description":"Alexandra Kimball is releasing The Seed: How the Feminist Movement Fails Infertile Women and will be celebrating its publication with a Toronto Lit Up book launch! Join Coach House Books and the Toronto International Festival of Authors for this exciting event..."},{"title":"Toronto Sales & Marketing Job Fair","date":"2019-04-16T17:00:00.000Z","endTime":"2019-04-16T19:00:00.000Z","location":"Jobs Canada Fair","description":"Looking for Work? Immediate Hiring?\n\r\nDO NOT MISS THE SALES & MARKETING JOB FAIR:\r\nTIME: 1:00PM TO 3:00PM\r\nLOCATION: First Canadian Place, 56th floor\r\nADDRESS: 100 King Street West, Toronto, ON M5H 1A1.\n\r\nMEET FACE TO FACE WITH HIRING COMPANIES IN SALES & MARK..."},{"title":"163 John St. : DIRTY WEDNESDAY @ THE CORNER","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-17T04:00:00.000Z","location":"The Corner","description":"A weekly showcase of some of the dirtiest/uncensored comics in Toronto & It's taking place at the newest, hottest comedy club, THE CORNER! Two shows NOW! @ 8 & 10 PM, comedians credits include Just For Laughs, JFL 42, CBC, Comedy Network + more. Everything Dir..."},{"title":"2019 Drop IN Figure Drawing","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T01:30:00.000Z","location":"LucSculpture","description":"Come to LucSculpture on Wednesday night, 6:30 – 9:30 pm, for drop-in figure drawing Toronto sessions! We have a different model each week. Enjoy the relaxing atmosphere! Time: January 23rd to June 19th, 6:30 pm to 9:30 pm Drop-in: $20, session passes (12 sessi..."},{"title":"2019 Election Pop-Up Panel: Polling, Voter Engagement and Get Out the Vote","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Centre for Social Innovation, The Atrium","description":"With the federal election getting closer each day, Equal Voice Toronto has been hosting a series of panels on topics that will be useful to anyone interested in getting involved- whether as a candidate, volunteer or just someone who's interested in learning mo..."},{"title":"946 QUEEN ST. EAST : THE RENEGADE SHOW @ THE CORNER EAST","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-17T04:00:00.000Z","location":"The Corner East","description":"Every Wednesday at The Corner Comedy Club EAST, the young killer Kyle Lucey will be hosting THE RENEGADE SHOW! A lineup of Canada’s best comedians showcasing dark and twisted material. Featuring comedians from Just For Laughs, CBC, Sirius XM, and The Comedy Ne..."},{"title":"Ambient Ping: Hypnagogue, ortiz","date":"2019-04-18T00:30:00.000Z","endTime":"2019-04-18T03:30:00.000Z","location":"Handlebar","description":"THE AMBiENT PiNG presents Hypnagogue + ortiz + General Chaos Visuals .. 9.00 . ortiz creates dark, dub-inflected soundscapes that evoke the chaotic beauty of urban decay. Crumbling static gives way to ghostly vocals, distant melodies and rumbling low-end, taki..."},{"title":"BNI Leslieville Visitor's Day","date":"2019-04-17T12:30:00.000Z","endTime":"2019-04-17T14:00:00.000Z","location":"Ashbridge’s Bay Yacht Club","description":"Are you seeking to expand your client base and grow your business? On Wednesday, April 17, 2019, join us for an inspiring morning of networking and education at BNI Leslieville’s Visitor Day! As one of Toronto’s top business referral groups, we are dynamic pro..."},{"title":"#BotTO Natural Language Processing for Chatbots with Rasa","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T00:30:00.000Z","location":"OneEleven","description":"Hello! During this event, we will discuss the latest trends in Natural Language Processing (NLP) and Understanding (NLU) for developing chatbots. SCHEDULE: 6.30 pm: Registration, networking with snacks and drinks sponsored by Rasa »https://rasa.com 7:00 pm: \"B..."},{"title":"Children's Anxiety: Parent Information Nights","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Humber College Medical Centre","description":"Support and information are provided to assist you to integrate neuroscience and child development theory into your own personal style of parenting. The aim is to reduce anxiety and promote emotion regulation."},{"title":"COMPOSITION: A Poetry Workshop by roseate magazine feat. Cody Caetano","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T01:30:00.000Z","location":"Kotn","description":"This one’s for the poetry heads out there. COMPOSITION is a part of a series of workshops being introduced by roseate magazine. Hosted at KOTN, this session will take place on WED APR 17 from 8:00PM-9:30PM, and will be focusing on the art of writing poetry, wi..."},{"title":"Discover Dance with Nivedha Ramalingham","date":"2019-04-17T16:00:00.000Z","endTime":"2019-04-17T17:00:00.000Z","location":"Sony Centre for the Performing Arts, Lower Lobby","description":"Discover Dance is a free all-ages lunch series where you will be introduced to some of Toronto’s incredible dance artists. Hosted by the award-winning choreographer Nova Bhattacharya of Nova Dance. Nivedha Ramalingam is an emerging talent who is burning up sta..."},{"title":"Excel Basics 2","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Brentwood Library","description":"Learn to create charts and tables, sort your data, and more, using Microsoft Excel 2013. Pre-requisite: Excel Basics Part 1 or a basic knowledge of Microsoft Excel. Basic keyboarding and mouse skills required. Register in person at the Information Desk or by c..."},{"title":"George Brown College presents: Jewels 2019","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T03:59:00.000Z","location":"TIFF Shop","description":"Please join the George Brown College Jewellery Arts class of 2019 in celebrating their graduation exhibition. Support local artists and come see collections created by tomorrow's contemporary jewellery designers. Opening reception: April 17th 6pm. All jeweller..."},{"title":"Grow Op 2019 at the Gladstone","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Gladstone Hotel","description":"Grow Op at the Gladstone Hotel celebrates its seventh year with an exhibition of art, design and ideas on urbanism, landscape design, and contemporary art.\nThe 2019 edition considers ENERGY; Clean energy, dirty energy, social energy, positive energy, negative ..."},{"title":"Hart House Art Committee \"Syncopation: Jazz Night & Silent Auction\"","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Hart House Debates Room","description":"Art and jazz -- what more could you ask for? Join the Hart House Art Committee at our silent auction and jazz night on April 17th at the HH Debates Room to view original student art, set to the backdrop of live music from the Hart House Jazz Ensemble.\nFree adm..."},{"title":"Harvest Wednesdays Launch: Strolling Dinner, Wine Tasting & More","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Gladstone Hotel","description":"We start our seasonal farm food series with a conjuring from the earth. Enter the hotel ballroom and notice the energy embodied within a mound of dirt.\nTaste the flavours of latent winter and nascent spring. Cellared, fermented, sprouted, deep-winter green-hou..."},{"title":"Humber College Industrial Design Thesis Show","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Ontario Science Center","description":"The annual Thesis Show showcases top-notch, innovative design work by Humber’s fourth-year Bachelor of Industrial Design students. Attended by over 400 industry and design professionals, the event continues to create its indelible mark in the North American de..."},{"title":"InkWell Workshops - Memoir with Leanne","date":"2019-04-17T18:00:00.000Z","endTime":"2019-04-17T20:00:00.000Z","location":"Routes Community Centre","description":"InkWell Workshops offers free, drop-in creative-writing workshops to people living with mental-health or addictions issues led by award-winning professional writers with lived experience of mental illness. Learn how to tell your own life stories in this safe, ..."},{"title":"Learning When Not To Shut Up","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Ryerson University","description":"What does freedom of expression look like for Canadian kids? Disturbingly, it’s not very clear. Although our schools are supposed to be centres for learning critical thinking and citizenship, they impose significant restrictions on student expression. Why is t..."},{"title":"Let's Share Skills! American Sign Language","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Malvern Public Library","description":"Free community program at the Malvern Library. Come and learn basic American Sign Language. If you are already fluent in ASL, please come and share your skills!"},{"title":"OCAD University's President's Speaker Series presents: Burton Kramer","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"OCAD University","description":"OCAD University presents renowned Canadian design pioneer Burton Kramer for a free public talk. A newly minted member of the Order of Canada, he will provide insight into his nearly four decades of experience in the Canadian design industry. In 1974, he create..."},{"title":"Off The Rails Comedy","date":"2019-04-18T01:30:00.000Z","endTime":"2019-04-18T03:00:00.000Z","location":"Comedy Bar","description":"Buckle up for Toronto's craziest comedy show!\nOff The Rails Comedy is an interactive, improvised stand up show where Toronto's bravest comics make up their acts based on your suggestions! You have the power!\nHost: Sean Carson\nAna-Marija Stojic\nJoel Edmiston\nHa..."},{"title":"Opening Act Dan Rosen - Nick Beaton!","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T01:30:00.000Z","location":"Comedy Bar","description":"Every month, Dan Rosen opens for the hottest acts in town! This month he'll be opening for:\nFlux In A Box!\nSarah St-fleur!\nAdrian Sawyer!\nLucy Gervais!\nand headliner Nick Beaton!\n(Just for Laughs award-winner, Edinburgh Fringe, two-time Canadian Comedy Awards ..."},{"title":"Our Fathers, Sons, Lovers and Little Brothers PWYC matinee","date":"2019-04-17T15:00:00.000Z","endTime":"2019-04-17T16:30:00.000Z","location":"Buddies in Bad Times Theatre","description":"This is a Pay What You Can link to our 11am matinee of Our Fathers, Sons, Lovers and Little Brothers. Your ticket goes towards our theatre training programs and residencies for Black and Brown diasporic artists."},{"title":"PROFESSIONAL SINGLES SPEED DATING..AGES 27 to 38 ..BOOK WITH A FRIEND GET 15 PERCENT OFF!!","date":"2019-04-17T23:30:00.000Z","endTime":"2019-04-18T01:45:00.000Z","location":"Junction Local","description":"This niche speed dating event is for Professional Toronto Singles that want to meet someone who also has drive, ambition and takes pride in their career. So climb back down that corporate ladder just for one night to mix and mingle…you never know, you may meet..."},{"title":"Retail Human Resources Forum","date":"2019-04-17T12:15:00.000Z","endTime":"2019-04-17T16:00:00.000Z","location":"Toronto Congress Centre","description":"Retail Council of Canada’s Retail Human Resources Forum will inspire and educate attendees with contemporary and innovative strategies for creating a vibrant workplace culture. Designed by retailers, for retailers, this forum will cover topics such as HR techn..."},{"title":"Rubber Tire Peep Show w/ Glass Cannon & Charlotte Lytle","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T03:30:00.000Z","location":"Painted Lady","description":"An evening of great music and good times, with a lineup of 3 stellar local bands."},{"title":"Sacred Music for a Sacred Space","date":"2019-04-17T23:30:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"St. Anne's Anglican Church","description":"Experience two rich choral traditions - French subtlety and the mystical traditions of Eastern Europe and Russia. TMC conductor David Fallis has brought together music of these traditions in a contemplative program in the visual and acoustic splendour of St. A..."},{"title":"School of the Environment Research Day","date":"2019-04-17T16:15:00.000Z","endTime":"2019-04-17T22:00:00.000Z","location":"Faculty Club","description":"Held during Earth Week, the School of the Environment’s Research Day 2019 showcases faculty and graduate research on a broad range of environmental issues affecting the planet. Join us for a series of talks that will investigate the impacts of climate change, ..."},{"title":"Spring Awakening","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Easy steps to your best garden ever!\n- Monthly tasks for the flower beds, shrubs, veggie patch and lawn\n- When to start seeds, cut back foliage, clean up and weed\n- Right time to prune and plant shrubs, use dormant oil\n- When to plant, divide, stake and deadhe..."},{"title":"Spring Exhibitions Opening","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-18T00:00:00.000Z","location":"Art Museum at the University of Toronto","description":"Join us and celebrate!\nThe 2019 University of Toronto MVS Studio Program Graduating Exhibition features the projects of the 2019 Master of Visual Studies graduate students Dana Prieto, Mehrnaz Rohbakhsh, Miles Rufelds and Sahar Te.\nThe University of Toronto Sh..."},{"title":"The Check In","date":"2019-04-18T01:30:00.000Z","endTime":"2019-04-18T02:30:00.000Z","location":"Bad Dog Comedy Theatre","description":"An improv show where the cast uses their own lives and personal struggles as inspiration to create comedy!\nIn The Check In, a cast consisting of some of Toronto's best up and coming improvisers are challenged to test their own personal emotional boundaries as ..."},{"title":"The Landlord And Tenant Podmess: 100th Episode","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T02:00:00.000Z","location":"The Ossington","description":"The Landlord And Tenant Podmess is famous for being the only podcast with the guts to ask the question \"Can a landlord and tenant be buddies?\" Now hosts James Hartnett and Michael Balazo are inviting the public to join in as they celebrate their historic 100th..."},{"title":"The Liveable City? Transportation","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T00:30:00.000Z","location":"Art Gallery of Ontario","description":"As Impressionism in the Age of Industry takes viewers on a journey through a period of immense change in 19th century Paris, we invite speakers across various disciplines to enter into conversations around urgent issues facing Toronto today: work, affordable h..."},{"title":"Trivia Club at Farside","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T02:30:00.000Z","location":"Farside","description":"No cover!\nStarting at 8PM, that Trivia Club goodness that you know and love from six years of game show goodness in Toronto, at your living room away from home, Farside! It all takes place within three rounds of team-based trivia excellence, at one of the cool..."},{"title":"Turn Food Waste to Compost at Toronto Botanical Garden","date":"2019-04-17T22:30:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Toronto Botanical Garden","description":"Composting is a great way to dispose of food waste while also creating natural fertilizer for your garden. Learn the how-to and benefits of composting from the Worm Wranglers, vermicompost specialists. This offsite workshop will be held at Evergreen Brickworks..."},{"title":"Urban Vegetable Gardening - Grow your own food for low-carbon eating!","date":"2019-04-17T22:00:00.000Z","endTime":"2019-04-17T23:00:00.000Z","location":"Cedarbrae Library","description":"Whether you grow plants in containers or a square metre garden, no yard is too small to grow vegetables sustainably! A member from the Toronto Master Gardeners will lead this hands-on, two-part workshop to guide you through the steps.\nThe first session will be..."},{"title":"Wednesday Afternoon at the Movies: Three Coins in the Fountain, 1954","date":"2019-04-17T18:00:00.000Z","endTime":"2019-04-17T20:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Join us for a series of cinematic classics, new releases, foreign films and documentaries.\nApril 17, 2019 showing - Three Coins in the Fountain (1954) - Three American women working in Rome, Italy, share a spacious apartment and the desire to find love and mar..."},{"title":"Winter is Here ! GOT Costume party & Trivia Night","date":"2019-04-18T00:00:00.000Z","endTime":"2019-04-18T03:00:00.000Z","location":"Station Bar & Kitchen","description":"Winter is Here !!\nGet together for a fun GOT Trivia night to win awesome prizes. Teams of 4 will compete for prizes and bragging rights !!\nDress to impress your fellow GOT fans in your best GOT character outfits !! Best costume gets the iron throne."},{"title":"Zine launch: Reflections on Illness","date":"2019-04-17T23:00:00.000Z","endTime":"2019-04-18T01:00:00.000Z","location":"Another Story","description":"Edited by Nazila Bettache and Sarah Vance; a critical, poignant and at times witty collection of pieces by activists facing life-threatening illness based in Canada (occupied/unceded Indigenous territories). Includes personal essays, comics, interviews and a r..."},{"title":"Adidas & Reebok Warehouse Sale","date":"2019-04-18T14:00:00.000Z","endTime":"2019-04-19T02:00:00.000Z","location":"International Centre","description":"Get ready for the GTA’s biggest warehouse sale event of the year! StyleDemocracy is bringing the adidas & Reebok Warehouse Sale back to the International Centre in Mississauga for one weekend only. From Thursday, April 18 to Sunday, April 21, save up to 80..."},{"title":"163 JOHN ST. : THURSDAY SURPRISE SHOW @ THE CORNER","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-18T04:00:00.000Z","location":"The Corner","description":"PAUL THOMPSON'S SURPRISE SHOW Paul Thompson hosts a surprise line up of special guests. Featuring comics making their first appearance at The Corner as well as comics visiting Toronto from New York, Los Angeles, United Kingdom, and all over the world. TWO SHOW..."},{"title":"946 QUEEN ST. EAST : THE BANANAS SHOW @ THE CORNER EAST","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-18T04:00:00.000Z","location":"The Corner East","description":"Every Thursday at The Corner Comedy Club EAST, JOEY HARLEM & JEREMY DOBSKI will be hosting THE BANANAS SHOW! A lineup of Canada’s best comedians showcasing their fun and weird material. Featuring comedians from Just For Laughs, CBC, Sirius XM, and The Comedy N..."},{"title":"Ariel Quartet","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-19T02:00:00.000Z","location":"Jane Mallett Theatre, St. Lawrence Centre for the Arts","description":"Formed in Israel in 1998 when its members were middle-school students, the Quartet was awarded the prestigious Cleveland Quartet Award in 2014. The Ariel is Faculty Quartet-in-Residence at the University of Cincinnati’s College-Conservatory of Music, where the..."},{"title":"Baby Art Workshop","date":"2019-04-18T14:30:00.000Z","endTime":"2019-04-18T15:15:00.000Z","location":"Fresh Paint Studio (Danforth East)","description":"Baby Art Workshop Join us for a baby art workshop for babies to get messy with non-toxic vegetable and fruit-based paints, sponges and stamps. Mommies and daddies will have fun and help babies create their masterpieces. In this workshop, babies can make cute h..."},{"title":"Bikes & Beats","date":"2019-04-18T23:00:00.000Z","endTime":"2019-04-19T03:00:00.000Z","location":"Tranzac","description":"Join us at the Tranzac to kick off a new year of Charlie's FreeWheels bike programs for youth in Toronto! Charlie's has a full year of free bike programs planned, and we're so thrilled to have this opportunity to celebrate with our community of supporters. In ..."},{"title":"Bollywood Costume Party","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-19T03:00:00.000Z","location":"Station Cafe & Kitchen","description":"Get ready for an amazing evening full of fun , frolic and masti !! Bollywood Costume Party - Dress up as your favourite bollywood characters , new and old Desi Stand up comedy - By Pardesi Laughs Live Bollywood music by the awesome trio - Delhi Express Best dr..."},{"title":"Book Launch, Coconut Dreams by Derek Mascarenhas","date":"2019-04-18T23:00:00.000Z","endTime":"2019-04-19T01:00:00.000Z","location":"Another Story","description":"Coconut Dreams explores the lives of the Pinto family through seventeen linked short stories. Starting with a ghost story set in Goa, India in the 1950s, the collection shifts to the unique perspectives of two adolescents, Aiden and Ally Pinto. Derek Mascarenh..."},{"title":"Cannabis Comedy Festival Presents: Dope","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-19T02:00:00.000Z","location":"Lithuanian House","description":"DOPE Presented by the Cannabis Comedy Festival at the LIThuanian House. There will be no short of laughs, but there might be low on seats. Featuring some of Toronto’s Top Comics and Headlined by Danny Martinello. We have also included some erotic pole dancing ..."},{"title":"Casual Chess Club","date":"2019-04-18T23:00:00.000Z","endTime":"2019-04-19T00:00:00.000Z","location":"Beaches Branch, Toronto Public Library","description":"Join other chess players in a friendly and welcoming environment for casual play. All ages and skill levels are welcome.\nDrop in. No registration required.\nAudiences: Adult • School-Age Children • Teen\nCategories: Hobbies Crafts & Games"},{"title":"Crocs Warehouse Sale","date":"2019-04-18T14:00:00.000Z","endTime":"2019-04-18T23:00:00.000Z","location":"Markham Fairgrounds","description":"Get ready for our biggest warehouse sale of the year.\r\nFEATURING\r\nCrocs\r\nCallaway Golf\r\nSaucony Running Shoes\r\nFamous Canadian Apparel Brand\n\r\nSave 50 to 80% off these awesome brands\n\r\nWhen:\r\nThursday April 18th to Monday April 22nd\n\r\nHours:\r\nThursday & Friday..."},{"title":"Designer Shoe Warehouse Sale 2019","date":"2019-04-18T14:00:00.000Z","endTime":"2019-04-18T22:00:00.000Z","location":"International Centre","description":"Over 30,000 pairs of shoes up to 80% off from brands like Dr. Scholls, Ed by Ellen Degeneres, Fergalicious, Franco Sarto, Lucky Brand, Jessica Simpson, Natrualizer, Sam Edelman, Via Spiga, Vince Camuto."},{"title":"Designing the Movies: Mon Oncle","date":"2019-04-18T22:45:00.000Z","endTime":"2019-04-19T01:00:00.000Z","location":"Revue Cinema","description":"Jacques Tati's Oscar-winning 1958 comedy, his first in colour and the second to feature his quixotic Monsieur Hulot. Prior to the screening, series host Nathalie Atkinson and guest Shawn Micallef, urban columnist at Toronto Star, discuss how this satire of the..."},{"title":"Earth Love & Learn - Yoga, Meditation & Sustainability Tips","date":"2019-04-18T23:00:00.000Z","endTime":"2019-04-19T00:30:00.000Z","location":"Hoame","description":"Join Irina Andreea and Cassidy Thedorf for this celebration of earth day. A portion of proceeds will be donate to One Tree Planted to help support global reforestation.\nConnect deeply with breath, with yourself, and with the earth beneath you as we begin with ..."},{"title":"GREAT ART: Rembrandt in Black and White: The Printmaker","date":"2019-04-18T18:00:00.000Z","endTime":"2019-04-18T19:00:00.000Z","location":"Toronto Reference Library","description":"Art historian Anne Thackray shows how Rembrandt’s immensely creative and fertile imagination embraced the expressive possibilities of prints, the most widespread art form of his times. Explore Rembrandt’s innovative approach to printmaking and see how creative..."},{"title":"Indie with: Jitensha - Josh Movers & The Shakers - neGar Music","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-18T04:00:00.000Z","location":"The Cavern Bar","description":"Awesome indie music $10/PWYC"},{"title":"LuchaPalooza: Lucha Libre x Rock Concert","date":"2019-04-18T23:00:00.000Z","endTime":"2019-04-19T02:00:00.000Z","location":"Opera House","description":"This is a +19 event. Valid I.D. needed upon entry.\nGet ready for the return of Lucha Libre Wrestling to the Opera House with LuchaPalooza!!\nWhat you'll experience:\n6 highflying Lucha Libre Fights!\nLive musical performance!\nLucha Libre prize giveaways!\nCold Dri..."},{"title":"Nadah El Shazly, ZOE","date":"2019-04-19T01:00:00.000Z","endTime":"2019-04-18T05:00:00.000Z","location":"Burdock","description":"The Music Gallery presents\nNadah El Shazly + ZOE\nPart of the Departures series\nCurated by Tad Michalak\nLast year’s Land of Kush concert at the Aga Khan museum was a season highlight, and marked our introduction to Egyptian singer Nadah El Shazly. She returns t..."},{"title":"Online Reputation Management with Veronica Chail","date":"2019-04-18T22:30:00.000Z","endTime":"2019-04-19T00:30:00.000Z","location":"Toronto Reference Library","description":"Today, online reputation management (ORM) is a necessary part of your marketing strategy.\nVeronica Chail, an award-winning Canadian journalist and the CEO of VC Strategies, examines the current online culture and provides tools to help you:\n- Curate content th..."},{"title":"Outer Worlds - Closing Night Images Festival","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-18T06:00:00.000Z","location":"Cinesphere","description":"This program presents five original IMAX films by Canadian artists Oliver Husain, Lisa Jackson, Kelly Richardson, Michael Snow, and Leila Sujir. In keeping with the cinematic genre typical of IMAX films—the larger-than-life landscape that forms an outer world ..."},{"title":"Retail Marketing Conference","date":"2019-04-18T11:30:00.000Z","endTime":"2019-04-18T21:30:00.000Z","location":"The Delta Hotels Downtown, Toronto","description":"Marketing inspiration and new tools are everywhere. But what is most effective in today’s aggressive retail landscape? Canada’s strongest retail marketers will share what’s working for them. Hear from speakers at IKEA Canada, Spud.ca, Holt Renfrew, Golf Town, ..."},{"title":"Rock 'N' Horse Live","date":"2019-04-19T01:00:00.000Z","endTime":"2019-04-18T06:00:00.000Z","location":"Rock 'n' Horse Saloon","description":"A boot stompin' girl powered showcase featuring Genevieve Fisher with Elyse Saunders!"},{"title":"Sketch Swap Showcase","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-19T01:30:00.000Z","location":"Social Capital Theatre","description":"The best of Toronto's Sketch Comedy Scene will be performing the best sketches seen on Toronto stages in the last year and they're not allowed to do their own material!\nThere's gonna be drinking.\nThere's gonna be laughing.\nThere's gonna be some of the best dam..."},{"title":"Spring Wreath Workshop at Toronto Botanical Garden","date":"2019-04-18T22:30:00.000Z","endTime":"2019-04-19T01:30:00.000Z","location":"Toronto Botanical Garden","description":"Brighten your home with a wreath suitable for a door or wall. Decorate a twig wreath with fresh, dried and preserved plant material. Cost includes materials."},{"title":"Stranger Still - Songs of Bread, Wine and Salt","date":"2019-04-18T22:30:00.000Z","endTime":"2019-04-19T00:00:00.000Z","location":"Anansi Bookshop","description":"Stranger Still is a new project by composer Pete Johnston that sets the words of Nova Scotia-born poet Alden Nowlan (1933-83) to music. The band features Randi Helmers and Mim Adams (vocals), Rob Clutton (bass), and Pete Johnston (guitar).\nThis performance wil..."},{"title":"Teza, part of the film series Resistance & Revolution: The Cinema of Haile Gerima","date":"2019-04-18T22:45:00.000Z","endTime":"2019-04-19T01:00:00.000Z","location":"TIFF Bell Lightbox","description":"Film\nTeza\nDir. Haile Gerima\n2008 | 140 min\nThe film reflects on the effects of the fall of Emperor Selassie, and the ways in which political upheaval and social change have impacted cultures and nations across the larger African Diaspora. Told mainly through a..."},{"title":"The Experiment","date":"2019-04-19T01:30:00.000Z","endTime":"2019-04-19T03:00:00.000Z","location":"Bad Dog Comedy Theatre","description":"Come see a hilarious improv comedy show from your fave performers from Baroness Von Sketch, Workin' Moms, Sunnyside, and Netflix's Umbrella Academy."},{"title":"The Future of Health Care in an Aging World","date":"2019-04-18T12:00:00.000Z","endTime":"2019-04-18T13:00:00.000Z","location":"Rotman School of Management","description":"Our panel of three distinguished professors who each hold a Sandra A. Rotman Chair at the University of Toronto will share their thoughts on what health care might look like ten years from now and who is going to be impacted.\nSpeakers:\n- Dr. Esme Fuller-Thomso..."},{"title":"The Random Throwdown","date":"2019-04-18T22:30:00.000Z","endTime":"2019-04-19T03:00:00.000Z","location":"Creeds Coffee Bar on Dupont","description":"Theme: The Random Throwdown - Only luck is on your side.\nDoors open at 630pm\nCompetition starts at 8pm\n24 competitors\nDrinking is encouraged\nRound 1 - Blindfolded\nRound 2 - Macchiatto Latte Art\nRound 3 - Pour into a random object (avocado, melon, something, we..."},{"title":"The Skadoos Live at Linsmore Tavern","date":"2019-04-19T00:00:00.000Z","endTime":"2019-04-18T04:00:00.000Z","location":"Linsmore Tavern","description":"The Skadoos first show of 2019!\nWe'll be joined by our DJ Doo - DJ Z Forbes to bring you a fine blend of ska and reggae all night long.\nCome on out, it's the Thursday before a long weekend!"},{"title":"Thought Exchange - Whispers From the Cosmos","date":"2019-04-18T23:00:00.000Z","endTime":"2019-04-19T00:00:00.000Z","location":"Brentwood Library","description":"Speaker: Dr. Katie Breivik, University of Toronto.\nThe recent discovery of gravitational waves marks the dawn of a new field of astronomy and provides new opportunities to study several elusive systems in the Cosmos. Compact binaries, made up of pairs of stell..."},{"title":"WIPE OUT! with DJ Luke Harley","date":"2019-04-19T02:00:00.000Z","endTime":"2019-04-18T06:00:00.000Z","location":"Swan Dive","description":"Punk, Psych, Surf & good times!"},{"title":"International Fan Festival Toronto","date":"2019-04-19T14:00:00.000Z","endTime":"2019-04-20T01:00:00.000Z","location":"Metro Toronto Convention Centre","description":"Toronto's newest anime convention rolls into town on Easter weekend 2019! International Fan Festival (IFF Toronto for short), is a multi-day, multi-fandom, Japanese-focused event. We strive to bring high quality guests, content, and experiences to the fans of ..."},{"title":"Jai Wolf","date":"2019-04-19T23:30:00.000Z","endTime":"2019-04-20T03:00:00.000Z","location":"Phoenix Concert Theatre","description":"Embrace Presents: Jai Wolf The Cure To Loneliness Tour Doors: 7:30pm 19+ Event Listen to Jai Wolf’s new singles: “Lose My Mind”: http://jaiwolf.co/losemymind “Telepathy”: http://jaiwolf.co/telepathy Pre-Save / Pre-Order Jai Wolf’s new album “The Cu..."},{"title":"163 John St. : FRIDAY SHOWCASE @ THE CORNER","date":"2019-04-19T23:00:00.000Z","endTime":"2019-04-19T04:00:00.000Z","location":"The Corner","description":"It's taking place at the newest, hottest comedy club, THE CORNER! FRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show! There's gonna be ..."},{"title":"4.19 CannaEve - Elevated Paint Puff Pass","date":"2019-04-20T02:00:00.000Z","endTime":"2019-04-19T05:00:00.000Z","location":"Secret Loft","description":"CANNAMAS\n420 weekend Festivus\nWe are beyond excited about this years 420!\nWe want to celebrate the first 420 post legalization with a weekend long festivus! Like Christmas but instead of Jesus and a tree it’s like in April and we party in the name of Mary Jane..."},{"title":"420 Comedy Festival 2019","date":"2019-04-20T00:00:00.000Z","endTime":"2019-04-20T03:00:00.000Z","location":"Multiple Venues","description":"This is 420 Comedy Festival’s third year and our festival is bigger and better than ever! 💨💨\nWe have four venues, Underground Cafe 420, Rivoli, Bad Dog Theatre Company & Comedy Bar with tons of the best comedians the Big Smoke has to offer. This year we are ..."},{"title":"946 QUEEN ST. EAST : FRIDAY SHOWCASE @ THE CORNER EAST","date":"2019-04-20T00:00:00.000Z","endTime":"2019-04-19T04:00:00.000Z","location":"The Corner East","description":"It's taking place at the newest, hottest comedy club, THE CORNER!\nFRIDAY SHOWCASE is a show with a variety of 6 headliner worthy comics on every show performing tight 10 minute sets. Come see Toronto's best comedians all together in one show!\nThere's gonna be ..."},{"title":"CANNAMAS 420 long weekend Festivus","date":"2019-04-20T02:00:00.000Z","endTime":"2019-04-19T22:00:00.000Z","location":"The Shhh Loft","description":"CANNAMAS\n420 weekend Festivus\nWe are beyond excited about this years 420!\nWe want to celebrate the first 420 post legalization with a weekend long festivus! Like Christmas but instead of Jesus and a tree it’s like in April and we party in the name of Mary Jane..."},{"title":"CF Markville Open on Good Friday","date":"2019-04-19T15:00:00.000Z","endTime":"2019-04-19T22:00:00.000Z","location":"CF Markville","description":"With Easter on the horizon, Markham residents are looking for some last-minute activities to spend with their family and friends. CF Markville will be open to welcome guests with limited holiday hours over Easter weekend. Featuring some of the most recognized ..."},{"title":"Decade: A 1995-2005 Dance Party","date":"2019-04-20T02:00:00.000Z","endTime":"2019-04-19T06:30:00.000Z","location":"Clinton's Tavern","description":"Get psyched because on Friday April 19th you've got plans! All the 95-05 songs you promised you'd never forget will be thrown down to help you relive your best life.\nDoors at 10pm • $10 Cover\nClinton's (693 Bloor St. W at Christie Station)"},{"title":"DJ Granny pantys","date":"2019-04-20T02:00:00.000Z","endTime":"2019-04-19T06:00:00.000Z","location":"Swan Dive","description":"Rock, Psych, Post Punk & oddities\nA pants shakin' good time for one & all!\n*FREE*"},{"title":"Dr. Jordan Peterson & Slavoj Zizek Debate","date":"2019-04-19T23:30:00.000Z","endTime":"2019-04-20T03:00:00.000Z","location":"Sony Centre for the Performing Arts","description":"Dr. Jordan Peterson & Slavoj Zizek\r\nHappiness: Capitalism v. Marxism\n\r\nSale Dates and Times:\r\nPublic Onsale : Fri, 1 Mar 2019 at 10:00 AM\r\nLive Nation Presale : Thu, 28 Feb 2019 at 11:00 AM\r\nLive Nation Mobile App Presale : Thu, 28 Feb 2019 at 11:00 AM Faceboo..."},{"title":"Drunk Julius Caesar","date":"2019-04-19T23:30:00.000Z","endTime":"2019-04-19T04:00:00.000Z","location":"Wychwood Theatre","description":"It’s toga night every night in Drunk Julius Caesar!\n400 years ago, Shakespeare wrote a play meditating on power, tyranny, and ethics. This year, around his birthday, we’re ruining it! Two lead actors each night will drink their way through the play, while a ca..."},{"title":"Eggapalooza Family Event","date":"2019-04-19T15:00:00.000Z","endTime":"2019-04-19T21:00:00.000Z","location":"Richmond Green Park","description":"Eggapalooza will take place Easter long weekend, April 19-21, 2019 at the Richmond Green Park. The event will feature an organized Egg Hunt, inflatables, train rides, petting zoos, photos with the Easter Bunny, a mini bonnet parade, a kite flying station, a st..."},{"title":"Electronic Waste Collection at Organic Garage","date":"2019-04-19T15:00:00.000Z","endTime":"2019-04-19T20:00:00.000Z","location":"Multiple Venues","description":"As part of our commitment to the environment, Organic Garage is holding a 3-day Electronic Waste Collection Event at all four of our locations: Liberty Village, The Junction, Oakville and Thornhill. The event will take place from Friday April 19th to Sunday Ap..."},{"title":"GYMSHORTS & THICK & Bad Waitress & the Mightabins","date":"2019-04-20T01:00:00.000Z","endTime":"2019-04-19T06:00:00.000Z","location":"Bovine Sex Club","description":"GYMSHORTS (Burger Records) returns! THICK (from Brooklyn, NY) - first time in Toronto! With Toronto punk rockers Bad Waitress (Royal Mountain Records) and the Mightabins!"},{"title":"HEY GIRL HEY: Bad Friday!","date":"2019-04-20T02:30:00.000Z","endTime":"2019-04-19T06:30:00.000Z","location":"The Baby G","description":"Happy Long Weekend, girl! Come get bad with us at The Baby G at your fave queer hip-hop/r&b; dance party celebrating female and non-binary artists!\nAvec:\n-The Iconic 12:30 Floorshow starring your personal saviour Beardoncé!\n-DJ Orange Pekoe playing all the bop..."},{"title":"Hillcrest Open Good Friday 2019","date":"2019-04-19T15:00:00.000Z","endTime":"2019-04-19T22:00:00.000Z","location":"Hillcrest Mall","description":"For your convenience, Hillcrest is open Good Friday, April 19, 2019 from 11 a.m. – 6 p.m. Retailers include Sporting Life, West Coast Kids, HomeSense/Marshalls, Old Navy and Indigo. Hillcrest wishes all a Happy Easter weekend."},{"title":"Improv Showdown","date":"2019-04-19T18:00:00.000Z","endTime":"2019-04-19T19:00:00.000Z","location":"Second City","description":"Get ready Toronto, The Second City is taking family entertainment to a mind-blowing new level! Two hilarious teams of top-notch improvisers will face off in a winner takes all comedy showdown – and they’re going to need your help! Fuelled by weird suggestions ..."},{"title":"In the Theatre of Air, North America Tour 2019","date":"2019-04-20T00:00:00.000Z","endTime":"2019-04-20T01:30:00.000Z","location":"Array Space","description":"The Marsyas Trio (flute, cello, piano) celebrate their 10th anniversary with music by British and American women composers. The programme includes pieces by Louise Farrenc, Amy Beach, Hilary Tann and Thea Musgrave.\nThe Marsyas Trio has forged a place as a dyna..."},{"title":"Kidnetix 13th Annual Easter Egg Hunt","date":"2019-04-19T13:00:00.000Z","endTime":"2019-04-19T20:30:00.000Z","location":"Kidnetix","description":"Join the fun at Kidnetix Brampton and Toronto 13th Annual Easter Egg Hunt. Egg-citement for the whole family. Hunt for 1000's of Easter candies in our indoorplayground, FREE photo booth with the Easter Bunny, Crafts, fun interactive petting zoo, Easter basket ..."},{"title":"Les Femmes Fatales Presents Shameless","date":"2019-04-20T00:00:00.000Z","endTime":"2019-04-20T03:30:00.000Z","location":"Buddies in Bad Times","description":"Les Femmes Fatales are unabashedly, purely ourselves.\nIntentionally Femme.\nIntentionally glamourous.\nIntentionally tough and tender.\nIntentionally full of survivorship and learning the craft of alchemy of turning surviving into thriving.\nPain into power.\nAlway..."},{"title":"National Service Dogs' Easter Egg Hunt for Dogs","date":"2019-04-19T14:00:00.000Z","endTime":"2019-04-19T17:00:00.000Z","location":"Coronation Park","description":"National Service Dogs’ Easter Egg Hunt for Dogs is a family event that includes your fur baby.\nIt has been hosted in various cities over the last 20 years. Getting its start in Oakville in 1998, the event quickly became NSD’s largest and most anticipated fundr..."},{"title":"Robbie Rox and The Power Quintet Return to the Linsmore Tavern for Good Friday!","date":"2019-04-20T00:00:00.000Z","endTime":"2019-04-19T04:00:00.000Z","location":"Linsmore Tavern","description":"Friday April 19, the Linsmore Tavern is very excited to welcome back Robbie Rox and his Power Quintet for their yearly Good Friday show at the Linsmore Tavern! This has become somewhat of a really fun tradition as Robbie Rox and The Power Quintet has played so..."},{"title":"Silent Shout: Crying High, ZONES, Esther Splett","date":"2019-04-20T01:00:00.000Z","endTime":"2019-04-19T06:00:00.000Z","location":"Handlebar","description":"We're so very excited to present Crying High's debut album release party, a co-presentation with Montreal's Arbutus Records!\nBombastic electronic pop with a pure heart, David Kleiser aka Crying High has only begun his inevitable ascent, catch him as it's all b..."},{"title":"Spring Canadian Pet Expo 2019","date":"2019-04-19T14:00:00.000Z","endTime":"2019-04-19T21:00:00.000Z","location":"The International Centre","description":"Join us for one huge weekend celebrating pets!\nFree parking, entertainment, hundreds of pet vendors, interactive activities for you and your pet, photo opportunities and, pet celebrities such as Suki the Cat (1.3 million followers) and Gone to the Snow Dogs (4..."},{"title":"Stereo Ferment","date":"2019-04-20T02:00:00.000Z","endTime":"2019-04-19T06:00:00.000Z","location":"Farside","description":"No cover!\nDJ Oreku spins Global Grooves and Afrobeat https://www.mixcloud.com/oreku/"},{"title":"Toronto Beach Chorale - Durufle Requiem","date":"2019-04-19T23:30:00.000Z","endTime":"2019-04-20T01:45:00.000Z","location":"Church of St Aidan's","description":"Join Toronto Beach Chorale for our Good Friday Concert - Maurice Duruflé Requiem with motets by Gounod, Fauré and Poulenc. Tickets $25 in advance, $30 door (Youth 7-18: $12.50/$15 door). The Duruflé Requiem combines elements of Debussy, Messiaen and Fauré into..."},{"title":"Toy Factory Fridays Presents: CID","date":"2019-04-20T02:00:00.000Z","endTime":"2019-04-19T07:00:00.000Z","location":"ToyBox Nightclub","description":"Toy Factory Fridays Presents: CID\nTOYBOX – TORONTO\nFriday, April 19, 2019\nMANZONE & STRONG\n10:00PM\nhttps://www.ticketweb.ca/event/cid-toybox-formerly-known-as-uniun-tickets/9158765?pl=ink\n19+"},{"title":"Vessi Pop up - The ridiculously comfortable, fully waterproof knit shoes.","date":"2019-04-19T14:00:00.000Z","endTime":"2019-04-20T01:30:00.000Z","location":"Eaton Centre","description":"Vessi, the world’s only 100% waterproof knit sneaker company, is coming to Toronto with its first experiential pop-up.\nTo show off their ridiculously comfortable, one-of-a-kind waterproof yet breathable knit shoe, the direct-to-consumer brand is giving custome..."}]}